{
    "scholar_id": "1k0rojcAAAAJ",
    "name": "‪Penny Rheingans‬ - ‪Google Scholar‬",
    "description": [
        "In this talk, I will introduce my newly created data visualization projects about various environmental issues such as drought, wildfire and plastic pollution. The projects explore new ways of visualizing and sonifying data in conjunction with art and technology, and bring awareness about climate change issues to the viewers.",
        " Visualization can be a powerful tool to enhance learning and to better support the learning process. Tailoring visualization to the specific audiences and goals of these situations can increase the likelihood of effective communication. In many cases, visualizations which require limited prior specific domain knowledge are helpful. Similarly, when crafting visualization development experiences for students in visualization courses, selecting easy-to-understand application domains for projects helps students to leverage their existing intuition about the domain in order to be able to focus on developing skills in visualization. Visualizations offer the potential to enrich educational settings, making concepts more engaging, concrete, and accessible. Visualizations for student audiences present both challenges and opportunities. The challenges are grounded in the potentially limited background knowledge of students, the …",
        "Data visualization is the user-and task-oriented transformation of data from measurement or simulation, as well as from models (empirically crafted or machinelearned) into interactive images for exploration, analysis, and presentation. It has become an indispensable central part of the knowledge discovery process in many fields of contemporary endeavor. Since its inception about three decades ago, the techniques of data visualization have aided scientists, engineers, medical practitioners, analysts, and others in dealing with a wide variety of data. One of the powerful strengths of data visualization is the effective and efficient utilization of the human sensory and cognitive system to enable and support instructive exploration, complex analysis, and critical decision making, through the recognition of relevant patterns, the observation of unseen relations, and the identification of new connections with other data and …",
        "Many undergraduates who pursue a major in Computer Science (CS) at rural universities identify themselves as first-generation students. There is a large body of research that confirms first-generation students are more likely to switch from CS to a different major, or leave their university completely within the first year. In response, this study explored the challenges that first-generation students from rural backgrounds face, and factors that might increase their chances of retention and success within the major. Additionally, the study identified thematic differences between first-generation students and non-first-generation students that highlight potential setbacks, such as their previous exposure and preparation for CS concepts, and their confidence in their ability to succeed in the courses and major. The poster provides details of the survey and other evaluative protocols as well as the analysis results and …",
        "Visualizations intended for broad audiences present challenges and potential not typically seen in the more typical situation of creating visualizations through a close collaboration with a domain expert who is already motivated to understand the data through the visualization. In contrast to the explorative character of the process where visualization is used to gain a better understanding of new data within a research workflow, we will focus here on the development and design of fine-tuned visualizations or tools for communication purposes. More specifically, we define visualization for broad audiences as creating visualizations or visualization tools intended for heterogeneous audiences (who may have domain knowledge but differing abilities), distinct audience groups (domain experts in different part of a process who have different goals), large groups of collaborating experts, or the general public (who may have …",
        "Secure compilation is an emerging field that puts together advances in security, programming languages, verification, systems, and hardware architectures in order to devise secure compilation chains that eliminate many of today’s vulnerabilities. Secure compilation aims to protect a source language’s abstractions in compiled code, even against low-level attacks. For a concrete example, all modern languages provide a notion of structured control flow and an invoked procedure is expected to return to the right place. However, today’s compilation chains (compilers, linkers, loaders, runtime systems, hardware) cannot efficiently enforce this abstraction: linked low-level code can call and return to arbitrary instructions or smash the stack, blatantly violating the highlevel abstraction. The emerging secure compilation community aims to address such problems by devising formal security criteria, efficient enforcement mechanisms, and effective proof techniques. This seminar strived to take a broad and inclusive view of secure compilation and to provide a forum for discussion on the topic. The goal was to identify interesting research directions and open challenges by bringing together people working on building secure compilation chains, on developing proof techniques and verification tools, and on designing security mechanisms.",
        "At our university, women are a minority in all computing and engineering majors. This situation is mirrored at other universities nationwide, as well as in technical industries. Stereotype threat, the risk of confirming a negative stereotype about one's social group, can result in women not performing as well as their male counterparts in computing, mathematics, and engineering courses. The aftermath of these experiences cause women to fear they do not belong or are not \"smart enough\", resulting in women switching to a different major. Even high-performing women can be subject to these pressures. We present a Scholar model for increasing gender diversity in technology fields and an evaluation of its impact on the retention and success of women in computing and engineering majors. We compare the performance of Scholars to that of non-Scholars with similar demographic and academic backgrounds who …",
        "This report documents the program and the outcomes of Dagstuhl Seminar 18041\" Foundations of Data Visualization\". It includes a discussion of the motivation and overall organization, an abstract from each of the participants, and a report about each of the working groups.",
        "OBJECTIVETo determine whether patients using the Centers for Medicare and Medicaid Services (CMS) Hospital Compare website (http://medicare.gov/hospitalcompare) can use nationally reported healthcare-associated infection (HAI) data to differentiate hospitals.DESIGNSecondary analysis of publicly available HAI data for calendar year 2013.METHODSWe assessed the availability of HAI data for geographically proximate hospitals (ie, hospitals within the same referral region) and then analyzed these data to determine whether they are useful to differentiate hospitals. We assessed data for the 6 HAIs reported by hospitals to the Centers for Disease Control and Prevention (CDC).RESULTSData were analyzed for 4,561 hospitals representing 88% of registered community and federal government hospitals in the United States. Healthcare-associated infection data are only useful for comparing hospitals if they …",
        "To retain our stature as a science and technology leader, the US will need to increase the number of students earning undergraduate STEM degrees by about 34% annually [24]. While all STEM occupations are important, the need for computing and engineering professionals is critical to our nation’s future economic success and protection of its assets and infrastructure [20-22]. Between 2014 and 2024, the number of jobs in the computer and mathematical occupational group will grow by 12%. There will also be higher than average growth in the areas of biomedical (23%), environmental (12%), and petroleum engineering (10%)[2].Nationally, nearly half of the undergraduates completing STEM degrees begin their academic careers at community colleges [9]. Women and members of ethnic/racial minority groups currently make up 70% of all college students, but they continue to be underrepresented in both …",
        "To retain our stature as a science and technology leader, the US will need to increase the number of students earning undergraduate STEM degrees by about 34% annually [24]. While all STEM occupations are important, the need for computing and engineering professionals is critical to our nation’s future economic success and protection of its assets and infrastructure [20-22]. Between2014 and 2024, the number of jobs in the computer and mathematical occupational group will grow by 12%. There will also be higher than average growth in the areas of biomedical (23%), environmental (12%), and petroleum engineering (10%)[2].Nationally, nearly half of the undergraduates completing STEM degrees begin their academic careers at community colleges [9]. Women and members of ethnic/racial minority groups currently make up 70% of all college students, but they continue to be underrepresented in both computing and engineering majors at two-and four-year institutions. The broader term “underrepresented students” is typically used to refer to a subset of the larger population of undergraduate students",
        "T-SITE: A UMBC Community of Transfer Scholars in Computing, Information Technology, \nand Engineering Toggle navigation Login Toggle navigation View Item Maryland Shared \nOpen Access Repository Home ScholarWorks@UMBC UMBC Academic Centers and \nInstitutes UMBC Center for Women in Technology (CWIT) View Item Maryland Shared Open \nAccess Repository Home ScholarWorks@UMBC UMBC Academic Centers and Institutes \nUMBC Center for Women in Technology (CWIT) View Item × On Tuesday, November 14, MD-SOAR \nwill migrate to the latest version of DSpace. Beginning at 7AM, the MD-SOAR platform will \nbe unavailable while the upgrade is completed. We apologize for any inconvenience this \nmay cause. T-SITE: A UMBC Community of Transfer Scholars in Computing, Information \nTechnology, and Engineering Thumbnail Links to Files https://peer.asee.org/board-61-t-site-a-umbc-…",
        "OBJECTIVEHospital-acquired infection (HAI) data are reported to the public on the Centers for Medicare and Medicaid Services (CMS) Hospital Compare website. We previously found that public understanding of these data is poor. Our objective was to develop an improved method for presenting HAI data that could be used on the CMS website.DESIGNRandomized controlled trial comparing understanding of data presented using the current CMS presentation strategy versus a new strategy.SETTINGA 760-bed tertiary referral hospital.PARTICIPANTSA total of 61 patients were randomly selected within 24 hours of admission.INTERVENTIONParticipants were shown HAI data as presented on the CMS Hospital Compare website (control arm) or data formatted using a new method (experimental arm).RESULTSNo statistically significant demographic differences were identified between study arms. Although 47 …",
        "BACKGROUNDPublic reporting of hospital quality data is a key element of US healthcare reform. Data for hospital-acquired infections (HAIs) are especially complex.OBJECTIVETo assess interpretability of HAI data as presented on the Centers for Medicare and Medicaid Services Hospital Compare website among patients who might benefit from access to these data.METHODSWe randomly selected inpatients at a large tertiary referral hospital from June to September 2014. Participants performed 4 distinct tasks comparing hypothetical HAI data for 2 hospitals, and the accuracy of their comparisons was assessed. Data were presented using the same tabular formats used by Centers for Medicare and Medicaid Services. Demographic characteristics and healthcare experience data were also collected.RESULTSParticipants (N=110) correctly identified the better of 2 hospitals when given written descriptions of the …",
        "This paper describes elements introduced into a combined undergraduate/graduate data visualization course in order to make it more active and engaging. These elements include pre-class readings, interactive quizzes, reading reflections, and team-based activities.",
        "This report documents the program and the outcomes of Dagstuhl Seminar 14231 “Scientific Visualization”. It includes a discussion of the motivation and overall organization, an abstract from each of the participants, and a report from each of the working groups.",
        "Background Public reporting of hospital quality data is a key element of health care reform in the United States, with the goals of improving quality of care while reducing costs by encouraging reductions in preventable adverse events (PAE). Healthcare-associated infections (HAIs) are a common PAE that cause substantial morbidity and mortality. HAI rates for hospitals are widely available online, including via http://medicare.gov/ hospitalcompare. Publishing these data requires considerable effort and expense for hospitals and the government. However, there has been little research on the ability of the general public to understand published HAI quality measures. Methods Aim 1: We assessed understanding of HAI data as presented on CMS Hospital Compare among a random sample of University of Maryland Medical Center (UMMC) patients. Participants compared HAI data for two hospitals, and the accuracy of their comparisons was assessed. Aim 2: We analyzed nationwide HAI data to determine their utility in distinguishing among hospitals, and assessed characteristics of this dataset (e.g. geographic areas with hospitals that have substantially different HAI denominators or risk-adjustment profiles) that inform how HAI data are presented. Aim 3: We developed a new method for presenting HAI data to the public. We then conducted a randomized controlled trial comparing this new method to the method from CMS Hospital Compare among a random sample of UMMC patients. Results Aim 1: Participants were able to correctly assess hospital performance 38% of the time (most complex data) to 72% (least complex) of the time. Aim 2: In many …",
        "Tailoring First-Year Seminars for Computing Majors Toggle navigation Login Toggle \nnavigation View Item Maryland Shared Open Access Repository Home ScholarWorks@UMBC \nUMBC Academic Centers and Institutes UMBC Center for Women in Technology (CWIT) \nView Item Maryland Shared Open Access Repository Home ScholarWorks@UMBC UMBC \nAcademic Centers and Institutes UMBC Center for Women in Technology (CWIT) View Item \nTailoring First-Year Seminars for Computing Majors Thumbnail Links to Files http://sc.edu/fye/events/presentation/sit/2014/files/CR-77%20Tailoring%20First-Year%20Seminars%20for%20Computing%20Majors.pdf \nPermanent Link http://hdl.handle.net/11603/12674 Collections UMBC Center for Women in \nTechnology (CWIT) UMBC Computer Science and Electrical Engineering Department \nUMBC Faculty Collection UMBC Student Collection Metadata Show full item …",
        " Multivariate volume visualization is important for many applications including petroleum exploration and medicine. State‐of‐the‐art tools allow users to interactively explore volumes with multiple linked parameter‐space views. However, interactions in the parameter space using trial‐and‐error may be unintuitive and time consuming. Furthermore, switching between different views may be distracting. In this paper, we propose GuideME: a novel slice‐guided semiautomatic multivariate volume exploration approach. Specifically, the approach comprises four stages: attribute inspection, guided uncertainty‐aware lasso creation, automated feature extraction and optional spatial fine tuning and visualization. Throughout the exploration process, the user does not need to interact with the parameter views at all and examples of complex real‐world data demonstrate the usefulness, efficiency and ease‐of‐use of our method.",
        " Data visualization is now a popular medium for journalistic storytelling. However, current visualization tools either lack support for storytelling or require significant technical expertise. Informed by interviews with journalists, we introduce a model of storytelling abstractions that includes state‐based scene structure, dynamic annotations and decoupled coordination of multiple visualization components. We instantiate our model in Ellipsis: a system that combines a domain‐specific language (DSL) for storytelling with a graphical interface for story authoring. User interactions are automatically translated into statements in the Ellipsis DSL. By enabling storytelling without programming, the Ellipsis interface lowers the threshold for authoring narrative visualizations. We evaluate Ellipsis through example applications and user studies with award‐winning journalists. Study participants find Ellipsis to be a valuable prototyping …"
    ],
    "title": [
        "‪Visualizing Environmental Data‬",
        "‪Reaching broad audiences in an educational setting‬",
        "‪Foundations of data visualization‬",
        "‪First Generation-Rural Computer Science Students: Challenges in Retention and Success‬",
        "‪Reflections on visualization for broad audiences‬",
        "‪Dagstuhl Reports, Vol. 8, Issue 5 ISSN 2192-5283‬",
        "‪A model for increasing gender diversity in technology‬",
        "‪Foundations of Data Visualization (Dagstuhl Seminar 18041)‬",
        "‪Can national healthcare-associated infections (HAIs) data differentiate hospitals in the United States?‬",
        "‪Board# 61: T-SITE: A UMBC Community of Transfer Scholars in Computing, Information Technology, and Engineering‬",
        "‪T-STE: A UMBC community of transfer scholars in computing, information technology, and engineering‬",
        "‪T-SITE: A UMBC Community of Transfer Scholars in Computing, Information Technology, and Engineering‬",
        "‪Improving the understanding of publicly reported healthcare-associated infection (HAI) data‬",
        "‪Lack of patient understanding of hospital-acquired infection data published on the Centers for Medicare and Medicaid Services Hospital Compare website‬",
        "‪Minor adventures in flipped classrooms, team-based learning, and other pedagogical buzzwords‬",
        "‪Dagstuhl Reports, Vol. 4, Issue 6 ISSN 2192-5283‬",
        "‪Assessing and Improving Patient Understanding of Publicly Reported Healthcare-Associated Infection-Related Hospital Quality Measures‬",
        "‪Tailoring First-Year Seminars for Computing Majors‬",
        "‪GuideME: Slice‐guided Semiautomatic Multivariate Exploration of Volumes‬",
        "‪Authoring narrative visualizations with ellipsis‬"
    ]
}