{
    "scholar_id": "AsHKhcsAAAAJ",
    "name": "‪Seung-Jun Kim‬ - ‪Google Scholar‬",
    "description": [
        "In this work, a robust subspace clustering algorithm is developed to exploit the inherent union-of-subspaces structure in the data for reconstructing missing measurements and detecting anomalies. Our focus is on processing an incessant stream of large-scale data such as synchronized phasor measurements in the power grid, which is challenging due to computational complexity, memory requirement, and missing and corrupt observations. In order to mitigate these issues, a low-rank representation (LRR) model-based subspace clustering problem is formulated that can handle missing measurements and sparse outliers in the data. Then, an efficient online algorithm is derived based on stochastic approximation. The convergence property of the algorithm is established. Strategies to maintain a representative yet compact dictionary for capturing the subspace structure are also proposed. The developed method is …",
        "Compressed sensing (CS) techniques have been successfully applied to multi-input multi-output (MIMO) radars to drastically reduce the sampling rates required for acquiring data. In this work, a CS MIMO radar is derived by employing a matrix recovery algorithm exploiting the low-rank structure of the data matrix based on linearly compressed measurements. Compared to a MIMO radar based on low-rank matrix completion, the proposed approach is seen to provide superior data reconstruction and target estimation performance at lower sampling rates.",
        "An unsupervised learning-based blind RF scene analysis method is proposed. The method can analyze a complex radio scene containing a mixture of different transmission types and estimate the constituent signals with associated channel vectors from multi-antenna measurements. A deep neural network is trained to learn the unique time-frequency patterns of various signal types. The channels, noise powers, and encodings input to the neural network are estimated in a maximum likelihood framework via an expectation-maximization algorithm. Numerical tests using scenes constructed from real RF measurements verify the effectiveness of the proposed method.",
        "Radio maps characterize quantities of interest in radio communication environments, such as the received signal strength and channel attenuation, at every point of a geographical region. Radio map estimation (RME) typically entails interpolative inference based on spatially distributed measurements. In this tutorial article, after presenting some representative applications of radio maps, the most prominent RME methods are discussed. Starting from simple regression, the exposition gradually delves into more sophisticated algorithms, eventually touching upon state-of-the-art techniques. To gain insight into this versatile toolkit, illustrative toy examples will also be presented.",
        "Objective  Automated registration algorithms for a pair of 2D X-ray mammographic images taken from two standard imaging angles, namely, the craniocaudal (CC) and the mediolateral oblique (MLO) views, are developed.  Methods  A fully convolutional neural network, a type of convolutional neural network (CNN), is employed to generate a pixel-level deformation field, which provides a mapping between masses in the two views. Novel distance-based regularization is employed, which contributes significantly to the performance.  Results  The developed techniques are tested using real 2D mammographic images, slices from real 3D mammographic images, and synthetic mammographic images. Architectural variations of the neural network are investigated and the performance is characterized from various aspects including image resolution, breast density, lesion size, lesion subtlety, and lesion Breast Imaging …",
        "Lifelong learning capitalizes on the shared skill structure present in a stream of tasks that arrive over time to improve upon the performance of single-task learners. In contemporary lifelong learning applications, it is often the case that there are multiple sensing modalities or views associated with each task. A crucial aspect in lifelong multitask multiview learning is to capture not only the shared structure among the tasks but also across views effectively. In this work, a nonparametric kernel-based learning framework is adopted to model even nonlinear shared structures in the tasks and views in a flexible and robust way. An efficient lifelong learning formulation is derived by judicious approximation of the per-task learning objectives, based on which the shared skill libraries can be updated online in function space. Numerical tests verify the efficacy of the proposed approach.",
        "RF signal recognition is an important element toward RF situational awareness and dynamic spectrum management. In this work, machine learning-based signal recognition algorithms are proposed. Our key contribution is to engineer feature learning such that the classifiers can perform robustly even when a mixture of heterogeneous signal classes is observed, although the training is still done using non-mixture single-label samples. To achieve this, discriminative dictionary learning algorithms are developed with various feature-shaping constraints. The signal detection can then be done in a way reminiscent of the multi-user detection in wireless communication, employing linear equalizers. The algorithms are tested using real wideband RF measurement data. It is verified that the proposed algorithms can robustly classify the component signals even when their powers are widely different and their number is not …",
        "Given the prevalence of independent component analysis (ICA) for signal processing, many methods for improving the convergence properties of ICA have been introduced. The most utilized methods operate by iterative rotations over pre-whitened data, whereby limiting the space of estimated demixing matrices to those that are orthogonal. However, a proof of the identifiability conditions for orthogonal ICA methods has not yet been presented in the literature. In this paper, we derive the identifiability conditions, starting from the orthogonal ICA maximum likelihood cost function. We then review efficient optimization approaches for orthogonal ICA defined on the Lie group of orthogonal matrices. Afterwards, we derive a new efficient algorithm for orthogonal ICA, by defining a mapping onto a space of constrained matrices which we define as hyper skew-symmetric. Finally, we experimentally demonstrate the …",
        "Policy gradient methods have been widely used in reinforcement learning (RL), especially thanks to their facility to handle continuous state spaces, strong convergence guarantees, and low-complexity updates. Training of the methods for individual tasks, however, can still be taxing in terms of the learning speed and the sample trajectory collection. Lifelong learning aims to exploit the intrinsic structure shared among a suite of RL tasks, akin to multitask learning, but in an efficient online fashion. In this work, we propose a lifelong RL algorithm based on the kernel method to leverage nonlinear features of the data based on a popular union-of-subspace model. Experimental results on a set of simple related tasks verify the advantage of the proposed strategy, compared to the single-task and the parametric counterparts.",
        "In order to estimate the channel gain (CG) between the locations of an arbitrary transceiver pair across a geographic area of interest, CG maps can be constructed from spatially distributed sensor measurements. Most approaches to build such spectrum maps are location-based, meaning that the input variable to the estimating function is a pair of spatial locations. The performance of such maps depends critically on the ability of the sensors to determine their positions, which may be drastically impaired if the positioning pilot signals are affected by multipath channels. An alternative location-free approach was recently proposed for spectrum power maps, where the input variable to the maps consists of features extracted from the positioning signals, instead of location estimates. The location-based and the location-free approaches have complementary merits. In this work, apart from adapting the location-free features …",
        "In this paper, a novel dictionary learning (DL) method is proposed to estimate sparse neural activations from multi-subject fMRI data sets. By exploiting the label information such as the patient and the normal healthy groups, the activation maps that are commonly shared across the groups as well as those that can explain the group differences are both captured. The proposed method was tested using real fMRI data sets consisting of schizophrenic subjects and healthy controls. The DL approach not only reproduced most of the maps obtained from the conventional independent component analysis (ICA), but also identified more maps that are significantly group-different, including a number of novel ones that were not revealed by ICA. The stability analysis of the DL method and the correlation analysis with separate neuropsychological test scores further strengthen the validity of our analysis.",
        "Demand response (DR) aims at improving the reliability and efficiency of the power grids by shaping the power demand over time. Given that building energy consumption constitutes a significant portion of the overall grid load, building energy management is a critical component for the DR portfolio. In this study, DR control policies for lighting and air-conditioner systems for the individual spaces in buildings are proposed. The policies are designed to achieve the energy reduction amount specified in the DR request while minimizing the user discomfort. A significant challenge is to cope with the uncertainty of various environmental factors such as the solar illuminance and ambient temperature, as well as the psycho-economic factors such as the energy usage preferences of the occupants. We employ a data-driven machine learning approach to tackle this challenge. Our novel idea is to take advantage of the …",
        "We investigate methodologies for the automated registration of pairs of 2-D X-ray mammographic images, taken from the two standard mammographic angles. We present two exploratory techniques, based on Convolutional Neural Networks, to examine their potential for co-registration of findings on the two standard mammographic views. To test algorithm performance, our analysis uses a synthetic, surrogate data set for performing controlled experiments, as well as real 2-D X-ray mammogram imagery. The preliminary results are promising, and provide insights into how the proposed techniques may support multi-view X-ray mammography image registration currently and as technology evolves in the future.",
        "Multitask learning leverages shared structure across multiple tasks to obtain classifiers with generalization capability surpassing that of independent single task learning. Lifelong learning further tackles the challenge of performing multitask learning in an online fashion for a continual stream of tasks. In this work, kernel-based lifelong learning algorithm is proposed to capture significant nonlinear structure in the data. It is postulated that the classifiers accommodate a union-of-subspace model in the feature space. A shared library of atoms are then learned based on online kernel dictionary learning in a reproducing kernel Hilbert space. To alleviate the inherent complexity of nonparametric learning which grows with the data set size, an approximate classifiers are also obtained, which are representable using a parsimonious pool of selected examples. Preliminary tests verify the efficacy of the proposed methods.",
        "Preventing voltage collapse is critical for reliable operation of power systems. A challenging problem is that the voltage stability margin, i.e., the distance from a given power profile to the voltage stability boundary, is very computationally intensive to obtain. A novel machine learning based approach for real-time inference of voltage stability margin is developed, only needing a very small number of offline-computed voltage stability margin data. An accurate margin predictor is trained by first training a binary stability classifier and then transferring this pre-trained model to fine-tune on the small data set of margins. Numerical simulations demonstrate that the proposed method significantly outperforms Jacobian-based voltage stability margin estimation with even faster real-time computation.",
        "In heterogeneous ultra-dense networks with millimeter wave macro cells and small cells, base stations (BSs) and mobile user equipments (UEs) perform beamforming operations to establish highly directional links. In spite of the spatial diversity achieved through directional links, as a number of BSs are densely deployed, inter-cell interference caused by concurrent directional transmissions of adjacent BSs becomes severe, resulting in downlink performance degradation in the network. However, it is very difficult to manage inter-cell interference because of the nature of the time-varying wireless fading environment, the dynamic changes in beam propagation directivity, and unpredictable UEs' locations. In this paper, we propose an online learning-based transmission coordination algorithm based on the framework of multi-armed bandits to learn the unknown characteristics of inter-BS interference and exploit learned …",
        "Data-driven analysis for functional magnetic resonance imaging (fMRI) data has played an important role for uncovering salient brain functional networks that are shared across multiple subjects. On the other hand, recent fMRI studies indicate that there is significant and consistent heterogeneity present across different subject groups and individuals. While independent component analysis (ICA) has been a major tool to perform data-driven analysis of fMRI data, dictionary learning (DL) approaches are increasingly receiving attention due to their modeling capability and flexibility. In this work, a supervised DL framework is employed to capitalize on the available class labels and capture not only the commonly shared components across the population, but also the unique components that contribute to discrimination. A systematic comparison with conventional ICA is performed based on real fMRI data consisting of …",
        "Pattern classification algorithms based on sparse dictionary learning are derived. After training a discriminative dictionary and a linear classifier using the samples of the individual classes, the aim is to apply the dictionary and classifier for recognizing the component signals in a mixture of different class signals. A key issue is to prevent the “leakage” of strong signal components to weaker components in the classifier. We tackled this issue by encouraging orthogonality among the discriminants during the training, applying the algorithms to RF signal recognition verified the efficacy of the approach.",
        "Preventing voltage collapse is critical for the reliable operation of the power grid. In this paper, the voltage stability margin, which is defined as the distance from a given power profile to the boundary of the stability region, is efficiently estimated using a data-driven machine learning approach. The key idea is to train a neural network classifier to learn the boundary of the potentially nonconvex stability region, and exploit the resulting score metric as the regressor for stability margin prediction. No particular loading direction is assumed, but rather the minimum distance to the boundary along all possible directions is captured. The training samples are generated from both continuation and semidefinite relaxation power flow methods. The performance and computational advantage of the proposed approach are verified by numerical experiments.",
        "Multi-subject fMRI data analysis methods based on sparse dictionary learning are proposed. In addition to identifying the component spatial maps by exploiting the sparsity of the maps, clusters of the subjects are learned by postulating that the fMRI volumes admit a subspace clustering structure. Furthermore, in order to tune the associated hyper-parameters systematically, a cross-validation strategy is developed based on entry-wise sampling of the fMRI dataset. Efficient algorithms for solving the proposed constrained dictionary learning formulations are developed. Numerical tests performed on synthetic fMRI data show promising results and provides insights into the proposed technique."
    ],
    "title": [
        "‪Online Robust Subspace Clustering With Application to Power Grid Monitoring‬",
        "‪Performance of Compressed Sensing MIMO Radar Based on Low-Rank Matrix Recovery‬",
        "‪Unsupervised radio scene analysis using neural expectation maximization‬",
        "‪Radio map estimation: A data-driven approach to spectrum cartography‬",
        "‪Automated registration for dual-view x-ray mammography using convolutional neural networks‬",
        "‪Kernel-based lifelong multitask multiview learning‬",
        "‪Robust RF mixture signal recognition using discriminative dictionary learning‬",
        "‪ICA with orthogonality constraint: identifiability and a new efficient algorithm‬",
        "‪Kernel-Based Lifelong Policy Gradient Reinforcement Learning‬",
        "‪Channel gain cartography via mixture of experts‬",
        "‪Dictionary learning-based fMRI data analysis for capturing common and individual neural activation maps‬",
        "‪Building energy management for demand response using kernel lifelong learning‬",
        "‪Towards CNN-based registration of craniocaudal and mediolateral oblique 2-D X-ray mammographic images‬",
        "‪Kernel-based efficient lifelong learning algorithm‬",
        "‪Learning to infer voltage stability margin using transfer learning‬",
        "‪Online learning-based downlink transmission coordination in ultra-dense millimeter wave heterogeneous networks‬",
        "‪Capturing common and individual components in fMRI data by discriminative dictionary learning‬",
        "‪Discriminative dictionary learning for mixture component detection with application to RF signal recognition‬",
        "‪Predicting voltage stability margin via learning stability region boundary‬",
        "‪Joint fMRI analysis and subject clustering using sparse dictionary learning‬"
    ]
}