{
    "scholar_id": "Bm9G4SIAAAAJ",
    "name": "‪Anthony Johnson‬ - ‪Google Scholar‬",
    "description": [
        "ObjectiveStorytelling engages audiences, passes down traditions and history, educates, and helps people understand and interpret their environment. Many of those who work in agriculture have been part of the storytelling tradition since childhood. Research has demonstrated the emotional impact of personal stories and how prevention information is conveyed effectively “farmer to farmer” through this method of communication.MethodsSince 2016, the Telling the Story Project has provided a space for those directly or indirectly involved in an agricultural incident to share their story and unique perspectives on how similar incidents can be avoided.ResultsThis collaborative project, developed between the National Institute for Occupational Safety and Health (NIOSH) Agriculture Safety Centers, has resulted in 11 stories on a dedicated website, safety and health resources, and educational guides. The stories and …",
        "Obejctive: Congenital Diaphragmatic Hernia (CDH) associated with hydrops is rare. The aim of this study was to describe the incidence of this combination of anomalies and the postnatal outcomes from a large database for CDH.Study design: Data from the multicenter, multinational database on infants with prenatally diagnosed CDH (CDHSG Registry) born from 2015 to 2021 were analyzed.Results: A total of 3985 patients were entered in the registry during the study period, 3156 were prenatally diagnosed and 88 were reported to have associated fluid in at least 1 compartment, representing 2.8% of all prenatally diagnosed CDH cases in the registry. The overall survival to discharge for CDH patients with hydrops was 43%.",
        "Introduction The optimal approach and therapy method for the acardiac twin with a reverse arterial perfusion sequence has not yet been established. The aim of this study was to determine the clinical practice patterns among international fetal therapy units in their management of these cases. Methods A survey was sent to fetal centers across the world via email between December 2020 and December 2021. Results Responses were obtained from 77% contacted centers. The most frequent ultrasound variables used in the evaluation of twin reverse arterial perfusion sequence include echocardiographic assessment of the pump twin and umbilical artery Doppler waveforms in the acardiac and pump twins, in 90% and 80% of the centers, respectively. Most centers in Europe and Latin America propose an in utero intervention in all cases. Most centers in Europe and Latin America prefer interstitial laser ablation …",
        "Up to 80% of patients experience postsurgical pain, and they are more likely to develop persistent pain. The identified risk factors for development of postsurgical pain do not fully predict the interpatient variability and offer limited insight into its pathophysiology. This systematic review summarizes the literature regarding genetic variation that has been associated with or implicated in the variable development of postsurgical pain. Meta-analyses were conducted for individual alleles for which there were sufficient data to compile data from several studies into an estimate of effect. The primary outcome was acute or chronic postsurgical pain, determined by total analgesic use or patient-reported pain scores. The review included 163 studies conducted between 2003 and 2022, 6 of which were genome-wide association studies and the others were candidate-gene association studies. Despite 129 reported genes and 594 …",
        "BackgroundThe MD Anderson Precision Oncology Decision Support (PODS) group provides genomic support to clinicians to guide enrollment onto genotype-matched trials through gene annotation and reporting on therapeutic actionability of genomic alterations based on NGS reports. PODS was evaluated in a pilot study (Glo-PODS) at a CUHK-affiliated hospital in Hong Kong.MethodsPatients with predominantly GI solid tumors who participated in two prospective precision oncology studies (PROCURE, STARTRK) at the CUHK were enrolled. Eligible patients had commercially available NGS panel analysis of their respective tumors. Genomic alterations of their NGS reports were annotated by the PODS to determine therapeutic actionability based on the variant’s known or potential functional and/or therapeutic significance. Data collected: demographics, treatment outcomes and impact on clinical decision and …",
        "ObjectivesThis study aimed to evaluate the splatter contamination generated by rotary instrumentation and irrigation during simulations of surgical extractions. Specifically, comparisons of the splatters generated were made between traditional assistant-based irrigation and self-irrigating drills and between saline and hydrogen peroxide irrigant.Materials and methodsA fluorescein solution was infiltrated into the irrigation system of high-speed drills, and the surgical extraction procedures were performed on manikins with the typodont teeth. Filter papers were placed at the predetermined locations around the operatory to absorb the fluorescein splatters; these samples underwent photographic image analysis.ResultsThe patient chest showed the largest area of splatters, followed by the assistant’s face shield. Procedures using the hydrogen peroxide irrigant generated a larger area of splatter than those using the saline …",
        "Magnetizing a cryogenic deuterium–tritium (DT)-layered inertial confinement fusion (ICF) implosion can improve performance by reducing thermal conduction and improving DT-alpha confinement in the hot spot. A room-temperature, magnetized indirect-drive ICF platform at the National Ignition Facility has been developed, using a high-Z, high-resistivity AuTa 4 alloy as the hohlraum wall material. Experiments show a 2.5× increase in deuterium–deuterium (DD) neutron yield and a 0.8-keV increase in hot-spot temperature with the application of a 12-T B-field. For an initial 26-T B-field, we observed a 2.9× yield increase and a 1.1-keV temperature increase, with the inferred burn-averaged B-field in the compressed hot spot estimated to be 7.1±1.8 kT using measured primary DD-n and secondary DT-n neutron yields.",
        "This presentation constitutes a post-shot report for the MK-X performance on Shot 3 (13 July 2022). It focuses primarily on the analysis of electrical faults which have been a persistent issue in MK-X performance and were a significant focus of the test. The MK-X is a helical flux compression generator (HFCG) that has been manufactured in a novel and very cost-effective way. Shot 3 was the fourth test in a series which began with a low initial-current-level HFCG test coupled to a dummy load (Shot 0) and then a high stress test (Shot 1) coupled to a primitive pulse forming network (PFN). Shot 0 performed close to expectation but Shot 1 had early time losses that could not be explained. As a result, Shots 2 and 3 had dual goals. Each shot looked at MK-X performance relative to the early time losses, and since the amount of current generated on the first two tests was a useful amount, we coupled to a fast R43S Ranchero flux compression generator for Shot 2 to ascertain Ranchero’s performance with higher-than-ever initial current and another PFN load. Then Shot 3 implemented a specific change to the MK-X and coupled to only a low inductance PFN load. The report shows that Shots 1-3 all have qualitatively similar losses and the change made for Shot 3 to explore losses led to even further losses. However, the PFN on shot 3 was low inductance and in spite of the losses, 32 MA was generated. This report discusses the losses seen specifically on Shot 3 and compares the electrical and camera data along with a careful comparison to 3 D MHD modeling.",
        "Formula SAE is a multifaceted competition that involves student teams designing and competing with an open-wheel style race car. There are 5 different dynamic events included in the competition. Each event requires a unique aerodynamic setup to have the best performance possible. This design project focuses on a drag reduction system (DRS) that will improve aerodynamic performance, resulting in faster lap times and increased competitiveness. Key features include a direct electronic actuation mechanism that will allow the rear wing to be adjusted during a race. The benefits of the DRS system, include increased speed, improved handling, and greater fuel efficiency during competition. From our initial simulations, this system would result in a 5.5% increase in acceleration points and a 1.6% reduction in lap times. This would allow us to be a podium team (top three) at our next competition.",
        "The application of an external 26 Tesla axial magnetic field to a  gas-filled capsule indirectly driven on the National Ignition Facility is observed to increase the ion temperature by 40% and the neutron yield by a factor of 3.2 in a hot spot with areal density and temperature approaching what is required for fusion ignition . The improvements are determined from energy spectral measurements of the 2.45 MeV neutrons from the  reaction, and the compressed central core  field is estimated to be  using the 14.1 MeV secondary neutrons from the  reactions. The experiments use a 30 kV pulsed-power system to deliver a  current pulse to a solenoidal coil wrapped around a novel high-electrical-resistivity  hohlraum. Radiation magnetohydrodynamic simulations are consistent with the experiment.",
        "This study was conducted to evaluate the prevalence and risk factors for work-related respiratory conditions (asthma, farmer’s lung, sinusitis, rhinitis, and environmental allergies, diagnosed by a physician) among farm and ranch operators in the central US. A survey was conducted by the Central States Center for Agricultural Safety and Health (CS-CASH) in 2018, focusing on work-related injuries, illnesses, exposures, and preventive measures in a seven-state region (Iowa, Kansas, Minnesota, Missouri, Nebraska, North Dakota, and South Dakota). Farms and ranches (n = 16,818) with an email address and annual sales exceeding $5,000 were randomly selected for the survey. Agricultural production and weather data were merged with survey responses. The relationship between exposures and respiratory conditions was analyzed using generalized estimating equations. We received responses from 3,268 …",
        "Magnetizing the fuel in ICF implosions offers a potentially transformational way to boost the performance of many different target designs. The magnetized indirect drive implosion project on NIF involves developing a new hohlraum material, a pulser to apply the B-field, NIF experiments and DT ice layering studies. This talk will describe the science and technology challenges that are involved in this project. In addition, we will discuss some of the experiments we are currently doing on the Omega laser to explore the physics of magnetized HED which is relevant to magnetized implosions. This work was performed under the auspices of the US Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344 and by the LLNL-LDRD program under Project Number 20-SI-002.",
        "A new project is underway at the National Ignition Facility with the goal of applying a seed magnetic field to the fusion fuel in an indirect drive hohlraum implosion and quantifying the effect on the hot-spot temperature, shape and neutron yield. Magnetizing fusion fuel is calculated to reduce heat loss from the implosion core by constraining the motion of electrons and fusion-generated alpha particles; this can improve the chances of achieving high-gain fusion in a laboratory plasma. We describe the goals of this project and the significant scientific and technological challenges which must be overcome for this project to succeed.",
        "The MagNIF team at LLNL is developing a pulsed power platform to enable magnetized inertial confinement fusion and high energy density experiments at the National Ignition Facility. A pulsed solenoidal driver capable of premagnetizing fusion fuel to ~40T is predicted to increase performance of indirect drive implosions. We have written a specialized Python code suite to support the delivery of a practical design optimized for target magnetization and risk mitigation. The code simulates pulsed power in parameterized system designs and converges to high-performance candidates compliant with evolving engineering constraints, such as scale, mass, diagnostic access, mechanical displacement, thermal energy deposition, facility standards, and component-specific failure modes. The physics resolution and associated computational costs of our code are intermediate between those of 0D circuit codes and 3D …",
        "Agricultural work involves ergonomic and psychosocial strain, which contribute to musculoskeletal conditions. The aim of this study was to assess if specific ergonomic, psychosocial, and preventive factors are linked to musculoskeletal pain or discomfort symptoms (MSS) in farmers and ranchers. We analyzed data from the Central States Center for Agricultural Safety and Health survey that was conducted in 2018 in a seven-state region of the central United States. MSS were assessed with questions from the Standardized Nordic Questionnaire. The survey included questions on demographic, ergonomic, psychosocial and preventive factors. Farm production variables were added from the Farm Market iD database. We analyzed the data using Generalized Estimating Equations. The overall prevalence of MSS for all body sites combined was 59% among 4,354 farmers and ranchers who responded (19% response …",
        " Objective To evaluate inter‐rater agreement for sonographic classification of stomach position (as a surrogate for liver herniation) in fetal left congenital diaphragmatic hernia (LCDH) among: (i) fetal medicine specialists from the North American Fetal Therapy Network (NAFTNet) centers within and without the fetal endoscopic tracheal occlusion (FETO) consortium and in comparison to an expert external reviewer (ER1); and (iii) among two expert ERs (ER1 and ER2). Methods Forty‐eight physicians from 26 NAFTNet centers and 2 ERs were asked to assess 13 sonographic clips of isolated LCDH and classify stomach position as “intra‐abdominal,” “anterior left chest,” “mid to posterior left chest,” or “retro‐cardiac\" based on the classification published by Basta et al.8 Interrater agreement was assessed by determining proportion of stomach position ratings concordant amongst NAFTNet participants and ER1 …",
        "Problems in predicting and controlling colour have become increasingly prevalent in recent years across a variety of industries. In the past, many of these industries have relied on empirical techniques utilising the skills of highly trained staff. However, this is not an efficient or predictable procedure and the development of tools such as colorant formulation systems in the decorating industries, or standardisation in the reproduction industries, have been directed at improving the efficiency and predictability of the products. These techniques rely heavily on colorimetry and have proved very successful in achieving their objectives. Unfortunately, they are only fully effective in somewhat limited circumstances.Where absolute matching and control of colour is required these techniques prove very efficacious. This has been the primary area of application for them in most of the colorant industries in the past. However, where matching across quite different media is required, in which the colour gamuts of the media may be quite different, the selection or interpretation of colour has still required the skills referred to above and for critical colour matching has relied on these staff physically producing the colours in such a way that the results closely simulate those which will finally be rendered so that a proper subjective assessment may be made. In the relatively rare situations where such a simulation (or proof) was not possible the user had to mentally interpret the result and this could again lead to somewhat unpredictable results depending on the skills and experience of the user.",
        "CONCLUSION: CDA in fetuses with isolated CDH and reduced O/E LHR can identify those at a higher risk of neonatal mortality.",
        "Purpose: Transcorneal freezing is a common technique used in rabbits to induce damage to the corneal endothelium. Previous studies have been performed with a range of freezing temperatures, times, and rabbit ages. Here, we aimed to characterize the aged rabbit endothelium after transcorneal freezing to establish an innate corneal endothelial cell regrowth rate and propose it as a mechanism for evaluation of therapeutic efficacy in rabbit models. Methods: Central corneas of anesthetized New Zealand White rabbits (n= 3) aged 18-24 months were exposed to nitrous oxide cooled probes for 30 seconds. Animals were assessed by in vivo confocal microscopy, applanation tonometry, specular microscopy, optical coherence tomography, and histology. The contralateral eye acted as a control. Images were taken immediately before and after injury and on days 2, 4, 7, 11, and 14. Results: Following transcorneal …",
        " Complex facial lacerations are frequently encountered in the combat environment. Trauma with soft-tissue loss of the periorbital region offers particular challenges in terms of operative reconstruction. Cicatricial changes in the sub-acute phase can lead to eyelid malposition and lagophthalmos. The authors present a novel technique for acute reconstruction of periorbital trauma with eyelid soft-tissue loss with simultaneous full-thickness skin grafting and amniotic membrane grafting. The technique involves standard preparation of the surgical area of injury and infiltration with local anesthetic. Initially, the area of injury is copiously irrigated, and debridement of any necrotic tissue is accomplished. Amniotic membrane grafting is then performed over the defect. Approximately 2 mm × 2 mm full-thickness skin grafts are procured and distributed over the initial amniotic membrane graft. A second amniotic membrane …"
    ],
    "title": [
        "‪The Use of Injury and Fatality Narratives to Convey Agricultural Safety and Health Messages and to Develop Effective Resources Through Collaborative, Multi-Disciplinary Approaches (Tell a Story, Save a Life)‬",
        "‪Hydrops and Congenital Diaphragmatic Hernia: Reported incidence and postnatal outcomes. Analysis of the CDHSG Registry‬",
        "‪The Management of Acardiac Twinning: Twin Reverse Arterial Perfusion Sequence–An International Survey‬",
        "‪THIS MONTH IN‬",
        "‪424P MD Anderson Cancer Center global precision oncology decision support (Glo-PODS) clinical trial genomic support: Pilot program at the Prince of Wales Hospital (Chinese University of Hong Kong-CUHK)‬",
        "‪Splatter generated by oral surgery irrigation and its implication for infection control‬",
        "‪Performance scaling with an applied magnetic field in indirect-drive inertial confinement fusion implosions‬",
        "‪Shot 3 Post-Shot Report: Fault Analysis of MK-X Data [Slides]‬",
        "‪Husker Motorsports Active Drag Reduction System‬",
        "‪Increased ion temperature and neutron yield observed in magnetized indirectly driven d 2-filled capsule implosions on the national ignition facility‬",
        "‪Prevalence and risk factors for pulmonary conditions among farmers and ranchers in the central United States‬",
        "‪The magnetized indirect drive implosion project on NIF‬",
        "‪The magnetized indirect drive project on the National Ignition Facility‬",
        "‪A Pulsed Power Design Optimization Code for Magnetized Inertial Confinement Fusion Experiments at the National Ignition Facility‬",
        "‪Factors associated with musculoskeletal discomfort in farmers and ranchers in the US central states‬",
        "‪Interrater agreement for sonographic stomach position classification in fetal diaphragmatic hernia across the North American fetal therapy network‬",
        "‪Aspects of colour management: characterization of three and four-colour imaging devices‬",
        "‪Right ventricular analysis of fetuses with congenital diaphragmatic hernia shows increased risk of neonatal death‬",
        "‪Transcorneal Freezing in Aged Rabbits as a Platform for Evaluating Corneal Endothelial Cell Therapeutics.‬",
        "‪Acute reconstruction of periorbital trauma resulting in eyelid anterior lamella loss with simultaneous full-thickness skin grafting and amniotic membrane grafting: a case report‬"
    ]
}