{
    "scholar_id": "fArWdfAAAAAJ",
    "name": "‪Adam Bargteil‬ - ‪Google Scholar‬",
    "description": [
        "Like a semester long graduate seminar on Optimization in Computer Graphics and Interactive Techniques, this course looks at Optimization through the lens of 13 technical papers selected by the lecturers. The lecturers will highlight trends, similarities, differences, and historical threads through the papers. The papers will cover a range of topics including numerical solutions, objective functions, discrete and continuous optimization, dimensionality reduction, and frictional contact. Applications will range from image segmentation to truss structures to real-time rendering. The course will also serve as a retrospective on the selected papers, placing them in historical perspective and highlighting significant contributions as well as forgotten gems. The lecturers have broad expertise across computer graphics and interactive techniques and have co-led the VANGOGH lab meeting at UMBC since 2015.",
        "The coupled atmosphere-surface fire spread model WRF-SFIRE generates hourly spread of burnt area contours at 30m resolution. Kochanski et. al., at SJSU initially provided the Wildfire team at UMBC with WRF-SFIRE simulations of the August Complex wildfires in Northern California for the period August 15, 2020-August 31, 2020. Since Landsat scenes are also available at a scale of 30m resolution and contain Burnt Area Probability products, we present here the validation results of the burnt areas of WRF-SFire model spread output contours obtained from overlays Landsat 7 and Landsat 8 scenes that were obtained at coincident times from overlays This approach meets the CEOS validation recommendation of assessing the quality of the model data products by independent means. Landsat data was acquired from the USGS Earth Explorer with their defined Burned Probability areas. The acquired\" Burn …",
        "No description available",
        "Climate change is creating highly favorable regional environments globally, that are inducing wildland fires at explosive spread with historically greater scale and intensity. These wildfires are destroying wide swaths of homes and related resources, transporting toxic smoke damaging to human health and turning regional forests into Savannahs. Recent studies have indicated we are at a tipping point where the feedback effects of deforestation will accelerate global warming beyond current efforts to curb anthropomorphic CO2. As part of a new NASA formed Fire-Tech program for the development of real time fire observing instruments and wildfire models, we have been awarded the opportunity to develop a NASA Wildfire Digital Twin. Digital twins simulate complex processes that occur on multiple scales with interacting physical systems driven by real time observations. Wildfires are examples of such physical …",
        "SIGGRAPH Asia 2022 Conference Papers | ACM Conferences skip to main content ACM \nDigital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign \nin Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences \nPeople More Search ACM Digital Library SearchSearch Advanced Search siggraph-asia \nConference Proceedings Upcoming Events Authors Affiliations Award Winners More Home \nConferences SIGGRAPH-ASIA Proceedings SA '22 SIGGRAPH Asia 2022 Conference \nPapers PreviousNext ACM Digital Library ABSTRACT No abstract available. Index Terms 1.SIGGRAPH \nAsia 2022 Conference Papers 1.Social and professional topics 2.Software and its engineering \n1.Software organization and properties 1.Contextual software domains Index terms have been \nassigned to the content through auto-classification. Recommendations SIGGRAPH Asia '08…",
        "Recent persistent droughts and extreme heatwave events over the Western states of the US and Canada are creating highly favorable conditions for mega wildfires. The International Program of Climate Change AR6 report suggests that such extreme events will continue occurring with increasing frequency and intensity over forested regions, globally. While humangenerated fires for farming in the Amazon are at a potential tipping point, wildfires in the Northern Hemisphere are comparably generating broad regions of deforestation. The smoke from recent mega wildfires in California, driven by atmospheric and fuel conditions controlling their intensity, has been observed to penetrate the planetary boundary layer, stay in the atmosphere for a long time, and travel long distances. The wildfire smoke from such events has the potential to reach distant cities and towns over the Eastern US, significantly reducing the air …",
        "Recent persistent droughts and extreme heatwave events over the Western states of the US are creating highly favorable conditions for mega wildland fires. The IPCC AR6 report suggests that such extreme events will continue occurring with increasing frequency and intensity over forested regions, globally. We have shown that smoke produced from such wildland fires, which contain the burnt biomass carbon-based particulate matter at 2.5 microns, can be dynamically transported 1000s of km to affect the composition of distant atmospheric planetary boundary layers. Under normal wildfire events, the smoke plume would essentially rise, and dissipate but mega wildfires can generate Pyro Cumulonimbus clouds that can extend up to 6 miles into the troposphere, even into the stratosphere, and persist for long time periods. As a result, atmospheric states can transport wildfire smoke from the Western US to cities over …",
        "No description available",
        "We explore computational approaches for visual guidance to aid in creating aesthetically pleasing art and graphic design. Our work complements and builds on previous work that developed models for how humans look at images. Our approach comprises three steps. First, we collected a dataset of art masterpieces and labeled the visual fixations with state-of-art vision models. Second, we clustered the visual guidance templates of the art masterpieces with unsupervised learning. Third, we developed a pipeline using generative adversarial networks to learn the principles of visual guidance and that can produce aesthetically pleasing layouts. We show that the aesthetic visual guidance principles can be learned and integrated into a high-dimensional model and can be queried by the features of graphic elements. We evaluate our approach by generating layouts on various drawings and graphic designs. Moreover, our model considers the color and structure of graphic elements when generating layouts. Consequently, we believe our tool, which generates multiple aesthetic layout options in seconds, can help artists create beautiful art and graphic designs.",
        "Physics-based animation has emerged as a core area of computer graphics finding widespread application in the film and video game industries as well as in areas such as virtual surgery, virtual reality, and training simulations. This course introduces students and practitioners to fundamental concepts in physics-based animation, placing an emphasis on breadth of coverage and providing a foundation for pursuing more advanced topics and current research in the area. The course focuses on imparting practical knowledge and intuitive understanding rather than providing detailed derivations of the underlying mathematics. The course is suitable for someone with no background in physics-based animation---the only prerequisites are basic calculus, linear algebra, and introductory physics. We begin with a simple, and complete, example of a mass-spring system, introducing the principles behind physics-based …",
        "Clustered shape matching is an approach for physics-based animation of deformable objects, which breaks an object into overlapping clusters of particles. At each timestep, it computes a best-fit rigid transformation between a cluster’s rest state and current particle configuration and Hookean springs are used to pull particles toward desired goal positions. In this paper, we present multi-resolution clustering as an extension to clustered shape matching. We iteratively construct fine-to-coarse sets of clusters and weights over the set of particles and compute dynamics in a single coarse-to-fine pass. We demonstrate that our approach enhances the possible elastic behavior available to artists and provides an intuitive parameterization to blend between stiffness and deformation richness, which are in contention in the traditional clustered shape matching approach that operates at a single spatial scale. We can specify a …",
        "We present a fully automatic method to generate detailed and accurate artistic shadows from pairs of line drawing sketches and lighting directions. We also contribute a new dataset of one thousand examples of pairs of line drawings and shadows that are tagged with lighting directions. Remarkably, the generated shadows quickly communicate the underlying 3D structure of the sketched scene. Consequently, the shadows generated by our approach can be used directly or as an excellent starting point for artists. We demonstrate that the deep learning network we propose takes a hand-drawn sketch, builds a 3D model in latent space, and renders the resulting shadows. The generated shadows respect the hand-drawn lines and underlying 3D space and contain sophisticated and accurate details, such as self-shadowing effects. Moreover, the generated shadows contain artistic effects, such as rim lighting or halos appearing from backlighting, that would be achievable with traditional 3D rendering methods.",
        "Position-based dynamics has emerged as an exceedingly popular approach for animating soft body dynamics. Unfortunately, the basic approach suffers from artificial loss of angular momentum. We propose a simple approach to preserve global linear and angular momenta of bodies by directly tracking these quantities and adjusting velocities to ensure they are preserved. This approach entails negligible computational cost, requires less than 25 lines of code, and exactly preserves global linear and angular momenta.",
        "Since the introduction of the conjugate gradient method to computer graphics, researchers have largely treated it as a black box. In particular, an arbitrary small value is chosen for the tolerance and the method is run to convergence. In the context of soft body animation, this approach results in significant wasted computation and has led researchers to consider alternative, more complex, and less versatile approaches. In this paper we argue that in the context of corotational finite elements, less than 10 iterations can give a good enough solution and substantial savings of computational cost. We examine the use of different preconditioners for conjugate gradient including the mass and Jacobi matrices, as well as the use of different initial guesses. We show that for our examples an initial guess of the previous velocity and the Jacobi preconditioner works best.",
        "In this paper, we present a method for fluid simulation on unstructured quadrilateral surface meshes. We solve the Navier-Stokes equations by performing the traditional steps of fluid simulation, semi-Lagrangian advection and pressure projection, directly on the surface. We include level-set based front-tracking for visualizing “liquids,” while we use densities to visualize “smoke.” We demonstrate our method on a variety of meshes and create an assortment of visual effects.",
        "Compelling animation of fracture is a vital challenge for computer graphics. Methods based on continuum mechanics are physically accurate, but computationally expensive since they require computing elastic deformation. In many applications, this elastic deformation is imperceptible, so simulation methods based on rigid body dynamic with breakable constraints are popular in practice. Simply deleting constraints when thresholds on force or displacement are reached ignores the elastic energy that is stored just before fracture, which is captured by continuum mechanics based methods. Our approach computes the energy stored in these constraints when they are broken, and reintroduces it to the system as kinetic energy. As a result, our method is able to animate energetic fracture scenarios with results comparable to continuum mechanics approaches, but with the computational efficiency of rigid body simulation.",
        "No description available",
        "We introduce a new collision proxy for example-based deformable bodies. Specifically, we approximate the deforming geometry as a union of spheres. During pre-computation we perform a sphere packing on the input, undeformed geometry. Then, for each example pose, we move and resize the spheres to approximate the example. During runtime we blend together these positions and radii, using the same skinning weights we use for the geometry. We demonstrate the method on a car crash example, where we achieve an overall speedup of 5--20 times, depending on the resolution of the collision proxy geometry.",
        "In this paper, we revisit the problem online reclustering in clustered shape matching simulations and propose an approach that employs two nonlinear optimizations to create new clusters. The first optimization finds the embedding of particles and clusters into three-dimensional space that minimizes elastic energy. The second finds the optimal location for the new cluster, working in this embedded space. The result is an approach that is more robust in the presence of elastic deformation. We also experimentally verify that our clustered shape matching approach converges as the number of clusters increases, suggesting that our reclustering approach does not change the underlying material properties. Further, we demonstrate that particle resampling is not strictly necessary in our framework allowing us to trivially conserve volume. Finally, we highlight an error in estimating rotations in the original shape-matching …",
        "No description available"
    ],
    "title": [
        "‪Optimization in Computer Graphics and Interactive Techniques‬",
        "‪Visual Evaluation of WRF-SFire Simulations using Landsat Burn Probability Maps.‬",
        "‪A Data Driven AI/Machine Learning Approach to Conduct OSSEs‬",
        "‪Towards a Dynamic Multiscale Wildfire Digital Twin‬",
        "‪SIGGRAPH Asia 2022 Conference Papers‬",
        "‪Towards a Dynamic Data Driven Wildfire Digital Twin (WDT): Impacts on Deforestation, Air Quality and Cardiopulmonary Disease‬",
        "‪A Machine Learning Plume-Resolving Model Implementation over North America for Mega-Wildland Fire Smoke Impacts on Distant Planetary Boundary Layers‬",
        "‪Leveraging Machine Learning to Improve the Effective Resolution of WRF Models of Mega-Fires‬",
        "‪Learning aesthetic layouts via visual guidance‬",
        "‪An introduction to physics-based animation‬",
        "‪Multi-resolution Clustering for Enhanced Elastic Behavior in Clustered Shape Matching‬",
        "‪Learning to shadow hand-drawn sketches‬",
        "‪Global momentum preservation for position-based dynamics‬",
        "‪Early Termination of Conjugate Gradients for Corotated Finite Elements‬",
        "‪Fluid Simulation on Unstructured Quadrilateral Surface Meshes‬",
        "‪Energized rigid body fracture‬",
        "‪‘Jurassic Park’made a dinosaur-sized leap forward in computer-generated animation on screen, 25 years ago‬",
        "‪Efficient collision detection for example-based deformable bodies‬",
        "‪Reclustering for large plasticity in clustered shape matching‬",
        "‪How ‘Bambi’paved the way for both ‘Fallout 4’and ‘Angry Birds’‬"
    ]
}