{
    "scholar_id": "iEGYZT4AAAAJ",
    "name": "‪Marc Olano‬ - ‪Google Scholar‬",
    "description": [
        "Like a semester long graduate seminar on Optimization in Computer Graphics and Interactive Techniques, this course looks at Optimization through the lens of 13 technical papers selected by the lecturers. The lecturers will highlight trends, similarities, differences, and historical threads through the papers. The papers will cover a range of topics including numerical solutions, objective functions, discrete and continuous optimization, dimensionality reduction, and frictional contact. Applications will range from image segmentation to truss structures to real-time rendering. The course will also serve as a retrospective on the selected papers, placing them in historical perspective and highlighting significant contributions as well as forgotten gems. The lecturers have broad expertise across computer graphics and interactive techniques and have co-led the VANGOGH lab meeting at UMBC since 2015.",
        "We report on our experiences fielding MeetingMayhem, an interactive game that we developed, which introduces students to fundamental concepts in network security, cybersecurity, and adversarial thinking. The game is intended for students who do not necessarily have any prior background in computer science. Assuming the role of agents, two players exchange messages over a network to try to agree on a meeting time and location, while an adversary interferes with their plan. Following the Dolev-Yao model, the adversary has full control of the network: they can see all messages and modify, block, or forward them. We designed the game as a web application, where groups of three students play the game, taking turns being the adversary. The adversary is a legitimate communicant on the network, and the agents do not know who is the other agent and who is the adversary. Through gameplay, we expect …",
        "We provide the detailed proof of our proposed exponential moving covariance matrix and how it is related to the largely adopted exponential moving weighted average (EMWA) covariance estimator. It serves as the basis for online control variates (CV) coefficient estimation for subsurface scattering with real-time adaptive sampling. A concrete example and the corresponding theory of why we select the CV coefficient and residual function is also provided.",
        "In real-time applications, it is difficult to simulate realistic subsurface scattering with differing degrees translucency. Burley's reflectance approximation by empirically fitting the diffusion profile as a whole makes it possible to achieve realistic looking subsurface scattering for different translucent materials in screen space. However, achieving a physically correct result requires real-time Monte Carlo sampling of the analytic importance function per pixel per frame, which seems prohibitive to achieve. In this paper, we propose an approximation of the importance function that can be evaluated in real-time. Since subsurface scattering is more pronounced in certain regions (e.g., with light gradient change), we propose an adaptive sampling method based on temporal variance to lower the required number of samples. We propose a one phase adaptive sampling pass that is unbiased, and able to adapt to scene changes …",
        "In many graphics applications, a deterministic random hash provides the best source of random numbers. We evaluate a range of existing hash functions for random number quality using the TestU01 test suite, and GPU execution speed through benchmarking. We analyze the hash functions on the Pareto frontier to make recommendations on which hash functions offer the best quality/speed trade-off for the range of needs, from high-performance/low-quality to high-quality/low-performance. We also present a new class of hash tuned for multidimensional input and output that performs well at the high-quality end of this spectrum. We provide a supplemental document with test results and code for all hashes.",
        "Strokes have a wide range of occurrence among people of all races and genders. The consequences of a stroke often include significant muscle weakness on one side of the body that must be physically exercised to attempt to restore its previous strength and mobility. In traditional mirror therapy, the partially disabled hand or leg is hidden by a mirror. The patient sees a reflection of the healthy side of their body where the disabled limb should be, in order to stimulate brain to operate the partially disabled hand/leg in the proper way. The patient will interact with mirror using unaffected hand and observe its reflection.",
        "We describe an approach to modeling dermoscopy, the imaging modality for the examination of skin lesions, using accurate subsurface scattering in human skin. We make use of an open-source, path-tracing program with advanced physics models as a rendering tool. Rendered scenes are based on biological details from human skin, such as layering, optical properties, and lesion variability, as well as on the properties of the image acquisition device. Preliminary results suggest that this can be an efficient and effective way to generate arbitrarily large datasets of fully featured images with known classification labels.",
        "Virtual Reality gives us the opportunity to view scientific data from a unique perspective. Combining 3D volumetric data along with traditional magnetic field lines in a virtual space can help us to better understand how Earth's magnetosphere is structured and how it behaves. Experiencing and interacting with Earth's magnetic field as a volume helps to bridge the gap from magnetic fields being a series of planes and lines to being understood as a volume that is depicted with those field lines. As this virtual reality experience improves over time we will be able to educate the masses about magentospheric data and give them an amazing tool towards fully understanding how the magnetosphere protects all life on Earth.",
        "Volume data is everywhere. At NASA, there is an overabundance of data collected from scans, imagery, simulations, and satellites, all ready to be utilized. Much of this data is 3D spatial representation information, also referred to as\" volume\" data. To be able to effectively analyze and dissect the vast amounts of volumetric information at hand, we would like a way to visualize it. This allows us to see structure, noise, variance, and anomalies. Optimally, this data would be visualized in real-time, allowing full manipulation and interaction, rather than a pre-rendered slice image, or video. To improve this approach even more, the display used can be changed from a standard screen to a Virtual Reality headset, allowing the viewer to physically interact. However, doing so is computationally difficult, and hardware restrictive. I will discuss the techniques used, benefits, and hindrances surrounding real-time volume …",
        "There is an ongoing debate about how virtual reality visualizations can assist with new scientific insight. We will demonstrate a prototype environment that not only allows you to ride alongside the orbit of Parker Solar Probe (PSP) and view the expected WISPR camera perspective in VR. In addition the environment can display, side by side, the individual WISPR images when they arrive. We will be demonstrating the visualizations using both the SWMF model performed at CCMC (for 1 to 20Rs) and the SUSANOO model from ISEE Nagoya University (20-200Rs). In both cases the data cube is presented with plasma density. Specifically for scientific studies we have also implemented the full Thomson scattering mechanism to operate in the real-time VR environment, so that the VR simulated views are as close as possible to the observations. Initial investigations suggests that the local density variations seen due to …",
        "(57) ABSTRACT A system, device, computer-readable instructions, and method are provided for mapping and filtering of visual objects to address bump mapping. For example, a system, device, computer-readable instructions, and method are pro vided as a unified shading model representing both bump orientation and bidirectional radiance distribution function",
        "Remote sensing of the structural and spectral traits of vegetation is being transformed by structure from motion (SFM) algorithms that combine overlapping images to produce three-dimensional (3D) red-green-blue (RGB) point clouds. However, much remains unknown about how these point clouds are used to observe vegetation, limiting the understanding of the results and future applications. Here, we examine the content and quality of SFM point cloud 3D-RGB fusion observations. An SFM algorithm using the Scale Invariant Feature Transform (SIFT) feature detector was applied to create the 3D-RGB point clouds of a single tree and forest patches. The fusion quality was evaluated using targets placed within the tree and was compared to fusion measurements from terrestrial LIDAR (TLS). K-means clustering and manual classification were used to evaluate the semantic content of SIFT features. When targets were fully visible in the images, SFM assigned color in the correct place with a high accuracy (93%). The accuracy was lower when targets were shadowed or obscured (29%). Clustering and classification revealed that the SIFT features highlighted areas that were brighter or darker than their surroundings, showing little correspondence with canopy objects like leaves or branches, though the features showed some relationship to landscape context (e.g., canopy, pavement). Therefore, the results suggest that feature detectors play a critical role in determining how vegetation is sampled by SFM. Future research should consider developing feature detectors that are optimized for vegetation mapping, including extracting elements like leaves …",
        "We have created a suite of automated tools to calibrate and configure a projection virtual reality system. Test subjects (rats) explore an interactive computer-graphics environment presented on a large curved screen using multiple projectors. The locations and characteristics of the projectors can vary and the shape of the screen may be complex. We place several cameras around the workspace for redundant coverage. We locate each projector's hotspot as seen by each camera, and produce a brightness profile which tells the projector how much to dim each pixel of its output to achieve uniform output. We reconstruct the 3D geometry of the screen and the location of each projector using shape-from-motion and structured-light multi-camera computer vision techniques. We determine which projected pixel corresponds to a given view direction for the rat. From these, we create a warping profile for each projector …",
        "Content creation for realtime interactive systems is a difficult problem. In game development, content creation pipelines are a major portion of the code base and content creation is a major portion of the budget. In research environments, the choice of rendering and simulation systems is frequently driven by the need for easy to use content authoring tools. In visualization, this problem is compounded by the widely varying types of data that users desire to visualize. We present a visualization application creation framework incorporated into our visualization system that enables measurement and quantitative analysis tasks in both desktop and immersive environments on diverse input data sets.",
        "Ecological remote sensing is being transformed by three-dimensional (3D), multispectral measurements of forest canopies by unmanned aerial vehicles (UAV) and computer vision structure from motion (SFM) algorithms. Yet applications of this technology have out-paced understanding of the relationship between collection method and data quality. Here, UAV-SFM remote sensing was used to produce 3D multispectral point clouds of Temperate Deciduous forests at different levels of UAV altitude, image overlap, weather, and image processing. Error in canopy height estimates was explained by the alignment of the canopy height model to the digital terrain model (R2 = 0.81) due to differences in lighting and image overlap. Accounting for this, no significant differences were observed in height error at different levels of lighting, altitude, and side overlap. Overall, accurate estimates of canopy height compared to field measurements (R2 = 0.86, RMSE = 3.6 m) and LIDAR (R2 = 0.99, RMSE = 3.0 m) were obtained under optimal conditions of clear lighting and high image overlap (>80%). Variation in point cloud quality appeared related to the behavior of SFM ‘image features’. Future research should consider the role of image features as the fundamental unit of SFM remote sensing, akin to the pixel of optical imaging and the laser pulse of LIDAR.",
        "We present a framework for modeling solid-fluid phase change. Our framework is physically-motivated, with geometric constraints applied to define rigid dynamics using shape matching. In each simulation step, particle positions are updated using an extended SPH solver where they are treated as fluid. Then a geometric constraint is computed based on current particle configuration, which consists of an optimal translation and an optimal rotation. Our approach differs from methods such as [Carlson et al. 2004] in that we solve rigid dynamics by using a stable geometric constraint [Müller et al. 2005] embedded in a fluid simulator.",
        "Texture compression is widely used in real-time rendering to reduce storage and bandwidth requirements. Recent research in compression algorithms has explored both reduced fixed bit rate and variable bit rate algorithms. The results are evaluated at the individual texture level using mean square error, peak signal-to-noise ratio, or visual image inspection. We argue this is the wrong evaluation approach. Compression artifacts in individual textures are likely visually masked in final rendered images and this masking is not accounted for when evaluating individual textures. This masking comes from both geometric mapping of textures onto models and the effects of combining different textures on the same model such as diffuse, gloss, and bump maps. We evaluate final rendered images using rigorous perceptual error metrics. Our method samples the space of viewpoints in a scene, renders the scene from each …",
        "The papers in this special section were presented at the ACM Symposium on Interactive 3D Graphics and Games (I3D) in 2014 that was held from March 14-16 in San Francisco, California. I3D focuses on real-time rendering, animation, and interaction techniques. Games are not the only application for these kinds of interactive methods, but are certainly a significant user of them. Consequently, the quality, time, space, stability, and predictability constraints faced by game development are an important factor in much of the work presented at I3D.",
        "We use PN-triangles to improve the quality of isosurfaces extracted by marching cubes. Our contribution is a pure-GPU solution for smoothed isosurfaces, combining GPU isosurface extraction with tessellation shaders for PN-triangles. The marching cubes algorithm was first introduced to reconstruct isosurfaces of implicit functions in a uniformly sampled space. Curved PN-triangles [Vlachos et al. 2001], or PN-triangles for short, is a fast way of generating smooth surfaces using limited local geometric information, such as per-vertex positions, and normals.",
        "Texture compression is widely used in real-time rendering to reduce storage and bandwidth requirements. Recent research in compression algorithms has explored both reduced fixed bit rate and variable bit rate algorithms. The results are evaluated at the individual texture level using Mean Square Error, Peak Signal-to-Noise Ratio, or visual image inspection. We argue this is the wrong evaluation approach. Compression artifacts in individual textures are likely visually masked in final rendered images and this masking is not accounted for when evaluating individual textures. This masking comes from both geometric mapping of textures onto models and the effects of combining different textures on the same model such as diffuse, gloss and bump maps. We evaluate final rendered images using rigorous perceptual error metrics. Our method samples the space of viewpoints in a scene, renders the scene from each …"
    ],
    "title": [
        "‪Optimization in Computer Graphics and Interactive Techniques‬",
        "‪A User Experience Study of MeetingMayhem: A Web-Based Game to Teach Adversarial Thinking‬",
        "‪Real-time subsurface control variates: Temporally stable adaptive sampling‬",
        "‪Real-time subsurface scattering with single pass variance-guided adaptive importance sampling‬",
        "‪Hash functions for gpu rendering‬",
        "‪Virtual reality mirror therapy rehabilitation for post-stroke patients‬",
        "‪In silico dermoscopy with detailed subsurface scattering‬",
        "‪Exploring Earth's Magnetosphere in Virtual Reality‬",
        "‪Visualizations of Volumetric Datasets in Virtual Reality: Benefits and Constraints‬",
        "‪Scientific insights from visualizing 3D simulations in Virtual Reality environment for PSP‬",
        "‪Method and system for filtering of visual objects‬",
        "‪What is the point? Evaluating the structure, color, and semantic traits of computer vision point clouds of vegetation‬",
        "‪RatCAVE: calibration of a projection virtual reality system‬",
        "‪Application creation for an immersive virtual measurement and analysis laboratory‬",
        "‪Optimal altitude, overlap, and weather conditions for computer vision UAV estimates of forest structure‬",
        "‪Rigid fluid‬",
        "‪Evaluating texture compression masking effects using objective image quality assessment metrics‬",
        "‪I3D 2014 Guest Editor’s Introduction‬",
        "‪Isosurface smoothing using marching cubes and PN-triangles‬",
        "‪Objective image quality assessment of texture compression‬"
    ]
}