{
    "scholar_id": "jBpRIe0AAAAJ",
    "name": "‪\"Richard H Moss\" or \"RH Moss\" or \"Moss, Richard H\" or \"Moss, RH\" or \"R. H. Moss\" or \"Richard Moss\"‬ - ‪Google Scholar‬",
    "description": [
        " This chapter provides an overview of the major themes, findings, and recommendations from NPCC4. It presents summary statements from each chapter of the assessment which identify salient and pressing issues raised and provides recommendations for future research and for enhancement of climate resiliency. The chapter also outlines a set of broader recommendations for future NPCC work and identifies some key topics for the next assessment.",
        " This Introduction to NPCC4 provides an overview of the first three NPCC Reports and contextualizes NPCC4's deliberate decision to address justice, equity, diversity, and inclusion in its collective work and in its own practices, procedures, and methods of assessment. Next, it summarizes the assessment process, including greater emphasis on sustained assessment. Finally, it introduces the NPCC4 chapters and their scope.",
        "Preface The MultiSector Dynamics (MSD) Community of Practice (CoP) hosted an inaugural workshop on October 3-5, 2023 at the University of California, Davis, to bring together members of the MSD community of practice to advance understanding of the co-evolution of human and natural systems, and to build the next generation of tools that bridge sectors, scales, and systems to realize a more resilient and equitable future. The theme of the workshop was \"Advancing Complex Adaptive Human-Earth Systems Science in a World of Interconnected Risks\". This document outlines the motivation for the workshop, its goals and objectives, the application process, the agenda, overviews of the training sessions offered to the workshop participants and a summary of each breakout session. The MSD workshop report further discusses the feedback from workshop participants and presents some reflections and next steps. The MSD Workshop organizers thank the DOE Office of Science, Earth and Environmental System Modeling, MultiSector Dynamics program area for financial support of its activities through the Integrated Multisector Multiscale Modeling (IM3) project. For more information related to the broader DOE MultiSector Dynamics Program please see https://climatemodeling.science.energy.gov/program-area/multisector-dynamics. D.L.M. and C.M.B. acknowledge support from the Laboratory Directed Research and Development Program of Oak Ridge National Laboratory (ORNL), managed by UT-Battelle, LLC, for the US Department of Energy (DOE). Disclaimer This report was prepared as an account of work sponsored by an agency of the …",
        " Climate impacts increasingly unfold in interlinked systems of people, nature, and infrastructure. The cascading consequences are revealing sometimes surprising connections across sectors and regions, and prospects for climate responses also depend on complex, difficult‐to‐understand interactions. In this commentary, we build on the innovations of the United States Fifth National Climate Assessment to suggest a framework for understanding and responding to complex climate challenges. This approach involves: (a) integration of disciplines and expertise to understand how intersectionality shapes complex climate impacts and the wide‐ranging effects of climate responses, (b) collaborations among diverse knowledge holders to improve responses and better encompass intersectionality, and (c) sustained experimentation with and learning about governance approaches capable of handling the complexity of …",
        " This chapter of the New York City Panel on Climate Change 4 (NPCC4) report discusses the many intersecting social, ecological, and technological‐infrastructure dimensions of New York City (NYC) and their interactions that are critical to address in order to transition to and secure a climate‐adapted future for all New Yorkers. The authors provide an assessment of current approaches to “future visioning and scenarios” across community and city‐level initiatives and examine diverse dimensions of the NYC urban system to reduce risk and vulnerability and enable a future‐adapted NYC. Methods for the integration of community and stakeholder ideas about what would make NYC thrive with scientific and technical information on the possibilities presented by different policies and actions are discussed. This chapter synthesizes the state of knowledge on how different communities of scholarship or practice envision …",
        "This poster is part of the Fifth National Climate Assessment (NCA5) poster series. NCA5 Chapter 19-Economics outlines the myriad ways that climate change stands to impact the US economy, both today and in the future. The chapter summarizes the implications of these impacts on different sectors of the economy, from households to governments. The AGU community is invited to explore the Economics chapter as well as the full NCA5—the preeminent source of climate information for the United States. NCA5 is developed by the US Global Change Research Program and is scheduled for release in late 2023.",
        "The interconnected risks to interdependent infrastructure, environmental, and socioeconomic systems posed by climate change, energy transitions, and sustainable development require transdisciplinary perspectives to understand the involved complex dynamics and interdependencies. The breadth and diversity of systems, processes, and risks require a synthesis of an extremely diverse set of research fields, literatures, and operational expertise. Recent breakthroughs in artificial intelligence (AI) present promising opportunities to accelerate progress in transdisciplinary synthesis in MultiSector Dynamics (MSD) research. AI can potentially help to clarify connections across scientific communities and accelerate the translation of insights across domains. Here we demonstrate a systematic approach using a combination of modern natural language processing (NLP), graph-based and other machine learning …",
        "Linking science with action affords a prime opportunity to leverage greater societal impact from research and increase the use of evidence in decision-making. Success in these areas depends critically upon processes of producing and mobilizing knowledge, as well as supporting and making decisions. For decades, scholars have idealized and described these social processes in different ways, resulting in numerous assumptions that now variously guide engagements at the interface of science and society. We systematically catalog these assumptions based on prior research on the science-policy interface, and further distill them into a set of 26 claims. We then elicit expert perspectives (n = 16) about these claims to assess the extent to which they are accurate or merit further examination. Out of this process, we construct a research agenda to motivate future scientific research on actionable knowledge, prioritizing …",
        " The role of individual and collective human action is increasingly recognized as a prominent and arguably paramount determinant in shaping the behavior, trajectory, and vulnerability of multisector systems. This human influence operates at multiple scales: from short‐term (hourly to daily) to long‐term (annually to centennial) timescales, and from the local to the global, pushing systems toward either desirable or undesirable outcomes. However, the effort to represent human systems in multisector models has been fragmented across philosophical, methodological, and disciplinary lines. To cohere insights across diverse modeling approaches, we present a new typology for classifying how human actors are represented in the broad suite of coupled human‐natural system models that are applied in MultiSector Dynamics (MSD) research. The typology conceptualizes a “sector” as a system‐of‐systems that includes a …",
        " The field of MultiSector Dynamics (MSD) explores the dynamics and co‐evolutionary pathways of human and Earth systems with a focus on critical goods, services, and amenities delivered to people through interdependent sectors. This commentary lays out core definitions and concepts, identifies MSD science questions in the context of the current state of knowledge, and describes ongoing activities to expand capacities for open science, leverage revolutions in data and computing, and grow and diversify the MSD workforce. Central to our vision is the ambition of advancing the next generation of complex adaptive human‐Earth systems science to better address interconnected risks, increase resilience, and improve sustainability. This will require convergent research and the integration of ideas and methods from multiple disciplines. Understanding the tradeoffs, synergies, and complexities that exist in coupled …",
        "No description available",
        "This volume celebrates many aspects of the diverse and influential work of Martin Parry. This particular article is inspired by the roles he has played in assessments of climate change impacts, including through the Intergovernmental Panel on Climate Change (IPCC). In the spirit of his contributions to improving the scientific foundations for effective decision-making (e.g., [Carter et al., 1994; IPCC, 2007b]) I would like to reflect on how the role of assessments needs to change to better support adaptation and mitigation of climate change. While the article describes potential extensions to the US National Climate Assessment that would increase its usability and impact, some of the observations and ideas may have potential relevance to other countries and the IPCC.",
        "Providing reliable, affordable, and low-carbon electricity to customers, while accelerating the adoption of low-carbon technologies, such as renewable energy, electric vehicles and electrified buildings, requires ongoing ingenuity and innovations. On top of these planning and procurement challenges, climate change has exposed system-wide vulnerabilities and elevated the urgency of adapting the electric sector to new risks. To do this, electric sector planners face the difficult task of understanding which climate science and technology adoption data are appropriate to use, and how best to apply that data to plan for an uncertain future. The problem of identifying and applying appropriate climate data, which has been referred to as The Practitioners Dilemma, is not new, and it affects multiple US economic sectors beyond electricity (eg, agriculture, drinking water). For the electric sector, it is becoming more pressing as …",
        "The role of individual and collective human agency is increasingly recognized as a prominent and arguably paramount determinant in shaping the behavior, trajectory, and vulnerability of multisector systems. This human influence operates at multiple scales: from short-term (hourly to daily) to long-term (annually to decennially) timescales, and from the local to the global, pushing systems towards either desirable or undesirable outcomes. We present a new typology for classifying how human actors are represented in the broad suite of coupled human-natural system (CHNS) models that are applied in MultiSector Dynamics (MSD) research. The typology conceptualizes a sector as a system-of-systems that includes a diverse group of human actors, defined across individual to collective social levels, involved in governing, provisioning, and utilizing of a product, good, or service towards some human end, or in …",
        "Although relocation of human populations is nothing new, global environmental changes such as climate change, sea level rise, and land use change are increasing the likelihood of relocation for potentially millions of people, especially in coastal regions. Globally, sea level rise alone could place 340 million people on land projected to be below annual flood levels by 2050 (1). The need for relocation will increase because of such risks, the lack of funding for protection and accommodation strategies, and/or the reality that sea walls and other measures will eventually be ineffective. Thus, current approaches to planned relocation such as buyouts for individual households are likely to be “woefully inadequate” in the future (2). We discuss how science, governance, and their interactions need to evolve to make planned relocation a strategic option that leaves people, communities, and the environment better off. The …",
        "In May 2020, the New York City (NYC) Mayor’s Office of Climate Resiliency (MOCR) began convening bi-weekly discussions, called the Rapid Research and Assessment (RRA) Series, between City staff and external experts in science, policy, design, engineering, communications, and planning. The goal was to rapidly develop authoritative, actionable information to help integrate resiliency into the City’s COVID response efforts. The situation in NYC is not uncommon. Extreme events often require government officials, practitioners, and citizens to call upon multiple forms of scientific and technical assistance from rapid data collection to expert elicitation, each spanning more or less involved engagement. We compare the RRA to similar rapid assessment efforts and reflect on the nature of the RRA and similar efforts to exchange and co-produce knowledge. The RRA took up topics on social cohesion, risk …",
        "Increasingly, we face compounding and interrelated environmental, socioeconomic, and political crises. Yet our approaches to these problems are often siloed, fragmented, and inadequate. The current pandemic, for instance, continues to collide with a number of other threats to human life and livelihoods. These include violent conflicts, displacement, insect swarms, droughts, heat waves, and structural inequality in the form of racism and gender discrimination. We believe we are at a critical juncture, faced with a need and responsibility to redesign institutions to be proactive, agile, and socially just when confronted with increasingly likely compound risks. Because the coronavirus disease 2019 (COVID-19) emergency is a protracted crisis that entails waves of infections over several months, the pandemic will inevitably continue to collide with other social and environmental shocks and disruptions, leading to …",
        " The Scenario Model Intercomparison Project (ScenarioMIP) defines and coordinates the main set of future climate projections, based on concentration-driven simulations, within the Coupled Model Intercomparison Project phase 6 (CMIP6). This paper presents a range of its outcomes by synthesizing results from the participating global coupled Earth system models. We limit our scope to the analysis of strictly geophysical outcomes: mainly global averages and spatial patterns of change for surface air temperature and precipitation. We also compare CMIP6 projections to CMIP5 results, especially for those scenarios that were designed to provide continuity across the CMIP phases, at the same time highlighting important differences in forcing composition, as well as in results. The range of future temperature and precipitation changes by the end of the century (2081–2100) encompassing the Tier 1  experiments based on the Shared Socioeconomic Pathway (SSP) scenarios (SSP1-2.6, SSP2-4.5, SSP3-7.0 and SSP5-8.5) and SSP1-1.9 spans a larger range of outcomes compared to CMIP5, due to higher warming (by close to 1.5 ) reached at the upper end of the 5 %–95 % envelope of the highest scenario (SSP5-8.5). This is due to both the wider range of radiative forcing that the new scenarios cover and the higher climate sensitivities in some of the new models compared to their CMIP5 predecessors. Spatial patterns of change for temperature and precipitation averaged over models and scenarios have familiar features, and an analysis of their variations confirms model structural differences to be the dominant source of uncertainty. Models also differ …",
        "No description available",
        "Annual Nominal Index Page 84 Annual Nominal Index 294) Prague Medical Report/Vol. \n123 (2022) No. 4, p. 294–295 Annual Nominal Index ISSN 1214–6994 Ali HN 3/166–180 \nAlubaidi GT 3/166–180 Andrade LM 2/101–112 Atis RG 3/199–205 Babál P. 3/193–198 \nBeňo M. 2/95–100 Bettiol NB 2/101–112 Brodská H. 4/266–278 Bustos Sánchez JL 1/27–34 \nCecilio FA 2/101–112; 4/ Chaparro Santos LR 1/27–34 Chatziioannidis I. 1/48–55 Chong \nWH 3/140–165 Cicek M. 3/199–205 Čierna Z. 3/193–198 Czakó L. 3/193–198 da Silva GP 3/181–187 \nDaneshi SA 2/113–119 de Vasconcelos PB 2/101–112; 4/258–265 Drábek T. 4/266–278 \nDvoranová B. 3/193–198 Dzonov B. 2/88–94 Eldahshan A. 3/188–192 Erdogan BA 3/188–192 \nFadavi P. 2/113–119 Fattahi A. 2/113–119 Fernández SI 4/250–257 Foltán R. 2/95–100 \nGallo Vaulet ML 4/250–257 Gavras C. 1/48–55 Georgieva G. 2/88–94 Gomes GGC 3/181–187 …"
    ],
    "title": [
        "‪NPCC4: Climate risk and equity—advancing knowledge toward a sustainable future| Conclusions‬",
        "‪NPCC4: Climate risk and equity—advancing knowledge toward a sustainable future| Introduction‬",
        "‪MultiSector Dynamics: 2023 Inaugural Workshop Report‬",
        "‪Research to confront climate change complexity: Intersectionality, integration, and innovative governance‬",
        "‪NPCC4: Concepts and tools for envisioning New York City's futures‬",
        "‪Economics-The Fifth National Climate Assessment‬",
        "‪Advancing Complex Human-Earth Systems Science through Natural Language Processing, Graph Machine Learning, and Artificial Intelligence‬",
        "‪A research agenda for the science of actionable knowledge: Drawing from a review of the most misguided to the most enlightened claims in the science-policy interface literature‬",
        "‪A typology for characterizing human action in multisector dynamics models‬",
        "‪Multisector dynamics: Advancing the science of complex adaptive human‐Earth systems‬",
        "‪MultiSector dynamics: scientific challenges and a research vision for 2030, a community of practice supported by the United States Department of Energy's Office of Science‬",
        "‪What is the Role of Climate Assessments in 2020?‬",
        "‪Ways to Navigate the Clean Energy Transition in a Changing Climate‬",
        "‪A Typology for Representing Human Actors in MultiSector Dynamics Models‬",
        "‪Planned relocation: Pluralistic and integrated science and governance‬",
        "‪Rapid research and assessment on COVID-19 and climate in New York City‬",
        "‪Compound risks and complex emergencies require new approaches to preparedness‬",
        "‪Climate model projections from the scenario model intercomparison project (ScenarioMIP) of CMIP6‬",
        "‪Climate model projections from the Scenario Model Intercomparison Project (ScenarioMIP) of CMIP6, Earth Syst. Dynam., 12, 253–293‬",
        "‪Annual Nominal Index‬"
    ]
}