{
    "scholar_id": "y1x9Hx8AAAAJ",
    "name": "‪Riadul Islam‬ - ‪Google Scholar‬",
    "description": [
        "The controller area network (CAN) remains the de facto standard for intra-vehicular communication. CAN enables reliable communication between various microcontrollers and vehicle devices without a central computer, which is essential for sustainable transportation systems. However, it poses some serious security threats due to the nature of communication. According to caranddriver.com, there were at least 150 automotive cybersecurity incidents in 2019, a 94% year-over-year increase since 2016, according to a report from Upstream Security. To safeguard vehicles from such attacks, securing CAN communication, which is the most relied-on in-vehicle network (IVN), should be configured with modifications. In this paper, we developed a configurable CAN communication protocol to secure CAN with a hardware prototype for rapidly prototyping attacks, intrusion detection systems, and response systems. We used a field programmable gate array (FPGA) to prototype CAN to improve reconfigurability. This project focuses on attack detection and response in the case of bus-off attacks. This paper introduces two main modules: the multiple generic errors module with the introduction of the error state machine (MGEESM) module and the bus-off attack detection (BOAD) module for a frame size of 111 bits (BOAD111), based on the CAN protocol presenting the introduction of form error, CRC error, and bit error. Our results show that, in the scenario with the transmit error counter (TEC) value 127 for switching between the error-passive state and bus-off state, the detection times for form error, CRC error, and bit error introduced in the MGEESM module …",
        "In recent years, Compute-in-memory (CiM) architectures have emerged as a promising solution for deep neural network (NN) accelerators. Multiply-accumulate (MAC) is considered a de facto unit operation in NNs. By leveraging the minimal data movement required and inherent parallel processing capabilities of CiM, NNs that require numerous MAC operations can be executed more efficiently. Traditional CiM architectures execute MAC operations in the analog domain, employing an Analog-to-Digital converter (ADC) to digitize the analog MAC values. However, these ADCs introduce significant increase in area and power consumption, as well as introduce non-linearities. This work proposes a resonant time-domain CiM (rTD-CiM), an ADC-less architecture that reduces the power consumption of traditional CiM architectures with ADCs. The feasibility of the proposed architecture is evaluated on an 8KB SRAM …",
        "Sensor-estimator systems provide critical information on the state of cyber-physical plants. Often, these units operate in an environment of constrained computational resources. This condition makes them vulnerable to cyberattacks that aim especially to degrade their processing capability and effectively incapacitate them. In the event that computational nodes are lost, an approach to adapt the estimator’s algorithm and reprogram the adapted form on the surviving hardware is presented. To prepare the sensor-estimator system for degradation, the following co-design steps are developed: 1) the estimation algorithm, a bank of Kalman filters (KFs), is distributed so that multiple elemental filters are implemented on a collection of field-programmable gate arrays (FPGAs) and 2) the matrix operations of the conventional KF are programmed on the FPGAs using Faddeeva’s elimination. After the attack, adaptation of the …",
        "Organizations managing high-performance computing systems face a multitude of challenges, including overarching concerns such as overall energy consumption, microprocessor clock frequency limitations, and the escalating costs associated with chip production. Evidently, processor speeds have plateaued over the last decade, persisting within the range of 2 GHz to 5 GHz. Scholars assert that brain-inspired computing holds substantial promise for mitigating these challenges. The spiking neural network (SNN) particularly stands out for its commendable power efficiency when juxtaposed with conventional design paradigms. Nevertheless, our scrutiny has brought to light several pivotal challenges impeding the seamless implementation of large-scale neural networks (NNs) on silicon. These challenges encompass the absence of automated tools, the need for multifaceted domain expertise, and the inadequacy of existing algorithms to efficiently partition and place extensive SNN computations onto hardware infrastructure. In this paper, we posit the development of an automated tool flow capable of transmuting any NN into an SNN. This undertaking involves the creation of a novel graph-partitioning algorithm designed to strategically place SNNs on a network-on-chip (NoC), thereby paving the way for future energy-efficient and high-performance computing paradigms. The presented methodology showcases its effectiveness by successfully transforming ANN architectures into SNNs with a marginal average error penalty of merely 2.65%. The proposed graph-partitioning algorithm enables a 14.22% decrease in inter-synaptic communication …",
        "Power-performance constraints have been the key driving force that motivated the microprocessor industry to bring unique design techniques in the past two decades. The rising demand for high-performance microprocessors increases the circuit complexity and data transfer rate, resulting in higher power consumption. This work proposes a set of energy recycling resonant pulsed flip-flops to reuse some of the dissipated energy using series inductor–capacitor (LC) resonance. Moreover, this work also presents wideband clocking architectures that use series LC resonance and an inductor tuning technique. By employing pulsed resonance, the switching power dissipated is recycled back. The inductor tuning technique aids in reducing the skew, increasing the robustness of the clock networks. This new resonant clocking architecture saves over 43% power and 90% reduced skew in clock tree networks and saves 44 …",
        "Traditional State-of-the-Art computing platforms have relied on silicon-based static random access memories (SRAM) and digital Boolean logic for intensive computations. Although the metal-oxide-semiconductor transistors have been aggressively scaled, the fundamental von-Neumann computing architecture has remained unaltered. The emerging paradigm of Compute-in-Memory (CIM) offers a promising solution to overcome the memory wall bottleneck in traditional von-Neumann architectures by enabling the processing and storing of information within SRAM memory elements. This article introduces an energy-recycling resonant 10T-SRAM architecture that facilitates in-memory computations to minimize the need for data movement between the processing core and memory. Series resonant write driver is utilized to efficiently recycle the discharged energy during a writing operation to reduce the overall energy …",
        "Surface acoustic wave (SAW) sensors with increasingly unique and refined designed patterns are often developed using the lithographic fabrication processes. Emerging applications of SAW sensors often require novel materials, which may present uncharted fabrication outcomes. The fidelity of the SAW sensor performance is often correlated with the ability to restrict the presence of defects in post-fabrication. Therefore, it is critical to have effective means to detect the presence of defects within the SAW sensor. However, labor-intensive manual labeling is often required due to the need for precision identification and classification of surface features for increased confidence in model accuracy. One approach to automating defect detection is to leverage effective machine learning techniques to analyze and quantify defects within the SAW sensor. In this paper, we propose a machine learning approach using a deep …",
        "The microprocessor industry faces several challenges: total power consumption, processor speed, and increasing chip cost. It is visible that the processor speed in the last decade has not improved and saturated around 2 GHz to 5 GHz. Researchers believe that brain-inspired computing has great potential to resolve these problems. The spiking neural network (SNN) exhibits excellent power performance compared to the conventional design. However, we identified several key challenges to implementing large-scale neural networks (NNs) on silicon, such as nonexistent automated tools and requirements of many-domain expertise, and existing algorithms can not partition and place large-scale SNN computation efficiently on the hardware. In this research, we propose to develop an automated tool flow that can convert any NN to an SNN. In this process, we will develop a novel graph-partitioning algorithm and …",
        "Systems and methods of graph-based vehicular intrusion detection are disclosed. According to an aspect, an intrusion detection system includes a computing device configured to receive messages communicated on a vehicular communi cations network. The computing device also includes con struct a set of graphs based on the received messages. Further, the computing device includes apply a graph-based anomaly detection technique to the set of graphs for iden tifying an anomaly among one or more of the received messages. The computing device also includes implement a predetermined action to mitigate an intrusion based on identification of the anomaly.",
        "At leading technology nodes, the industry is facing a stiff challenge to make profitable integrated circuits (ICs). One of the primary issues is the design rule checking (DRC) violation. This research cohort with the DARPA IDEA program aims for “no-human-in-the-loop” and 24-h turnaround time to implement an IC from design specifications. In order to reduce human effort, this work introduces the ensemble random forest, gradient boosting, and Adaboost algorithms to predict DRC violations before detailed routing, which is considered the most time-consuming step in an IC design flow. In addition, this work identifies the features that critically impact DRC violations. The proposed algorithm has a 2% better F1-score compared to the existing support-vector machine (SVM) classifiers. The proposed ensemble approach has up to an area-under-the-curve–receiver operating characteristics (AUC–ROC) curve mean of 0.940 with ± 0 …",
        "Sensing systems onboard unmanned vehicles operate in an environment of constrained computational resources. A cyber-attack may primarily aim to degrade these computing devices and, ultimately, incapacitate the sensing system itself. To prepare a prototype tracking system for degradation, this paper proposes distributed hardware implementation of a Multiple Model estimator on two FPGA units and, after an attack, adaptation of the estimator by leveraging Dynamic Partial Reconfiguration of the single surviving FPGA. The method ensures that the most likely models of the estimator are loaded on to the fabric of the surviving FPGA with minimal interruption.",
        "As the demand for high-performance microprocessors increases, the circuit complexity and the rate of data transfer increases resulting in higher power consumption. We propose a clocking architecture that uses a series LC resonance and inductor matching technique to address this bottleneck. By employing pulsed resonance, the switching power dissipated is recycled back. The inductor matching technique aids in reducing the skew, increasing the robustness of the clock network. This new resonant architecture saves over 43% power and 91% skew clocking a range of 1-5 GHz, compared to a conventional primary-secondary flip-flop-based CMOS architecture.",
        "The DARPA POSH program echoes with the research community and identifies that engineering productivity has fallen behind Moore’s law, resulting in the prohibitive increase in IC design cost at leading technology nodes. The primary reason is that it requires many computing resources, expensive tools, and even many days to complete a design implementation. However, at the end of this process, some designs could not meet the design constraints and become unroutable, creating a vicious circuit design cycle. As a result, designers have to re-run the whole process after design modification. This research applied a machine learning approach to automatically identify design constraints and design rule checking (DRC) violation issues and help the designer identify design constraints with optimal DRCs before the long detailed routing process through iterative greedy search. The proposed algorithm achieved up to 99.99% design constraint prediction accuracy and reduced 98.4% DRC violations with only a 6.9% area penalty.",
        "Power-performance constraints have been the key driving force that motivated the microprocessor industry to bring unique design techniques in the past two decades. Besides, the rising demand of high-performance microprocessors increases the circuit complexity and the rate of data transfer resulting in higher power consumption. This work proposes a set of energy recycling resonant pulsed flip-flops to reuse some of the dissipated energy using series LC resonance. Moreover, this work also proposes wideband clocking architectures that use series LC resonance and an inductor tuning technique. By employing pulsed resonance, the switching power dissipated is recycled back. The inductor tuning technique aids in reducing theskew, increasing the robustness of the clock networks. This new resonant clocking architecture saves over 43% power and 90% reduced skew in clock tree networks, and saves 44 …",
        "The national highway traffic safety administration (NHTSA) identified cybersecurity of the automobile systems are more critical than the security of other information systems. Researchers already demonstrated remote attacks on critical vehicular electronic control units (ECUs) using controller area network (CAN). Besides, existing intrusion detection systems (IDSs) often propose to tackle a specific type of attack, which may leave a system vulnerable to numerous other types of attacks. A generalizable IDS that can identify a wide range of attacks within the shortest possible time has more practical value than attack-specific IDSs, which is not a trivial task to accomplish. In this paper we propose a novel graph-based Gaussian naive Bayes (GGNB) intrusion detection algorithm by leveraging graph properties and PageRank-related features. The GGNB on the real rawCAN data set [1] yields 99.61%, 99.83%, 96.79%, and …",
        "In this paper, we investigate several on-chip signaling schemes. Specifically, we compare different voltage-mode (VM) and current-mode (CM) signaling schemes considering power, performance, and robustness. In addition, we propose a new CM signaling scheme that uses a simple NAND-NOR gate transmitter circuit and a current-comparator-based receiver circuit. We implemented each signaling scheme using a 45 nm CMOS technology. The extracted simulation results show that a traditional CM signaling scheme consumes 58–78% less power compared to a traditional buffered VM signaling scheme in the 1–3 GHz frequency range. Our proposed CM signaling scheme consumes up to 95% and 81% lower power compared to buffered VM and existing CM schemes, respectively. In addition, the proposed CM signaling scheme has 37–41% lower latency with similar slew-rates compared to the buffered …",
        "Although we may be at the end of Moore's law, lowering chip power consumption is still the primary driving force for the designers. To enable low-power operation, we propose a resonant energy recovery static random access memory (SRAM). We propose the first series resonance scheme to reduce the dynamic power consumption of the SRAM operation. Besides, we identified the requirement of supply boosting of the write buffers for proper resonant operation. We evaluated the resonant 144KB SRAM cache through SPICE and test chip using a commercial 28nm CMOS technology. The experimental results show that the resonant SRAM can save up to 30% dynamic power at 1GHz operating frequency compared to the state-of-the-art design.",
        "The controller area network (CAN) is the most widely used intra-vehicular communication network in the automotive industry. Because of its simplicity in design, it lacks most of the requirements needed for a security-proven communication protocol. However, a safe and secured environment is imperative for autonomous as well as connected vehicles. Therefore CAN security is considered one of the important topics in the automotive research community. In this article, we propose a four-stage intrusion detection system that uses the chi-squared method and can detect any kind of strong and weak cyber attacks in a CAN. This work is the first-ever graph-based defense system proposed for the CAN. Our experimental results show that we have a very low 5.26% misclassification for denial of service (DoS) attack, 10% misclassification for fuzzy attack, 4.76% misclassification for replay attack, and no misclassification for …",
        "Systems and methods for a hybrid current-mode to voltage-mode integrated circuit. An example integrated circuit embodiment configured according to this disclosure can include: a clock circuit and a logic circuit operatively synchronized with said clock circuit, where the logic circuit has a plurality of sub-circuits. The clock circuit can include a current-mode network tree and a plurality of current-mode-to-voltage-mode converters, each current-mode-to-voltage-mode converter in the plurality of current-mode-to-voltage-mode converters being electrically connected to the current-mode network tree, and each current-mode-to-voltage-mode converter in the plurality of current-mode-to-voltage-mode converters being associated with a respective one of the plurality of sub-circuits. The clock circuit can also include a global current mode transmitter electrically connected to the current-mode network tree, where the global …",
        " The controller area network (CAN) is one of the most popular intra-vehicular communication protocols in the automotive industry. Due to its simplicity and broadcasting technique, the CAN bus protocols have some vulnerabilities. In the last couple of years, security attacks on vehicles have been increasing significantly. These acute attacks remain undetected by the conventional CAN protocol. In this paper, we propose a method that can prevent many kinds of CAN bus monitoring attacks without any change in the underlying CAN protocol. The experimental results demonstrate that our proposed methodology is useful for preventing as well as defending against attacks on the CAN bus. In the worst-case scenario, the proposed algorithm requires 0.41 s to detect an attack and prevent the attack by dynamically updating the message arbitration ID of a system comprising twelve types of message IDs."
    ],
    "title": [
        "‪Reconfigurable can intrusion detection and response system‬",
        "‪A Resonant Time-Domain Compute-in-Memory (rTD-CiM) ADC-Less Architecture for MAC Operations‬",
        "‪State Estimation Adaptable to Cyberattack Using a Hardware Programmable Bank of Kalman Filters‬",
        "‪Benchmarking Artificial Neural Network Architectures for High-Performance Spiking Neural Networks‬",
        "‪Design automation of series resonance clocking in 14-nm FinFETs‬",
        "‪Resonant Compute-In-Memory (rCIM) 10T SRAM Macro for Boolean Logic‬",
        "‪Deep Image Segmentation for Defect Detection in Photo-lithography Fabrication‬",
        "‪Exploring High-Level Neural Networks Architectures for Efficient Spiking Neural Networks Implementation‬",
        "‪Systems and methods of graph-based vehicular intrusion detection‬",
        "‪Early Stage DRC Prediction Using Ensemble Machine Learning Algorithms‬",
        "‪Degradable tracking system based on hardware multi-model estimators‬",
        "‪Power and skew reduction using resonant energy recycling in 14-nm FinFET clocks‬",
        "‪Feasibility prediction for rapid IC design space exploration‬",
        "‪Power and Skew Reduction Using Resonance Energy Recycling in FinFET based Wideband Clock Networks‬",
        "‪GGNB: Graph-based Gaussian naive Bayes intrusion detection system for CAN bus‬",
        "‪High-speed on-chip signaling: Voltage or current-mode?‬",
        "‪Resonant energy recycling sram architecture‬",
        "‪Graph-based intrusion detection system for controller area networks‬",
        "‪System and method for a hybrid current-mode and voltage-mode integrated circuit‬",
        "‪Improving CAN bus security by assigning dynamic arbitration IDs‬"
    ]
}