{
    "scholar_id": "0PMb9xcAAAAJ",
    "description": [
        "With the increasing popularity of quantum computing and in particular quantum annealing, there has been growing research to evaluate the meta-heuristic for various problems in linear algebra: from linear least squares to matrix and tensor factorization. At the core of this effort is to evaluate quantum annealing for solving linear least squares and linear systems of equations. In this work, we focus on the viability of using quantum annealing for solving these problems. We use simulations based on the adiabatic principle to provide new insights for previously observed phenomena with the D-wave machines, such as quantum annealing being robust against ill-conditioned systems of equations and scaling quite well against the number of rows in a system. We then propose a hybrid approach which uses a quantum annealer to provide a initial guess of the solution , which would then be iteratively improved with classical fixed point iteration methods.",
        "PROCEEDINGS OF SPIE Page 1 PROCEEDINGS OF SPIE SPIEDigitalLibrary.org/conference-proceedings-of-spie \nFront Matter: Volume 12093 , \"Front Matter: Volume 12093,\" Proc. SPIE 12093, Quantum \nInformation Science, Sensing, and Computation XIV, 1209301 (22 June 2022); doi: 10.1117/12.2643439 \nEvent: SPIE Defense + Commercial Sensing, 2022, Orlando, Florida, United States \nDownloaded From: https://www.spiedigitallibrary.org/conference-proceedings-of-spie on 29 \nJun 2023 Terms of Use: https://www.spiedigitallibrary.org/terms-of-use Page 2 \nPROCEEDINGS OF SPIE Volume 12093 Proceedings of SPIE 0277-786X, V. 12093 SPIE is \nan international society advancing an interdisciplinary approach to the science and \napplication of light. Quantum Information Science, Sensing, and Computation XIV Eric Donkor \nMichael Hayduk Michael R. Frey Samuel J. Lomonaco Jr. John M. Myers Editors 3–7 April …",
        "The quantum approximate optimization algorithm (QAOA) by Farhi et al. is a quantum computational framework for solving quantum or classical optimization tasks. Here, we explore using QAOA for binary linear least squares (BLLS); a problem that can serve as a building block of several other hard problems in linear algebra, such as the non-negative binary matrix factorization (NBMF) and other variants of the non-negative matrix factorization (NMF) problem. Most of the previous efforts in quantum computing for solving these problems were done using the quantum annealing paradigm. For the scope of this work, our experiments were done on noiseless quantum simulators, a simulator including a device-realistic noise-model, and two IBM Q 5-qubit machines. We highlight the possibilities of using QAOA and QAOA-like variational algorithms for solving such problems, where trial solutions can be obtained directly as samples, rather than being amplitude-encoded in the quantum wavefunction. Our numerics show that even for a small number of steps, simulated annealing can outperform QAOA for BLLS at a QAOA depth of  for the probability of sampling the ground state. Finally, we point out some of the challenges involved in current-day experimental implementations of this technique on cloud-based quantum computers.",
        "We continue our discusson on quantum knots and knotted zeroes, further discussing relationships with mosaic and lattice quantum knots.",
        "In 2001, Michael Berry4 published the paper ”Knotted Zeros in the Quantum States of Hydrogen” in Foundations of Physics. In this paper we show how to place Berry’s discovery in the context of general knot theory and in the context of our formulations for quantum knots. Berry gave a time independent wave function for hydrogen, as a map from three space R3 to the complex plane and such that the inverse image of 0 in the complex plane contains a knotted curve in R3. We show that for knots in R3 this is a generic situation in that every smooth knot K in R3 has a smooth classifying map f : R3 −→ C (the complex plane) such that f−1(0) = K. This leaves open the question of characterizing just when such f are wave-functions for quantum systems. One can compare this result with the work of Mark Dennis and his collaborators and with the work of Lee Rudolph. Our approach provides great generality to the structure of …",
        "PROCEEDINGS OF SPIE Page 1 PROCEEDINGS OF SPIE SPIEDigitalLibrary.org/conference-proceedings-of-spie \nFront Matter: Volume 10984 , \"Front Matter: Volume 10984,\" Proc. SPIE 10984, Quantum \nInformation Science, Sensing, and Computation XI, 1098401 (18 June 2019); doi: 10.1117/12.2537627 \nEvent: SPIE Defense + Commercial Sensing, 2019, Baltimore, MD, United States Downloaded \nFrom: https://www.spiedigitallibrary.org/conference-proceedings-of-spie on 03 Jul 2023 \nTerms of Use: https://www.spiedigitallibrary.org/terms-of-use Page 2 PROCEEDINGS OF \nSPIE Volume 10984 Proceedings of SPIE 0277-786X, V. 10984 SPIE is an international \nsociety advancing an interdisciplinary approach to the science and application of light. \nQuantum Information Science, Sensing, and Computation XI Eric Donkor Michael \nHayduk Michael R. Frey Samuel J. Lomonaco Jr. John M. Myers Editors 18 April 2019 …",
        "First construct in Mathematica a random function QMeasure that simulates quantum measurement. The input of QMeasure is an ordered pair (Ω,| ψ〉)[where Ω is an observable of the quantum system given as a matrix in the standard basis and| ψ〉 is the state of the quantum system given as a column vector written in th standard basis], and whose output with probability pj=〈 ψ| Pj| ψ〉 is the pair (λj,| ψj〉)[where λj is j-th eigenvalue of Ω, and where| ψj〉 is state of the quantum system resulting from the measurement].",
        "No description available",
        " With the advent of quantum computers, researchers are exploring if quantum mechanics can be leveraged to solve important problems in ways that may provide advantages not possible with conventional or classical methods. A previous work by O’Malley and Vesselinov in 2016 briefly explored using a quantum annealing machine for solving linear least squares problems for real numbers. They suggested that it is best suited for binary and sparse versions of the problem. In our work, we propose a more compact way to represent variables using two’s and one’s complement on a quantum annealer. We then do an in-depth theoretical analysis of this approach, showing the conditions for which this method may be able to outperform the traditional classical methods for solving general linear least squares problems. Finally, based on our analysis and observations, we discuss potentially promising areas of …",
        " This paper is an introduction to relationships between topology, quantum computing, and the properties of Fermions. In particular, we study the remarkable unitary braid group representations associated with Majorana fermions.",
        "No description available",
        "We investigate the GHZ paradox as embodied in Mermin’s machine. We begin by showing that this machine is impossible to implement within the context of classical physics. Then we go on to show how it can be implemented within quantum mechanics. We push this investigation to its limits using some of the most recent advances in quantum computation and quantum information science. The detailed wiring diagram constructed herein provides an explicit and revealing definition of the machine. In particular, it makes explicit how paradoxical indeterminism and nonlocality can be quantified and mathematically captured by the second elementary Boolean function. It also gives an illustration of the many subtleties involved in the quantum control of distributed quantum systems. Within this paper, we introduce two new mathematical constructs, i.e., Boolean unitaries and Boolean observables, that provide a useful …",
        "The quantum hidden subgroup approach is an actively studied approach to solve combinatorial problems in quantum complexity theory. With the success of the Shor's algorithm, it was hoped that similar approach may be useful to solve the other combinatorial problems. One such problem is the graph isomorphism problem which has survived decades of efforts using the hidden subgroup approach. This paper provides a systematic approach to create arbitrarily large classes of classically efficiently solvable graph automorphism problems or easy graph automorphism problems for which hidden subgroup approach is guaranteed to always fail irrespective of the size of the graphs no matter how many copies of coset states are used. As the graph isomorphism problem is believed to be at least as hard as the graph automorphism problem, the result of this paper entails that the hidden subgroup approach is also guaranteed to always fail for the arbitrarily large classes of graph isomorphism problems. Combining these two results, it is argued that the hidden subgroup approach is essentially a dead end and alternative quantum algorithmic approach needs to be investigated for the graph isomorphism and automorphism problems.",
        "The Schulz-type methods for computing generalized matrix inverses are a family of iterative methods that are popular for their high order of convergence (≥ 2). We propose two new scaled acceleration techniques for such type of iterative methods for real matrices (based on Frobenius norm minimization) and lay out efficient algorithms to implement these techniques. Test results show one of our techniques to be most effective for dense matrices but also works for sparse cases as well.",
        "The near confluence of the successful launch of the Orbiting Carbon Observatory2 on July 2, 2014 and the acceptance on August 20, 2015 by Google, NASA Ames Research Center and USRA of a 1152 qubit D-Wave 2X Quantum Annealing Computer (QAC), offered an exceptional opportunity to explore the potential of this technology to address the scientific prediction of global annual carbon uptake by land surface processes. At UMBC,we have collected and processed 20 months of global Level 2 light CO2 data as well as fluorescence data. In addition we have collected ARM data at 2sites in the US and Ameriflux data at more than 20 stations. J. Dorband has developed and implemented a multi-hidden layer Boltzmann Machine (BM) algorithm on the QAC. Employing the BM, we are calculating CO2 fluxes by training collocated OCO-2 level 2 CO2 data with ARM ground station tower data to infer to infer measured CO2 flux data. We generate CO2 fluxes with a regression analysis using these BM derived weights on the level 2 CO2 data for three Ameriflux sites distinct from the ARM stations. P. Gentine has negotiated for the access of K34 Ameriflux data in the Amazon and is applying a neural net to infer the CO2 fluxes. N. Talik validated the accuracy of the BM performance on the QAC against a restricted BM implementation on the IBM Softlayer Cloud with the Nvidia co-processors utilizing the same data sets. G. Nearing and K. Harrison have extended the GSFC LIS model with the NCAR Noah photosynthetic parameterization and have run a 10 year global prediction of the net ecosystem exchange. C. Pellisier is preparing a BM implementation …",
        "This paper is an introduction to relationships between topology, quantum computing and the properties of fermions. In particular we study the remarkable unitary braid group representations associated with Majorana fermions.",
        " This chapter discusses algorithmic and experimental aspects of quantum control of spin and pseudospin systems in view of realizing quantum algorithms or quantum simulations at minimal cost, in particular in a minimum amount of time. Geometric and optimal quantum control are most powerful tools for optimizing experimental implementations of quantum computing, whenever the quantum degrees of freedom can be described in closed Lie‐algebraic form. It is highly desirable to strive for time‐optimal implementations of quantum algorithms or their modules in order to avoid unnecessary decoherence. Apart from low temperatures, hyperpolarization techniques, or in situ reactions with para‐hydrogen, even thermal ensemble states may be used for nuclear magnetic resonance (NMR) implementations of quantum algorithms, which are in principle scalable. NMR quantum processors are examples of expectation …",
        " In this paper, we show how the GHZ paradox can be used to design a computing device that cannot be physically implemented within the context of classical physics, but nonetheless can be within quantum physics, i.e., in a quantum physics laboratory. This example gives an illustration of the many subtleties involved in the quantum control of distributed quantum systems. We also show how the second elementary symmetric Boolean function can be interpreted as a quantification of the nonlocality and indeterminism involved in the GHZ paradox.",
        "Soon after joining the Signal Processing Group of Army Research Laboratory in Adelphi, Maryland (ARL-Adelphi), in 1983, I happened to be walking down one of the many hallways of ARL-Adelphi when somehow I met up with Howard Brandt. After a brief exchange of the usual initial greetings, our conversation turned to a discussion of his research work in relativity. I soon learned that his research was on a generalization of general relativity along the lines of Kaluza-Klein theory. Instead of the usual spacetime metric tensor, he was focusing on a metric tensor that not only involved spacetime, but also included four velocity and Andrei Sakharov’s maximum acceleration hypothesis. This in turn led to a spacetime manifold based on Finslerian Geometry. We decided to continue our conversation in the ARL cafeteria. Over a cup of coffee, he queried me about my research interests. So I in turn talked about my research …",
        "Registering the images from the MODIS system and the OCO-2 satellite is currently being done by classical image registration techniques. One such technique is wavelet transformation. Besides image registration, wavelet transformation is also used in other areas of earth science, for example, processinga and compressing signal variation, etc. In this talk, we investigate the applicability of few quantum wavelet transformation algorithms to perform image registration on the MODIS and OCO-2 data. Most of the known quantum wavelet transformation algorithms are data agnostic. We investigate their applicability in transforming Flexible Representation for Quantum Images. Similarly, we also investigate the applicability of the algorithms in signal variation analysis. We also investigate the transformation of the models into pseudo-boolean functions to implement them on commercially available quantum annealing …"
    ],
    "title": [
        "‪How viable is quantum annealing for solving linear algebra problems?‬",
        "‪Quantum Information Science, Sensing, and Computation XIV‬",
        "‪Quantum approximate optimization for hard problems in linear algebra‬",
        "‪Quantum knots and knotted zeros: part II (Conference Presentation)‬",
        "‪Quantum knots and knotted zeros‬",
        "‪Quantum Information Science, Sensing, and Computation XI‬",
        "‪HOMEWORK 4 COMPUTER SIMULATION OF QUANTUM MEASUREMENT‬",
        "‪Том. 10984. Quantum Information Science, Sensing, and Computation XI.-Сер. Quantum Information Science, Sensing, and Computation XI‬",
        "‪Analyzing the quantum annealing approach for solving linear least squares problems‬",
        "‪Braiding, Majorana fermions, Fibonacci particles and topological quantum computing‬",
        "‪Quantum knots revisited (Conference Presentation)‬",
        "‪A Not So Impossible Machine Based on the GHZ Paradox‬",
        "‪Quantum fourier sampling is guaranteed to fail to compute automorphism groups of easy graphs‬",
        "‪Convergence acceleration of iterative methods for inverting real matrices using Frobenius norm minimization‬",
        "‪A Quantum Annealing Computer Team Addresses Climate Change Predictability‬",
        "‪Braiding with majorana fermions‬",
        "‪Quantum Computing Implemented via Optimal Control: Application to Spin and Pseudospin Systems‬",
        "‪How to build a device that cannot be built‬",
        "‪Howard E. Brandt, Ph. D.: Personal recollections‬",
        "‪An overview of the quantum wavelet transform, focused on earth science applications‬"
    ]
}