{
    "scholar_id": "3aj4AM4AAAAJ",
    "description": [
        "Background/Purpose: Studies have demonstrated existing racial and ethnic disparities in multiple aspects of pediatric oncology. The purpose of this study was to examine how racial and ethnic disparities in mortality among pediatric oncology patients have changed over time. We examined mortality by race and ethnicity over time within the Surveillance, Epidemiology, and End Results (SEER) registry.MethodsPatients < 20 years-old from 1975 – 2016 (n=49,861) were selected for the analysis. Demographic characteristics, cancer diagnosis, and mortality data were extracted. Patients were divided by race and ethnicity: 1) non-Latino White, 2) Black, 3) Latino, and 4) Other Race. The interaction between race/ethnicity and decade was evaluated to better understand how disparities in mortality have changed over time.ResultsUnadjusted mortality among all cancers improved significantly, with 5-year mortality …",
        "ObjectiveVenous thromboembolism (VTE) is a preventable cause of hospitalization-related morbidity and mortality. VTE prevention requires accurate risk-stratification. Federal agencies mandated VTE risk-assessment for all hospital admissions. We have shown that the widely used Caprini (30 risk-factors) and Padua (11 risk-factors) VTE risk-assessment models (RAMs) have limited predictive ability for VTE when used for all general hospital admissions. Here we test whether combining the risk-factors from all 23 available VTE RAMs improves VTE risk-prediction.MethodsWe analyzed data from the first hospitalizations of 1,282,014 surgical and non-surgical patients admitted to 1,298 Veterans Affairs facilities nationwide between January 2016 and December 2021. We used logistic regression to predict VTE within 90 days of admission using risk-factors from all 23 available VTE RAMs. Area under the receiver …",
        "Venous thromboembolism (VTE) is a critical cardiovascular condition, encompassing deep vein thrombosis (DVT) and pulmonary embolism (PE). Accurate and timely identification of VTE is essential for effective medical care. This study builds upon our previous work, which addressed VTE detection using deep learning methods for DVT and a hybrid approach combining deep learning and rule-based classification for PE. Our earlier approaches, while effective, had two major limitations: they were complex and required expert involvement for feature engineering of the rule set. To overcome these challenges, we utilize the Mamba architecture-based classifier. This model achieves remarkable results, with a 97\\% accuracy and F1 score on the DVT dataset and a 98\\% accuracy and F1 score on the PE dataset. In contrast to the previous hybrid method on PE identification, the Mamba classifier eliminates the need for hand-engineered rules, significantly reducing model complexity while maintaining comparable performance. Additionally, we evaluated a lightweight Large Language Model (LLM), Phi-3 Mini, in detecting VTE. While this model delivers competitive results, outperforming the baseline BERT models, it proves to be computationally intensive due to its larger parameter set. Our evaluation shows that the Mamba-based model demonstrates superior performance and efficiency in VTE identification, offering an effective solution to the limitations of previous approaches.",
        "Distributional drift detection is important in medical applications as it helps ensure the accuracy and reliability of models by identifying changes in the underlying data distribution that could affect diagnostic or treatment decisions. However, current methods have limitations in detecting drift; for example, the inclusion of abnormal datasets can lead to unfair comparisons. This paper presents an accurate and sensitive approach to detect distributional drift in CT-scan medical images by leveraging data-sketching and fine-tuning techniques. We developed a robust baseline library model for real-time anomaly detection, allowing for efficient comparison of incoming images and identification of anomalies. Additionally, we fine-tuned a vision transformer pre-trained model to extract relevant features using breast cancer images as an example, significantly enhancing model accuracy to 99.11\\%. Combining with data-sketches and fine-tuning, our feature extraction evaluation demonstrated that cosine similarity scores between similar datasets provide greater improvements, from around 50\\% increased to 100\\%. Finally, the sensitivity evaluation shows that our solutions are highly sensitive to even 1\\% salt-and-pepper and speckle noise, and it is not sensitive to lighting noise (e.g., lighting conditions have no impact on data drift). The proposed methods offer a scalable and reliable solution for maintaining the accuracy of diagnostic models in dynamic clinical environments.",
        " The paper presents a new condition monitoring method for distributed wind systems (DWSs) by combining federated learning with supervisory control and data acquisition (SCADA) data. Federated learning facilitates training of a global model across decentralized SCADA datasets without actual data exchange. This method allows multiple DWSs to collectively contribute to training machine learning models without compromising data privacy. The framework aims to enhance the accuracy and efficiency of condition monitoring by leveraging operational data from SCADA systems. It enables collaborative learning across diverse geographical areas, identifying subtle patterns and anomalies indicative of potential faults or performance issues. The integration of SCADA data provides real-time insights into individual turbine health and performance, allowing for early detection of deviations from normal operating …",
        "With the expansion of space-based observation and exploration initiatives, the necessity for secure and efficient data exchange among interconnected space resources has become more critical. This encompasses sharing information about material characteristics, geographic positioning, and the availability of resources, all of which are integral to cybersecurity measures in the space sector. This paper analyzes these challenges in-depth, focusing on developing a robust framework for secure information exchange. To address these challenges, we explore implementing advanced technologies, such as permissioned blockchain systems. Our approach aims to enhance data communication’s security, efficiency, and reliability in the space industry, making it a valuable contribution to space resource management and cybersecurity. This work is particularly relevant for organizations engaged in collaborative space …",
        "Internet of Things (IoT) services necessitate the storage, transmission, and analysis of diverse data for inference, autonomy, and control. Blockchains, with their inherent properties of decentralization and security, offer efficient database solutions for these devices through consensus-based data sharing. However, it’s essential to recognize that not every blockchain system is suitable for specific IoT applications, and some might be more beneficial when excluded with privacy concerns. For example, public blockchains are not suitable for storing sensitive data. This paper presents a detailed review of three distinct blockchains tailored for enhancing IoT applications. We initially delve into the foundational aspects of three blockchain systems, highlighting their strengths, limitations, and implementation needs. Additionally, we discuss the security issues in different blockchains. Subsequently, we explore the blockchain’s …",
        "This work articulates the development of a sophisticated machine-learning model for the prediction of compressive strength in Carbon Fiber-Reinforced Polymer Confined-Concrete (CFRP-CC) specimens. Despite extensive empirical studies conducted over the last three decades, prevailing predictive models predominantly rooted in linear or nonlinear regression analyses are constrained by their dependency on limited data scopes. Addressing this deficiency, our research delineates the formulation of an innovative Particle Swarm Optimization- Categorical Boosting (PSO-CatBoost) algorithm, underpinned by an expansive database encompassing 916 experimental outcomes from 105 scholarly articles, spanning the period from 1991 to mid-2023. This innovative approach effectively combines the strengths of Particle Swarm Optimization and the CatBoost algorithm. It carefully evaluates various vital factors that …",
        "ObjectivesHospitalization is a known risk factor for venous thromboembolism (VTE), encompassing deep vein thrombosis (DVT) and pulmonary embolism (PE). It affects over half a million individuals annually in the United States. The incidence of several disease states is known to vary by race. In this study, we tested whether rates of VTE differed between Black and White Veterans and evaluated potential reasons for any disparities identified.MethodsWe analyzed information from the first hospital admission of all Veterans nationwide at a Veterans Affairs (VA) facility between 2016 to 2021. We excluded patients with a prior history of VTE within 90 days before admission. Patient-level information was sourced from the VA Informatics and Computing Infrastructure (VINCI) database, including demographics, medical conditions, procedures, and VTE prophylactic measures. A diagnosis of VTE was established based on …",
        "Devices enabled by artificial intelligence (AI) and machine learning (ML) are being introduced for clinical use at an accelerating pace. In a dynamic clinical environment, these devices may encounter conditions different from those they were developed for. The statistical data mismatch between training/initial testing and production is often referred to as data drift. Detecting and quantifying data drift is significant for ensuring that AI model performs as expected in clinical environments. A drift detector signals when a corrective action is needed if the performance changes. In this study, we investigate how a change in the performance of an AI model due to data drift can be detected and quantified using a cumulative sum (CUSUM) control chart. To study the properties of CUSUM, we first simulate different scenarios that change the performance of an AI model. We simulate a sudden change in the mean of the performance …",
        "ObjectiveVenous thromboembolism (VTE) is a preventable complication of hospitalization. Risk-stratification is the cornerstone of prevention. The Caprini and Padua are two of the most commonly used risk-assessment models (RAMs) to quantify VTE risk. Both models perform well in select, high-risk cohorts. Although VTE RAMs were designed for use in all hospital admissions, they are mostly tested in select, high-risk cohorts. We aim to evaluate the two RAMs in a large, unselected cohort of patients.MethodsWe analyzed consecutive first hospital admissions of 1,252,460 unique surgical and non-surgical patients to 1298 Veterans Affairs facilities nationwide between January 2016 and December 2021. Caprini and Padua scores were generated using the Veterans Affairs’ national data repository. We determined the ability of the two RAMs to predict VTE within 90 days of admission. In secondary analyses, we …",
        "Rapid and accurate identification of Venous thromboembolism (VTE), a severe cardiovascular condition including deep vein thrombosis (DVT) and pulmonary embolism (PE), is important for effective treatment. Leveraging Natural Language Processing (NLP) on radiology reports, automated methods have shown promising advancements in identifying VTE events from retrospective data cohorts or aiding clinical experts in identifying VTE events from radiology reports. However, effectively training Deep Learning (DL) and the NLP models is challenging due to limited labeled medical text data, the complexity and heterogeneity of radiology reports, and data imbalance. This study proposes novel method combinations of DL methods, along with data augmentation, adaptive pre-trained NLP model selection, and a clinical expert NLP rule-based classifier, to improve the accuracy of VTE identification in unstructured (free …",
        "BackgroundVenous thromboembolism (pulmonary embolism and deep vein thrombosis) is an important preventable cause of in-hospital death. Prophylaxis with low doses of anticoagulants reduces the incidence of venous thromboembolism but can also cause bleeding. It is, therefore, important to stratify the risk of bleeding for hospitalized patients when considering pharmacologic prophylaxis. The IMPROVE (international medical prevention registry on venous thromboembolism) and Consensus risk assessment models (RAMs) are the two tools available for such patients. Few studies have evaluated their ability to predict bleeding in a large, unselected cohort of patients. We assessed the ability of the IMPROVE and Consensus bleeding RAMs to predict bleeding within 90 days of hospitalization in a comprehensive analysis encompassing all hospitalized patients, regardless of surgical vs nonsurgical status …",
        "Stochastic Gradient Descent (SGD), a widely used optimization algorithm in deep learning, is often limited to converging to local optima due to the non-convex nature of the problem. Leveraging these local optima to improve model performance remains a challenging task. Given the inherent complexity of neural networks, the simple arithmetic averaging of the obtained local optima models in undesirable results. This paper proposes a {\\em soft merging} method that facilitates rapid merging of multiple models, simplifies the merging of specific parts of neural networks, and enhances robustness against malicious models with extreme values. This is achieved by learning gate parameters through a surrogate of the  norm using hard concrete distribution without modifying the model weights of the given local optima models. This merging process not only enhances the model performance by converging to a better local optimum, but also minimizes computational costs, offering an efficient and explicit learning process integrated with stochastic gradient descent. Thorough experiments underscore the effectiveness and superior performance of the merged neural networks.",
        "Federated Learning (FL) has revolutionized how we train deep neural networks by enabling decentralized collaboration while safeguarding sensitive data and improving model performance. However, FL faces two crucial challenges: the diverse nature of data held by individual clients and the vulnerability of the FL system to security breaches. This paper introduces an innovative solution named Estimated Mean Aggregation (EMA) that not only addresses these challenges but also provides a fundamental reference point as a  for advanced aggregation techniques in FL systems. EMA's significance lies in its dual role: enhancing model security by effectively handling malicious outliers through trimmed means and uncovering data heterogeneity to ensure that trained models are adaptable across various client datasets. Through a wealth of experiments, EMA consistently demonstrates high accuracy and area under the curve (AUC) compared to alternative methods, establishing itself as a robust baseline for evaluating the effectiveness and security of FL aggregation methods. EMA's contributions thus offer a crucial step forward in advancing the efficiency, security, and versatility of decentralized deep learning in the context of FL.",
        "We present a novel algorithm that is able to generate deep synthetic COVID-19 pneumonia CT scan slices using a very small sample of positive training images in tandem with a larger number of normal images. This generative algorithm produces images of sufficient accuracy to enable a DNN classifier to achieve high classification accuracy using as few as 10 positive training slices (from 10 positive cases), which to the best of our knowledge is one order of magnitude fewer than the next closest published work at the time of writing. Deep learning with extremely small positive training volumes is a very difficult problem and has been an important topic during the COVID-19 pandemic, because for quite some time it was difficult to obtain large volumes of COVID-19-positive images for training. Algorithms that can learn to screen for diseases using few examples are an important area of research. Furthermore …",
        "G06Q—INFORMATION AND COMMUNICATION TECHNOLOGY [ICT] SPECIALLY ADAPTED FOR ADMINISTRATIVE, COMMERCIAL, FINANCIAL, MANAGERIAL OR SUPERVISORY PURPOSES; SYSTEMS OR METHODS SPECIALLY ADAPTED FOR ADMINISTRATIVE, COMMERCIAL, FINANCIAL, MANAGERIAL OR SUPERVISORY PURPOSES, NOT OTHERWISE PROVIDED FOR",
        "ObjectiveMore than 100,000 patients are hospitalized in the United States each day. Half of all venous thromboembolism (VTE) events occur in hospitalized patients. Hospital-related pulmonary embolism was declared the leading preventable cause of in-hospital death by the US Surgeon General, Centers for Disease Control and Prevention, and Centers for Medicare and Medicaid Services. Risk-stratification and targeted-prophylaxis are keys to prevention. Pharmacoprophylaxis is highly effective, though with an increased risk of bleeding. Therefore, decisions for VTE prophylaxis must balance the predicted risk of VTE against the predicted risk of bleeding in individual patients. While there are several risk assessment models (RAMs) to predict the risk of VTE, there are only two RAMs proposed to predict bleeding from pharmacoprophylaxis and neither has been validated in a large, unselected cohort of general …",
        "Natural Language Processing (NLP) has gained prominence in diagnostic radiology, offering a promising tool for improving breast imaging triage, diagnosis, lesion characterization, and treatment management in breast cancer and other breast diseases. This review provides a comprehensive overview of recent advances in NLP for breast imaging, covering the main techniques and applications in this field. Specifically, we discuss various NLP methods used to extract relevant information from clinical notes, radiology reports, and pathology reports and their potential impact on the accuracy and efficiency of breast imaging. In addition, we reviewed the state-of-the-art in NLP-based decision support systems for breast imaging, highlighting the challenges and opportunities of NLP applications for breast imaging in the future. Overall, this review underscores the potential of NLP in enhancing breast imaging care and offers insights for clinicians and researchers interested in this exciting and rapidly evolving field.",
        "BackgroundVenous thromboembolism (VTE) is a preventable complication of hospitalization. Risk-stratification is the cornerstone of prevention. The Caprini and Padua are the most commonly used risk-assessment models to quantify VTE risk. Both models perform well in select, high-risk cohorts. While VTE risk-stratification is recommended for all hospital admissions, few studies have evaluated the models in a large, unselected cohort of patients.MethodsWe analyzed consecutive first hospital admissions of 1,252,460 unique surgical and non-surgical patients to 1,298 VA facilities nationwide between January 2016 and December 2021. Caprini and Padua scores were generated using the VA’s national data repository. We first assessed the ability of the two RAMs to predict VTE within 90 days of admission. In secondary analyses, we evaluated prediction at 30 and 60 days, in surgical versus non-surgical patients, after excluding patients with upper extremity DVT, in patients hospitalized ≥72 hours, after including all-cause mortality in the composite outcome, and after accounting for prophylaxis in the predictive model. We used area under the receiver-operating characteristic curves (AUC) as the metric of prediction.ResultsA total of 330,388 (26.4%) surgical and 922,072 (73.6%) non-surgical consecutively hospitalized patients (total n=1,252,460) were analyzed. Caprini scores ranged from 0-28 (median, interquartile range: 4, 3-6); Padua scores ranged from 0-13 (1, 1-3). The RAMs showed good calibration and higher scores were associated with higher VTE rates. VTE developed in 35,557 patients (2.8%) within 90 days of admission. The ability …"
    ],
    "title": [
        "‪Racial and Ethnic Survival Disparities in Pediatric Oncology over Time: An Analysis of the SEER Registry‬",
        "‪A composite risk assessment model for venous thromboembolism‬",
        "‪Improving VTE Identification through Language Models from Radiology Reports: A Comparative Study of Mamba, Phi-3 Mini, and BERT‬",
        "‪Efficient Data-Sketches and Fine-Tuning for Early Detection of Distributional Drift in Medical Imaging‬",
        "‪Decentralized Condition Monitoring for Distributed Wind Systems: A Federated Learning-Based Approach to Enhance SCADA Data Privacy‬",
        "‪Blockchain-Based Fine-Grained Access Control for Space Resource Sharing and Management‬",
        "‪Blockchains for Internet of Things: Fundamentals, Applications, and Challenges‬",
        "‪Data-driven PSO-CatBoost machine learning model to predict the compressive strength of CFRP-confined circular concrete specimens‬",
        "‪Clinical Factors Impacting Differences in Rates of Venous Thromboembolism Black and White Veterans‬",
        "‪Quantifying input data drift in medical machine learning models by detecting change-points in time-series data‬",
        "‪Ability of Caprini and Padua risk-assessment models to predict venous thromboembolism in a nationwide Veterans Affairs study‬",
        "‪Improving VTE Identification through Adaptive NLP Model Selection and Clinical Expert Rule-based Classifier from Radiology Reports‬",
        "‪Prediction of bleeding in patients being considered for venous thromboembolism prophylaxis‬",
        "‪Soft Merging: A Flexible and Robust Soft Model Merging Approach for Enhanced Neural Network Performance‬",
        "‪Enabling Quartile-based Estimated-Mean Gradient Aggregation As Baseline for Federated Image Classifications‬",
        "‪CCS-GAN: COVID-19 CT Scan Generation and Classification with Very Few Positive Training Images‬",
        "‪Automating Cloud Services Lifecycle Through Semantic Technologies‬",
        "‪Assessment of Bleeding Risk in Patients Being Considered for VTE Pharmacoprophylaxis in a Large Nationwide Cohort‬",
        "‪Natural language processing for breast imaging: a systematic review‬",
        "‪Ability of Caprini and Padua Risk-Assessment Models to Predict Venous Thromboembolism in a Nationwide Study‬"
    ]
}