{
    "scholar_id": "_VdWyEcAAAAJ",
    "description": [
        "The level of maturity attained by virtual reality (VR) and augmented and mixed reality (AR+ MR) technologies allowed an expansion in the use of extended reality (XR) technology in medical applications. This motivated the XR for Healthcare and Well-being workshops that we co-organized in IEEE VR 2022 and 2023. In the sequence of the workshops, this Special Issue of the journal Computers & Graphics gathers consolidated contributions of recent research and discusses challenges on XR for health. It is the result of both significantly extended and revised workshop papers and brand-new contributions. We received a total of thirteen submissions. In line with the journal standards, all seven accepted papers received three independent reviews.The spectrum of applications for XR in healthcare is vast. Still, this special issue is representative of the spectrum in that it includes contributions in the three major levels of …",
        "The present disclosure provides an augmented reality, head mounted display, based collaborative system designed for remote instruction over live mobile views during physical tasks. The collaborative system includes a world-stabilized area where remote helpers can dynamically place a pointer and annotations on the physical environment, and an indirect input mechanism with an absolute position to the world-stabilized area. Examples provided within show how the described system worked for participants engaged in a remote instructional task and how they supported effective and efficient communication.",
        "Systems aimed at stress awareness and reflection training by those in high-stress work environments may aid the development of stress management skills to alleviate and manage future workplace traumas. However, there is a notable gap in research addressing the insights and awareness individuals gain about their stress when they engage in team-based reflection on team-based data. To this end, we designed the Stress Reflection system as a proof-of-concept educational tool to foster and promote stress reflection and awareness by presenting trainees with both internal and external behavioral information, i.e., electrodermal activity (EDA) and corresponding situated simulation videos. We conducted a study within paramedic simulation training to qualitatively assess the insights gained and the depth of reflection achieved by trainees while interacting with each other and their data. Our findings revealed that …",
        " With the increasing usage of mental health applications (MHAs), there is growing concern regarding their data privacy practices. Analyzing 437 user reviews from 83 apps, we outline users’ predominant privacy and security concerns with currently available apps. We then compare those concerns to criteria from two prominent app evaluation websites – Privacy Not Included and One Mind PsyberGuide. Our findings show that MHA users have myriad data privacy and security concerns including a user’s control over their own data, but these concerns do not often overlap with those of experts from evaluation websites who focus more on issues such as required password strength. We highlight this disconnect and propose solutions in how the mental health care ecosystem can provide better guidance to MHA users and experts from the fields of privacy and security and mental health technology in choosing and …",
        "This ISIR lab stand showcases some of the interactive systems developed in the past 5 years in relation to HCI and Health. Two types of medical applications are showcased: surgical procedures (e.g., assistance robots, videos in support of learning) and people suffering from a motor deficit (e.g., motorized prostheses, intelligent walkers, kinesthetic feedback for visually impaired assistance).",
        "En téléexpertise chirurgicale, un mentor assiste un chirurgien novice à distance. Les systèmes de téléexpertise actuels permettent de coopérer autour d’images mais seul le novice peut contrôler l’endoscope qui filme le champ opératoire. Cette asymétrie impacte la communication. Notre objectif est de comprendre comment concevoir un système permettant le contrôle de l’endoscope à distance pour la téléexpertise chirurgicale. Nous avons réalisé des workshops avec des chirurgiens pour comprendre quelles situations bénéficient du contrôle distant de l’endoscope et comment un mentor pourrait interagir avec un bras porte-endoscope robotique. Nos résultats montrent que le contrôle distant permet au mentor de construire des vues dans de champs opératoires complexes et permet de soulager la charge physique et cognitive du chirurgien locale. Pour interagir avec l’endoscope, les participants ont suggéré des mécanismes simples et accessibles, comme un écran tactile ou un(e) clavier/souris d’ordinateur. Ces éléments participent à la conception d’une future étude où nous comparons le contrôle distant de l’endoscope à son contrôle local dans la réalisation de tâches de téléexpertise chirurgicale.",
        "Older adults face unique risks in trying to secure their online activities. They are not only the frequent targets of scams and fraud; they are the targets of a barrage of cybersafety communiqués whose impact is unclear. AARP, the United States advocacy group focusing on issues facing older adults over the age of 50, is among those educators whose strategies remain underexplored, yet their reach makes it imperative that we understand what they are saying, to whom, and to what effect. Drawing on an analysis of AARP publications about cybersafety and privacy, we sought to better understand their discourse on the topic. We report on findings that AARP's language may have the effect of portraying bad actors (\"fraudsters\") as individuals, rather than enterprises, which at the target end, personalizes interactions, placing too much onus on individual users to assess and deflect threats. AARP's positioning of, and …",
        " Rehabilitation is vital for individuals to build compensatory strategies for, and recover from, physical and cognitive impairments. Unfortunately, the COVID-19 pandemic disrupted patients from receiving traditional co-located rehabilitation. Thus, a monumental transition occurred requiring Physical Medicine & Rehabilitation (PM&R) clinicians and patients to transition to telerehabilitation. Our interdisciplinary research team of technologists and clinicians performed a case study of PM&R clinicians (physicians, therapists, and psychologists) deploying and transitioning their workflows to telerehabilitation. We found that after clinicians’ constant reflection and workflow changes, they successfully adapted most co-located rehabilitation practices to telerehabilitation. Furthermore, because of their adaptation experience, they all alluded that the future workflows of PM&R care involves continuing to leverage telerehabilitation …",
        " This workshop focuses on remote care and wellbeing as we transition into a world increasingly adopting hybrid lifestyles and modes of operation. Care and care work have predominantly been researched in traditionally in-person interpersonal contexts. The burgeoning uptake and incorporation of information and communication technologies towards remote care have created new workflows and resulted in emerging questions around the definitions and scope of care practice in response. The confluence of technological, sociocultural, geopolitical, and climatic realities of the current day brings into focus the need to unpack the idea of “care,” and the role that HCI researchers could play in creating equitable futures of remote and hybrid care. This workshop will focus on questions such as “What does holistic wellbeing look like in the era of hybrid caregiving?” and “How does environmental care factor into our …",
        " Although Augmented Reality (AR) has been touted as the future of surgery, its contribution to distributed collaboration such as in surgical teleconsulting has not been articulated. We propose AR-Head Mounted Displays (AR-HMD) to tackle two previously-identified challenges: operating surgeons needing to view and interact with imaging systems that reside away from the operative field, and, their lack of gesturing tools to point and annotate on the shared images and physical environment. We report on a controlled lab experiment where 12 expert gynecology surgeons perform a tumor localisation task guided by a remote radiologist (confederate) via an AR-HMD. We find that bringing the shared images to the place of work reduces the need for clarifications and provides opportunistic access to information when required, and, that pointing and annotating provides opportunities to further support verbal instruction in …",
        "Digital technological advancements have been a driving force in the continued evolution of the modern workplace. One notable change is an increased reliance on informal chatting tools in support of both distributed and co-located work. However, while researchers have recognized the growing prominence of these tools in work, little is known about how to best support youth who have grown up with access to interconnected technologies in acquiring and practicing the relevant skills needed to effectively communicate using these tools. In this study, we studied youth's utilization of Slack, a popular workplace chatting tool, in an after-school 3D print shop. Using in-depth semi-structured interviews, we uncovered the factors that supported or hindered youth employees' Slack use in a technical work context. This work offers implications for how to design youth workplace communication and coordination protocols that …",
        "MARCH 2023| VOL. 66| NO. 3| COMMUNICATIONS OF THE ACM 7 there are three main reasons why information might be disclosed. The first is a matter of procedural equity. Disclosures to respondents, claimants, witnesses, and victims are important to allow individuals to decide how to best navigate our processes given their individual circumstances. The second is a matter of harm prevention. Certainly, limited disclosure of information is necessary to implement sanctions. For example, an editor must learn whether an individual has been barred from publishing in ACM journals. More extensive disclosure of information allows individuals and communities to take steps to reduce the chances of some forms of harm. Additional disclosure might include disclosure of information to other professional societies or even public disclosure by ACM. The third type of disclosure is as part of a sanction. For example, the papers …",
        "The introduction of Augmented Reality (AR) Head Mounted Displays (HMDs) in collaboration between remote and local workers, introduces new challenges given that camera views are now mobile. We introduce HoloMentor, an AR HMD-based collaborative system designed for remote instruction over live mobile views during physical tasks. Through Actionport, we provide a world-stabilized area where remote helpers can dynamically place a pointer and annotations on the physical environment. Through Actionpad, we provide an indirect input mechanism with an absolute position to the Actionport. We show how these innovations worked for participants engaged in a remote instructional task and how they supported effective and efficient communication. Finally, we provide the next steps for addressing AR on mobile views for remote instruction.",
        "We studied the impact of introducing first-year computer science (CS) students to ethical thinking about the social justice impacts of data collection, tracking, bias, internet privacy, and competitive “real world” system design and critique activities. While basic content was consistent for all, one group was involved throughout the course in peer discussions designed to foster greater engagement, with the anticipation that this would enable students to reach new levels of sensitivity through peer-to-peer interaction. This article reports on our observation of this design, interview, and project data collected throughout the course as well interviews conducted eight months later to learn about how students were retaining and applying what they learned. We found that students are sensitive to the technology-related risks and vulnerabilities encountered by individuals based on race, gender, and, to some extent, age, but they …",
        "The Executive Committee (EC) of ACM Special Interest Group on Computer-Human Interaction (SIGCHI) organized a series of ten equity talks from March 2021 to August 2021. These were hour-long recorded virtual roundtable sessions, for which we solicited participation from the SIGCHI community on concerns and questions relating to equity, in a number of areas relevant to SIGCHI. Many concerns were listed, some were repeated across topics, and the EC followed due diligence when it came to presenting this information to the community. What comes next?",
        " Advances in computing technology, changing policies, and slow crises are rapidly changing the way we work. Human-computer interaction (HCI) is a critical aspect of these trends, to understand how workers contend with emerging technologies and how design might support workers and their values and aspirations amidst technological change. This SIG invites HCI researchers across diverse domains to reflect on the range of approaches to future of work research, recognize connections and gaps, and consider how HCI can support workers and their wellbeing in the future.",
        " In this special interest group (SIG), we follow up on previous conversations around hybrid models for conferences, conducted in open sessions by the ACM Special Interest Group on Computer-Human Interaction (SIGCHI) Executive Committee (EC). The COVID-19 pandemic led to a sudden shift to virtual conferences; as we start to go back to in-person events, it is important to reflect on the types of events we desire, and design these accordingly. With this SIG, we hope to share experiences from previous conferences (successful or not) and discuss potential solutions to pending issues. This SIG will be led by VP at Large Adriana S. Vivacqua, with the participation of other EC members.",
        " This Special Interest Group (SIG) will collaboratively explore potential futures of the ACM Special Interest Group on Computer-Human Interaction (SIGCHI) on the organization’s 40th anniversary. Taking stock of where we are now, forty years after inception, our goal will be to engage members of the SIGCHI community in a participatory approach towards imagining how SIGCHI might evolve, and how it can ensure that the elements it values most, such as connection, inclusion, and equity, among others, can be nurtured as the field evolves, and technologies come and go.",
        " The Executive Committee (EC) of ACM Special Interest Group on Computer-Human Interaction (SIGCHI) organized a series of ten equity talks from March 2021 to August 2021. These were hour-long recorded virtual roundtable sessions, for which we solicited participation from the SIGCHI community on concerns and questions relating to equity, in a number of areas relevant to SIGCHI. Many concerns were listed, some were repeated across topics, and the EC followed due diligence when it came to presenting this information to the community. What comes next?",
        "In the following position paper we introduce the use of AR HMD for remote instruction in healthcare and present the challenges our team has faced in achieving this application in two contexts: surgical telementoring and paramedic teleconsulting. After the presentation of how these challenges come to be and indications on how to address them, we argue that those who wish to pursue this area of research must be grounded in best practices from the field of CSCW integrated with technical innovations in AR interaction development. This is a truly interdisciplinary research and development area that has many challenging topics to tackle through collaborative efforts."
    ],
    "title": [
        "‪Foreword to the special section‬",
        "‪Augmented reality (ar) collaborative system designed for remote instruction over live mobile views‬",
        "‪Enhancing Stress Understanding Through Team Reflection: Technology-Driven Insights in High-Stress Training Scenarios‬",
        "‪“That’s Kind of Sus (picious)”: The Comprehensiveness of Mental Health Application Users’ Privacy and Security Concerns‬",
        "‪Interactive Systems for Healthcare at ISIR‬",
        "‪Contrôler l'endoscope à distance en situation de téléexpertise chirurgicale‬",
        "‪'Don't Fall for This': Communications about Cybersafety from the AARP‬",
        "‪Adapting to Telerehabilitation Care During the COVID-19 Pandemic: The Future is Hybrid‬",
        "‪The Future of Hybrid Care and Wellbeing in HCI‬",
        "‪Supporting Collaborative Discussions In Surgical Teleconsulting Through Augmented Reality Head Mounted Displays‬",
        "‪Youths' Usage of an Informal Chatting Tool in an After-school 3D Print Shop‬",
        "‪After the Complaint: What Should ACM Disclose?‬",
        "‪HoloMentor: Enabling Remote Instruction through Augmented Reality Mobile Views‬",
        "‪Responsible Computing: A Longitudinal Study of a Peer-led Ethics Learning Framework‬",
        "‪Equity Talks@ SIGCHI‬",
        "‪Human-Computer Interaction and the Future of Work‬",
        "‪Exploring Hybrid: A (hybrid) SIG to discuss hybrid conferences‬",
        "‪SIGCHI Turns 40: Honoring the Past, Celebrating the Present, and Envisioning the Next 40‬",
        "‪Equity Talks@ SIGCHI‬",
        "‪AR HMD for Remote Instruction in Healthcare‬"
    ]
}