{
    "scholar_id": "A0_KDngAAAAJ",
    "description": [
        "Over the past 30 years, the enrollment of students of color in higher education has increased significantly because of various efforts taken nationwide for promoting diversity and equity. Yet, graduation rates for these students have remained stagnant. This research explores the multifaceted challenges encountered by underrepresented students in STEM disciplines, focusing on Black and Latinx communities. The study, involving students predominantly from an East Coast R1 research university, employs a mixed-methods approach, utilizing interviews, surveys, and focus groups to examine the student of color experience within the contexts of sense of belonging, role models, and Diversity, Equity, and Inclusion (DEI) initiatives, in addition to general challenges. Thematic analysis facilitated comprehensive data interpretation. Our findings underscore the pressure to persist despite doubts, the significance of in-group …",
        "Developmental Delays and Disabilities (DDDs) refer to conditions where children are slower or unable to reach developmental milestones compared to typically developing children. This can cause significant stress for parents, leading to social isolation and loneliness. Online videos, particularly those on YouTube, aim to support these parents and caregivers by offering guidance and assistance. Studies show that parents of children with DDDs create videos on YouTube to enhance authenticity and build connections. However, there is limited knowledge about how other parents with children with DDDs perceive and are impacted by these videos. Our study used a mixed-method approach to annotate and analyze more than fifteen hundred YouTube videos on children's DDDs. We found that these videos provide crucial informational content and offer mental and emotional support through shared personal experiences. Comments analysis revealed a strong sense of community among YouTubers and viewers. Interviews with parents of children with DDDs showed that they find these videos relatable and essential for managing their children's diagnosis and treatments. We concluded by discussing platform-centric design implications for supporting parents and other caregivers of children with DDDs.",
        "Large Language Models (LLMs) are trained on inherently biased data. Previous works on debiasing models rely on benchmark datasets to measure model performance. However, these datasets suffer from several pitfalls due to the extremely subjective understanding of bias, highlighting a critical need for contextual exploration. We propose understanding the context of user inputs with consideration of the diverse situations in which input statements are possible. This approach would allow for frameworks that foster bias awareness rather than guardrails that hurt user engagement. Our contribution is twofold: (i) we create a dataset of 2287 stereotyped statements augmented with points for adding context; (ii) we develop the Context-Oriented Bias Indicator and Assessment Score (COBIAS) to assess statements' contextual reliability in measuring bias. Our metric is a significant predictor of the contextual reliability of bias-benchmark datasets (. COBIAS can be used to create reliable datasets, resulting in an improvement in bias mitigation works.",
        "India produces a large amount of shrimp every year and exports them globally. Yet, concerns have been raised about shrimps produced in India not qualifying the global safety standards. In this paper, we took an ethnographic approach to understand the traditional farming practices followed by shrimp farmers in India. We interviewed 29 shrimp farmers from Andhra Pradesh in India for eight months. We learned that most experienced and large-scale shrimp farmers in India prefer to follow traditional practices in their shrimp farms. They prefer to adopt technology-driven solutions in their farming only if absolutely needed. However, we observed that young, small-scale farmers are more open to trying new technologies in their farming. We discussed several areas where initiatives can be taken to encourage more Indian shrimp farmers to adopt new technology-driven solutions in their farming.",
        "The COVID-19 pandemic has affected more than 301 million people worldwide so far. Many communities (such as minority communities) suffered disproportionately more difficulties throughout the pandemic. In this paper, we would like to focus on one such community: COVID-19 long-haulers community. Long-hauler community consists of people affected by Coronavirus, but their symptoms do not cure in a couple of weeks; instead, they experience lingering symptoms for months. The concerns of this community were initially ignored by health care providers primarily because of limited information. In this paper, we have analyzed the social media discussion of a private Facebook group dedicated to the long-hauler community. In addition, we interviewed the community members to investigate their motivations for joining the group and how the group has impacted their lives as long-hauler patients. Our analyses …",
        "Legal crowdfunding is an emerging domain where lawyers and individuals raise funds to fight legal actions. To study how prospective donors can verify the credibility of legal campaigns, we analyzed the conversations surrounding these campaigns on Facebook. We discovered three primary themes associated with the perceptions of the contributors of legal campaigns: supporters posting admiring and appreciative comments, supporters posting critical and disapproving comments, and opponents posting critical and disapproving comments. We observed that while supporters criticized campaigns' opponents, biased media, and dishonest authorities, opponents criticized campaign owners, campaigns' objectives and opaque logistics. To understand the impact of these perspectives on donors, we followed up with an online survey study where we presented a legal campaign with its corresponding social media …",
        "Storytelling, and the delivery of societal narratives, enable human beings to communicate, connect, and understand one another and the world around them. Narratives can be defined as spoken, visual, or written accounts of interconnected events and actors, generally evolving through some notion of time. Today, information is typically conveyed over online communication mediums, such as social media and blogging websites. Consequently, the act of narrative delivery itself has shifted from simply imparting information through self-contained structures such as books, to more fragmented structures, such as social media websites, where evolving story events are constructed over multiple online sources. Ubiquitous online conversation can manifest into sophisticated narratives that have the potential to influence wide-spread user interpretations of cultural sentiments, attitudes, values, as well as geopolitical events …",
        " In recent years, political crowdfunding campaigns have emerged through which politicians raise money to fund their election campaigns. Divisive issues discussed in these campaigns may not only motivate donations but also could have a broader priming effect on people’s social opinions. In the U.S., more than one-third of the population with moderate opinions show a tendency to swing their opinion based on recent and more accessible events. In this paper, we ask: can such campaigns further prime people’s responses to partisan topics, even when we discuss those topics in a non-political context? To answer this question, we analyzed the influence of exposure to a political candidate’s crowdfunding campaign on responses to a subsequently seen, unrelated scientific topic that is not inherently political but is seen as partisan in the U.S. (climate change). We found that exposure to an attitude-inconsistent …",
        "Markov Logic Networks (MLNs) represent relational knowledge using a combination of first-order logic and probabilistic models. In this paper, we develop an approach to explain the results of probabilistic inference in MLNs. Unlike approaches such as LIME and SHAP that explain black-box classifiers, explaining M LN inference is harder since the data is interconnected. We develop an explanation framework that computes importance weights for MLN formulas based on their influence on the marginal likelihood. However, it turns out that computing these importance weights exactly is a hard problem and even approximate sampling methods are unreliable when the MLN is large resulting in non-interpretable explanations. Therefore, we develop an approach where we reduce the large MLN into simpler coalitions of formulas that approximately preserve relational dependencies and generate explanations based on …",
        "Every day, people interact with various social platforms. Diverse forms of social platforms opened up a plethora of data to study information dissemination and understanding crowd behavior in finer details. However, there is a flip side to this. People do not only get benefited by using social platforms; rather these platforms can also be exploited for spreading organized disinformation and unintended misinformation to a large audience. These social platforms, with access to the history of users' socio-political biases, can emerge as tools to shape mass opinion. Such a broad spectrum of diversity raises questions about how we can identify the promises and perils of social platforms and how we can design user-centric tools around them. Efficient identification of such promises and perils of social computing systems will require a convergence of social science, behavioral psychology, and persuasion theory with computing. My research shows ways to this convergence. In my dissertation, I have taken a theoretical approach to explain the existing structures of social platforms. My findings helped me to develop interactive tools for masses leveraging socio-political and psychological cues from the crowd. My work is empirical in nature, for which I drew intuitions from theories in social science and used a combination of qualitative and quantitative data analysis techniques to extract insights on users' behavior. My research leads to practical systems for human-centric applications and to this end, I chose a specific type of social platform: crowdfunding platform. Specifically, this dissertation makes three contributions. First, it investigates how different forms of …",
        "People encounter video ads every day when they access online content. While ads can be annoying or greeted with resistance, they can also be seen as informative and enjoyable. We asked the question, what might make an ad more enjoyable? And, do people with different personality traits prefer to watch different ads --- could it be possible to better match ads and people? To answer these questions, we conducted an online study where we asked people to watch video ads of different emotional sentiments. We also measured their personality traits through an online survey. We found that the sentiment of people's preferred video ads varies significantly based on their personality traits. Additionally, we investigated when these ads are accompanied by content, how the emotional state induced by accompanying content affects people's ad preferences. We found that there was a complex relationship between …",
        " Explaining the results of Machine learning algorithms is crucial given the rapid growth and potential applicability of these methods in critical domains including healthcare, defense, autonomous driving, etc. In this paper, we address this problem in the context of Markov Logic Networks (MLNs) which are highly expressive statistical relational models that combine first-order logic with probabilistic graphical models. MLNs in general are known to be interpretable models, i.e., MLNs can be understood more easily by humans as compared to models learned by approaches such as deep learning. However, at the same time, it is not straightforward to obtain human-understandable explanations specific to an observed inference result (e.g. marginal probability estimate). This is because, the MLN provides a lifted interpretation, one that generalizes to all possible worlds/instantiations, which are not query/evidence specific …",
        "Videos are essential for successful crowdfunding campaigns. However, without knowledge of the underlying persuasion factors, novice entrepreneurs may find it difficult to optimize their videos for success. This paper presents VidLyz, a novel assistive tool that allows users to explore the implications of audience-engagement persuasion factors in the context of campaign videos through contrasting examples, crowd-sourced subjective ratings, and feedback on engagement factors. VidLyz promotes active thinking about the impact of audience persuasion factors in making an effective campaign video by guiding novice entrepreneurs in planning materials of their videos on their own, with consideration of the product category, the target audience, and audience-product interactions. To evaluate our system, we collected subjective ratings and feedback on persuasion factors for 140 Kickstarter campaign videos from 2100 …",
        "Spatial knowledge about the environment often helps people accomplish their navigation and wayfinding tasks more efficiently. Off-the-shelf mobile navigation applications often focus on guiding people to go between two locations, ignoring the importance of learning spatial knowledge. Drawing on theories and findings from the area of learning spatial knowledge, we investigated how the background reference frames (RF) and navigational cues can be combined in navigation applications to help people acquire better spatial (route and survey) knowledge. We conducted two user studies, where participants used our custom-designed applications to navigate in an indoor location. We found that having more navigational cues in a navigation application does not always assist users in acquiring better spatial knowledge; rather, these cues can be distracting in some specific setups. Users can acquire better spatial …",
        "Spatial user interfaces that help people navigate often focus on turn-by-turn instructions, ignoring how they may help incidental learning of spatial knowledge. Drawing on theories and findings from the area of spatial cognition, the current paper aims to understand how turn-by-turn instructions and relative location updates can help incidental learning of spatial (route and survey) knowledge. A user study was conducted as people used map-based and video-based spatial interfaces to navigate to different locations in an indoor environment using turn-by-turn directions and relative location updates. Consistent with existing literature, we found that providing only turn-by-turn directions was in general not effective for helping people to acquire spatial knowledge as relative location updates, but map-based interfaces were in general better for incidental learning of survey knowledge while video-based interfaces were …",
        "Donation-based crowdfunding platforms have an increasing number of campaigns on socially stigmatized topics. These platforms' widespread online reachability and the large flow of monetary donations have the potential to shape individuals' opinions by influencing their perceptions. However, little research has been done to investigate whether these campaigns impact individuals' opinions and how. We conducted an experiment to explore how an attitude-inconsistent campaign on fairness and equality for LGBTIQ people influenced participants' opinion on this topic. Although all the participants changed their perceived opinions after reading the support for the campaigns, participants opposing equality were less inclined to change their attitude than participants supporting equality. To examine this difference further, we conducted another experiment where participants were exposed to both attitude-consistent …",
        "Research in the last two decades has demonstrated the strong connection between visuospatial skills and engineering education (Barke & Engida, 2001; Board, 2010; Carter et al., 1987; Casey, 1992; Gimmestad, 1990; Lubinski, 2010; Metz & Sorby, 2013; Newcombe, 2010; Priby & Bodner, 1987; Small & Morton, 1983; Sorby, 2009; 2011; Uttal and Cohen, 2012; Veurink, and Hamlin, 2011; Veurink, & Sorby, 2012). Students who have good visuospatial skills are found to be better equipped to learn, reason, and solve complex engineering problems (Veurink, & Sorby, 2012). Recent attempts to introduce workshops and seminars for engineering freshmen students across the US has demonstrated success in improving their learning and increasing the retention rates (National Research Council, 2006; National Science Foundation, 2013), especially for students in minority groups such as female engineering students.Because of their importance, researchers and instructors have put a lot of effort into evaluating and training engineering students’ visuospatial skills (Maeda, & Yoon, 2011; Maeda, & Yoon, 2013; Sorby, 2009). However, previous methods often rely on traditional paper-based questions and face-to-face visuospatial training workshops, which are costly and timeconsuming, especially for large classes. Given the nationwide trend in the increasing number of university engineering students, we have designed and evaluated an online platform to provide a low-cost, scalable solution to effectively evaluate and train visuospatial skills (Loyalka, et al., 2014). In addition, the online platform can facilitate the analysis of behavioral and error patterns …",
        "Understanding the factors that persuade backers to donate to research projects has become increasingly important with the rising popularity of scientific crowdfunding. Although there are many similarities between enterprise and scientific crowdfunding, some factors differentiate these two forms of crowdfunding. One such factor is the use of endorsements. The endorsement helps backers gain trust based on expert opinions about the competency of the researchers and the usefulness of the projects. We analyzed 810 endorsements from scientific campaigns posted on Experiment.com and derived a taxonomy of topics discussed in the endorsements. A regression analysis revealed that when endorsers explained the skills of the campaign owners, the probability of success of the campaign improved; on the contrary, when endorsers reiterated the goal of the project, the campaign was less likely to succeed. We …",
        "To successfully raise money using crowdfunding, it is important for a campaign to communicate ideas or products effectively to the potential backers. One of the lesser explored but powerful components of a crowdfunding campaign is the campaign video. To better understand how videos affect campaign outcomes, we analyzed videos from 210 Kickstarter campaigns across three different project categories. In a mixed-methods study, we asked 3150 Amazon Mechanical Turk (MTurk) workers to evaluate the campaign videos. We found six recurrent factors from a qualitative analysis as well as quantitative analysis. Analysis revealed product related and video related factors that were predictive of the final outcome of campaigns over and above the static project representation features identified in previous studies. Both the qualitative and quantitative analysis showed that videos influenced perception differently for …",
        "The advancement of mobile technology inspired research communities to achieve centimeter level accuracy in indoor positioning systems [2]. But to get the best out of it, we need assisting navigation applications that will not only help us to reach the destination quickly but will also make us familiar with the surroundings. To address this concern, we propose a two stage approach which can help pedestrians navigate in an indoor location and simultaneously enhance their spatial awareness. In the first stage, we will conduct a behavioral user study to identify the prominent behavioral patterns during different navigational challenges. Once the behavioral state model is prepared, we need to analyze the sensor data in multiple dimensions and build a dynamic sensor state model. This model will enable us to map the behavioral state model to the sensor states and draw a direct one to one relation between the two."
    ],
    "title": [
        "‪\" You Don't See Too Many of Me, Too Many of Us, in That Area\": Exploring the Challenges and Opportunities of Promoting STEM Education Among Black and Latinx Students‬",
        "‪Exploring the Influence of Online Videos on Parents or Caregivers of Children with Developmental Delays‬",
        "‪COBIAS: Contextual Reliability in Bias Assessment‬",
        "‪Why should I bother to break the norm?: Exploring the Prospects of Adopting Technology-Driven Solutions by Indian Shrimp Farmers‬",
        "‪Fishing for Validation: Understanding Promises and Challenges of a Private Social Media Group for COVID-19 Long-Hauler Patients‬",
        "‪It Is All About Criticism: Understanding the Effect of Social Media Discourse on Legal Crowdfunding Campaigns‬",
        "‪Computational understanding of narratives: A survey‬",
        "‪Re-imagining the Power of Priming and Framing Effects in the Context of Political Crowdfunding Campaigns‬",
        "‪Interpretable Explanations for Probabilistic Inference in Markov Logic‬",
        "‪A persuasive approach to designing interactive tools around the promises and perils of social platforms‬",
        "‪Recommendation for video advertisements based on personality traits and companion content‬",
        "‪Fine-grained explanations using markov logic‬",
        "‪Vidlyz: An interactive approach to assist novice entrepreneurs in making persuasive campaign videos‬",
        "‪Understanding the Effect of the Combination of Navigation Tools in Learning Spatial Knowledge‬",
        "‪Getting there and beyond: Incidental learning of spatial knowledge with turn-by-turn directions and location updates in navigation interfaces‬",
        "‪Effects of socially stigmatized crowdfunding campaigns in shaping opinions‬",
        "‪A scalable online platform for evaluating and training visuospatial skills of engineering students‬",
        "‪Understanding the effects of endorsements in scientific crowdfunding‬",
        "‪The art and science of persuasion: not all crowdfunding campaign videos are the same‬",
        "‪Know your Surroundings with an Interactive Map‬"
    ]
}