{
    "scholar_id": "i3uLKmkAAAAJ",
    "description": [
        "In recognition of the importance of inland waters, numerous datasets mapping their extents, types, or changes have been created using sources ranging from historical wetland maps to real-time satellite remote sensing. However, differences in definitions and methods have led to spatial and typological inconsistencies among individual data sources, confounding their complementary use and integration. The Global Lakes and Wetlands Database (GLWD), published in 2004, with its globally seamless gridded depiction of major vegetated and non-vegetated wetland classes, has emerged over the last decades as a foundational reference map that has advanced research and conservation planning addressing freshwater biodiversity, ecosystem services, greenhouse gas emissions, land surface processes, hydrology, and human health. Here, we present a new iteration of this map, termed GLWD version 2, generated by harmonizing the latest ground- and satellite-based data products into one single database. Following the same design principle as its predecessor, GLWD v2 aims to avoid double-counting of overlapping surface water features while differentiating between natural and non-natural lakes, rivers of multiple sizes, and several other wetland types. The classification of GLWD v2 incorporates information on seasonality (i.e., permanent vs. intermittent vs. ephemeral); inundation vs. saturation (i.e., flooding vs. waterlogged soils); vegetation cover (e.g., forested swamps vs. non-forested marshes); salinity (e.g., salt pans); natural vs. non-natural origins (e.g., rice paddies); and a stratification of landscape position and water source (e.g., riverine …",
        "Ramsar Wetlands: Values, Assessment, Management addresses the approaches, successes and limitations of the Ramsar Convention in a changing world, how recent approaches to wetland monitoring and management can contribute to improving wetland state, what the future holds for wetlands and their wise use, and what the Ramsar Convention needs to do to achieve future successes. The book presents a unique outlook on a range of issues, addressing considerable advances in our understanding of wetlands, their great environmental, social, cultural and economic importance, their role in maintaining the global water-cycle, and in mitigating and adapting to changing climates. No other book has yet taken this broad look at the past, present and future of wetlands and the Ramsar Convention. From aquatic ecologists, environmental scientists and engineers, to water resource managers, conservation agencies, and land management planners, this comprehensive guide is a beneficial tool in understanding wetlands. Answers questions on the responsibilities and roles of signatory nations to the Ramsar Convention, including how it may deal with ongoing and emerging causes of wetland change Addresses ongoing challenges of reporting and managing wetland change Provides a multidisciplinary approach and details the wise use principle that underpins the convention",
        "Maintaining peace and conserving biodiversity hinge on an international system of cooperation codified in institutions, but Russia’s invasion of Ukraine brings recent progress to a crossroads. Against this backdrop, we address some implications of Russia’s invasion of Ukraine for the governance of biodiversity conservation both within and beyond Russia. The Russian invasion of Ukraine threatens the governance system for biodiversity conservation, as it pertains to Russia and beyond, due to three interacting factors: (i) isolation of Russia from the international system, (ii) halt and delay of international cooperation, and (iii) changes in international and domestic policy priorities. We recommend making the existing international system of governance for conserving biodiversity more resilient and adaptable, while aligning security agendas with biodiversity conservation goals.",
        "Wetlands have long been drained for human use, thereby strongly affecting greenhouse gas fluxes, flood control, nutrient cycling and biodiversity,. Nevertheless, the global extent of natural wetland loss remains remarkably uncertain. Here, we reconstruct the spatial distribution and timing of wetland loss through conversion to seven human land uses between 1700 and 2020, by combining national and subnational records of drainage and conversion with land-use maps and simulated wetland extents. We estimate that 3.4 million km2 (confidence interval 2.9–3.8) of inland wetlands have been lost since 1700, primarily for conversion to croplands. This net loss of 21% (confidence interval 16–23%) of global wetland area is lower than that suggested previously by extrapolations of data disproportionately from high-loss regions. Wetland loss has been concentrated in Europe, the United States and China, and rapidly …",
        "The Ramsar Convention on the conservation and wise use of the World’s wetlands was agreed in response to widespread recognition of the declining condition of wetlands and the impact of this on wetland habitats and associated fauna. Since 1971, over 2000 wetlands have been listed as internationally important by 172 countries and covering more than 2,000,000 km2. There have been considerable advances in the scientific understanding of wetlands, and today, the monitoring of these systems draws on multiple disciplinary approaches. The Convention itself has responded to these advances and the ongoing challenge to conserve the world’s wetlands. Importantly, signatory nations regularly report on the condition of wetlands, update listings, and have adopted a framework to ensure wise use of all wetlands. In turn, healthy wetlands are increasingly seen to afford considerable ecosystem services to human …",
        "Wetlands worldwide are in trouble. Their area and condition have been, and are, in continuing decline. Through drainage and conversion to other land uses, the area of natural wetlands is decreasing, although the extent of losses is uncertain: since 1700 AD loss is likely to be less than 87% but more than 21%–36%. Although more wetlands are currently reported to be in good than poor ecological character state, more are deteriorating than improving in state, and deterioration is becoming increasingly widespread. There continue to be challenges in making quantitative assessments of wetland state and trends in state, including in defining baseline and reference conditions. Longer-term palaeoecological records can help separate change from variation, and inform establishing appropriate baselines for wetland assessment and management.",
        "In the face of global-scale decline in the extent and state of the world’s wetlands, the Ramsar Convention has mobilised most of the world’s nations to support the conservation and wise use of wetlands. Whilst wetlands continue to be lost and their condition overall continues to decline, the Convention has played a significant part in assisting nations to mitigate pressures and preserve values and ecological assets. The pressures on wetlands will continue, and the Convention could continue its valuable contribution by increasing the awareness of the value of, and risks to wetlands, assisting Contracting Parties to plan for and accommodate change in wetland state, including that driven by climate change, recognising wetlands as socio-ecological systems, and refining the practice of wetland restoration. There remains much opportunity to extend the technical and management capacity that can be catalysed by the …",
        "Knowledge of the geographic distribution, types, and change in extent over time of wetland ecosystems informs policy, planning, and decision-making and has long been recognised by the Ramsar Convention as essential to achieve its aims of the conservation and wise use of all wetlands. Yet, only one-third of Ramsar Contracting Parties have reported having completed a national wetland inventory. Wetland remote sensing can fill this gap by providing geospatial datasets at the relevant scales and levels of detail. Recent information suggests that the global area of wetlands is approximately 12–16 × 106 km2, but gaps exist for regions and wetland classes, so current estimates are likely still underestimates. The most global wetland area is inland natural wetlands, with much smaller areas of coastal wetlands and human-made wetlands. The largest wetland areas are in Asia, North America and Latin America, and …",
        "Designating and conserving at least one Wetland of International Importance (Ramsar Sites) is one of the three primary obligations of Contracting Parties to the Ramsar Convention on Wetlands. Wetlands can be designated under one or more of the nine criteria related to the representativeness of wetland types or biological diversity. Ramsar Sites now cover 2.54 × 106 km2 and encompass 59.5% inland, 15.5% coastal, and 25.0% having both inland and coastal elements. Human-made wetlands occur in 35.5% of the Ramsar Sites and of these 32.4% occur in sites that have both inland and coastal elements. The distribution of Ramsar Sites in relation to marine coastal and shelf and freshwater biogeographic regionalisation systems, Marine Ecoregions of the World (MEOW), and Freshwater Ecoregions of the World (FEOW), illustrates the uneven distribution of the sites and gaps in coverage. Although the number of …",
        "The ‘Ramsar’ Convention on Wetlands was the first of the modern era global biodiversity conventions and remains the only multilateral environmental agreement focused on a single group of ecosystem types. At the time of initial discussions within the wetland conservation science community in the late 1960s, its ambition was unprecedented, with no successful models to draw upon, especially with regard to novel concepts such as the modus for an ‘internationally protected site’. Drawing on previously unpublished draft texts, we track the Convention’s textual development to its ultimate agreement in 1971. During this period its geographic scope changed from an initial European to global focus, whereas core obligations related to the designation of internationally important wetlands and the provision of secretariat coordination functions were substantively developed. We present (as supplementary material) all draft …",
        "Despite ample documentation of wetland conversion throughout human history, the total extent of global wetland loss is highly uncertain. Resolving rates of historical conversion of wetlands can inform estimates of many key Earth system processes, including terrestrial water storage, evapotranspiration, terrestrial-to-ocean carbon export, and greenhouse gas emissions. We present a new reconstruction of global wetland conversion to seven human land uses between 1700-2020. Drawing upon~ 1800 national and subnational statistics, potential wetland maps and land use maps, we generated a gridded reconstruction at 0.5 and decadal intervals. We estimate that 3.11 million km2 (CI: 2.78-3.84) of inland wetlands (excluding open water) have been drained or converted globally since 1700. Drainage for cropland (row crops) was the most important driver of wetland loss (2.0 Mkm2; 61.7% of total loss), followed by …",
        "The Ramsar Convention’s criteria for the identification of wetlands of international importance (Ramsar sites) and its associated guidance have been widely influential, not only in the selection of Ramsar sites, but also in the development of similar criteria to identify internationally or nationally protected areas for biodiversity through other processes. Over 50 years there has been a conceptual broadening of the scope of the criteria from an initial focus on waterbirds, as well as progressive development of interpretive guidance, allowing meaning and interpretation to develop to support criteria that have been unchanged since 2005. However, establishing criteria based on the provision of cultural or socioeconomic ecosystem services for humans, although regularly discussed at recent conferences of parties, remain unresolved, with opposing views among contracting parties. A pragmatic way forward may be to establish …",
        "We reply to the main concerns raised by Bridgewater (2021) in his response to Davies et al. (2021a), ‘Towards a Universal Declaration of the Rights of Wetlands’. We appreciate the contribution of Bridgewater (2021) to this emerging conversation and, although we disagree with some of his assessments and statements, we do not find his points to be incompatible with support for the Declaration of the Rights of Wetlands (ROW). This reply focuses on four areas of concern raised by Bridgewater (2021). First, we describe why a wetlands-specific declaration will add important value to other Rights of Nature declarations. Second, we discuss how the ROW does not detract from, but rather can contribute to and complement, existing conservation and management approaches and mechanisms. Third, we agree on the importance of weaving Indigenous and local knowledge with other knowledges and emphasise that the …",
        " In this article, a Universal Declaration of the Rights of Wetlands (Declaration) was developed as a wetlands-specific response to the global crises and the Rights of Nature movement, a proposal for a fundamental paradigm shift in the relationship with wetlands and was discussed and proposed to have an establishment of a Rights of Wetlands Initiative (ROW Initiative) with the Society of Wetland Scientists (SWS) Executive Board. The approach, the evolution of the idea, the precedent, the early support for the Universal Declaration of the Rights of Wetlands, and the recent and proposed activities of the Declaration were presented. Recognition of the Rights of Wetlands may provide the basis for a step-change in our relationship with wetlands, and thus provide a potential pathway to help reverse the downward trajectory of wetland loss and degradation and the associated acceleration of climate destabilization and …",
        " This article provides a factual summary of the results of the second citizen science survey of the state of the world's remaining wetlands in 2020. A total of 522 responses were received for the 2020 survey. After quality control and vetting, a total of 514 responses were of sufficient quality (with regards to content and comprehensiveness) for analysis. The geographical spread and wetland types, the current state of wetlands, change in wetland area, change in wetland state, and drivers of wetland state were discussed. Although it is encouraging that more wetlands were reported in 2020 as being in good state as in poor state, over one-fifth were in poor state. Regionally, wetlands in Africa and Latin America & the Caribbean were reported to have the smallest proportions of wetlands in good state, (the most widespread loss of wetland area, and the most widespread deterioration in wetland state). Conversely, the …",
        "The rights of Nature, a concept recognised by several courts, legislatures and international governance institutions, is being promoted by some non-governmental organisations, scientists, attorneys, Indigenous peoples, local communities, and others. In this article we propose a Universal Declaration of the Rights of Wetlands, consistent with the 1982 World Charter for Nature. Recognition of these rights supports the provision of ecosystem services essential to human well-being and to other life on Earth. Further, such rights could reinforce efforts to reduce wetland loss and deterioration, thereby slowing climate destabilisation and biodiversity declines. Because world scientists have warned that biodiversity loss, ecosystem degradation and climate destabilisation, which intensify wetland loss, constitute global emergencies, new approaches are required to ensure that wetlands are protected and their benefits to …",
        "Ecological character and wise use are central tenets underpinning the Ramsar Convention’s global wetland ambitions. In this paper, we postulate that, given on-going and progressive degradation and destruction of wetlands, these concepts require reframing. So as to overcome the human–nature dualism, which underpins current wetland conservation, we propose that wetlands need to be placed within a social–ecological framing that can accommodate a plurality of worldviews and value systems. This reframing broadens the definition of wetland ecological character and replaces it with a more inclusive and comprehensive term ‘wetland character’. Wise use, consequently, becomes maintenance of wetland character. Further considerations on maintaining wetland character under this construct are presented.",
        " Citizen science is increasingly recognised as a valuable approach to improve the knowledge and understanding required for robust environmental management. We report on the results of a citizen science survey conducted on the status and trends of over 500 wetlands from across the globe. Whilst many wetlands were reported as being in fair or good ecological character state, many (particularly those already in a poor state) were reported as deteriorating. Although designated Ramsar Sites were reported as currently having a slightly better state than other wetlands, widespread deterioration of Ramsar Sites as well as other wetlands was reported. Significant regional differences were reported on the state of wetlands and their extent of improvement or deterioration. Large wetlands, particularly in Africa but also in Latin America and the Caribbean, were reported to be in a worse, and increasingly deteriorating …",
        "The Convention on Wetlands of International Importance especially as Waterfowl Habitat, known as the Ramsar Convention, is a wetland conservation treaty with 171 contracting Parties. As an early multilateral environmental agreement, its obligations are general in nature. Each Party commits to delivering three primary duties: designation and conservation of at least one wetland site as a Wetland of International Importance; the wise use of all wetlands within its territory; and international cooperation with respect to wetland matters. Ramsar parties meet triennially at a Conference of the Parties (COP), the Convention’s primary policymaking body. The COP negotiates and adopts resolutions, traditionally on a consensus basis. It can vote on substantive issues but this has never been invoked. While the consensus-based approach ensures the positive support of the greatest number of Parties, it can also result in …",
        "Aquatic ecosystems are exposed to a host of anthropogenic stressors whose combined effect can be synthesized with cumulative stress indices. The reliability of cumulative stress indices depends primarily on: 1) stressor incidence maps derived from remote sensing or modeling but rarely validated against on-the-ground observations, and 2) the weighting scheme used to combine multiple stressors into a cumulative index typically based on expert opinion. In this paper, we evaluate the exposure and weights for 13 aquatic stressor maps of the world’s rivers with a comparison against local stress reporting across 1018 inland and coastal sites from the Ramsar Wetlands of International Importance. We found that globally-mapped and locally-reported stressors are poorly aligned overall (AUC-ROC = 0.50–0.63), and that concordance did not improve when stratifying by ecosystem types or continents. Agreement …"
    ],
    "title": [
        "‪Mapping the world’s inland surface waters: An update to the Global Lakes and Wetlands Database (GLWD v2)‬",
        "‪Ramsar wetlands: Values, assessment, management‬",
        "‪Implications of Russia’s invasion of Ukraine for the governance of biodiversity conservation‬",
        "‪Extensive global wetland loss over the past three centuries‬",
        "‪An introduction to the Ramsar Convention on Wetlands‬",
        "‪What’s happening to the world’s wetlands?‬",
        "‪Wetlands and future change—Implications and opportunities with the Ramsar Convention‬",
        "‪The extent and distribution of the world’s wetlands‬",
        "‪The distribution of the world’s internationally important wetlands and their contribution to global protected area goals and Aichi Biodiversity Target 11‬",
        "‪Development of the text of the Ramsar Convention: 1965–1971‬",
        "‪Loss of twenty percent of global wetlands since 1700 estimated by soil drainage reconstruction‬",
        "‪Fifty years of criteria development for selecting wetlands of international importance‬",
        "‪Reply to Bridgewater (2021),‘Response to Davies et al.,‘Towards a Universal Declaration of the Rights of Wetlands’’‬",
        "‪Shifting the paradigm: a society of wetland scientists rights of wetlands initiative.‬",
        "‪An updated citizen science state of the world's wetlands survey.‬",
        "‪Towards a universal declaration of the rights of wetlands‬",
        "‪Wetland ecological character and wise use: towards a new framing‬",
        "‪A citizen science state of the world’s wetlands survey‬",
        "‪Wetlands Convention‬",
        "‪Reciprocal insights from global aquatic stressor maps and local reporting across the Ramsar wetland network‬"
    ]
}