{
    "scholar_id": "Kdw47AcAAAAJ",
    "description": [
        "Embedded systems are prone to leak information via side-channels associated with their physical internal activity, such as power consumption, timing, and faults. Leaked information can be analyzed to extract sensitive data and devices should be assessed for such vulnerabilities. Side-channel power-supply leakage from embedded devices can also provide information regarding instruction-level activity for control code executed on these devices. Methods proposed to disassemble instruction-level activity via side-channel leakage have not addressed issues related to pipelined multi-clock-cycle architectures, nor have proven robustness or reliability. The problem of detecting malicious code modifications while not obstructing the sequence of instructions being executed needs to be addressed. In this article, instruction sequences being executed on a general-purpose pipelined computing platform are identified and …",
        "In networked Cyber–Physical Systems, fidelity of sensor data is critical for the safe operation of the physical plant. Misrepresentation of the data fed back by a primary sensor may cause service disruption or damage to the wider plant through interconnected physical processes. A framework for the recovery of control after an attack has been detected is developed with the following key concepts: (I) a collection of secure secondary sensors that measure energy emissions from components of the system to provide an assessment of the primary sensors’ trust status; (II) a trust-weighted consensus algorithm that fuses estimates from observers of interconnected processes with information from the secondary sensors to accurately reconstruct the state of the attacked process; and (III) a communication-aware self-triggered control protocol that regulates the attacked process using the consented estimate in the absence of …",
        "This paper investigates countermeasures to side-channel attacks. A dynamic partial reconfiguration (DPR) method is proposed for field programmable gate arrays (FPGAs)s to make techniques such as differential power analysis (DPA) and correlation power analysis (CPA) difficult and ineffective. We call the technique side-channel power resistance for encryption algorithms using DPR, or SPREAD. SPREAD is designed to reduce cryptographic key related signal correlations in power supply transients by changing components of the hardware implementation on-the-fly using DPR. Replicated primitives within the advanced encryption standard (AES) algorithm, in particular, the substitution-box (SBOX)s, are synthesized to multiple and distinct gate-level implementations. The different implementations change the delay characteristics of the SBOXs, reducing correlations in the power traces, which, in turn, increases the difficulty of side-channel attacks. The effectiveness of the proposed countermeasures depends greatly on this principle; therefore, the focus of this paper is on the evaluation of implementation diversity techniques.",
        " Purpose Clinical and animal studies indicate frequent small micro-arousals (McA) fragment sleep leading to health complications. McA in humans is defined by changes in EEG and EMG during sleep. Complex EEG recordings during the night are usually required to detect McA-limiting large-scale, prospective studies on McA and their impact on health. Even with the use of EEG, reliably measuring McA can be difficult because of low inter-scorer reliability. Surrogate measures in place of EEG could provide easier and possibly more reliable measures of McA. These have usually involved measuring heart rate and arm movements. They have not provided a reliable measurement of McA in part because they cannot adequately detect short wake periods and periods of wake after sleep onset. Leg movements in sleep (LMS) offer an attractive alternative. LMS and cortical arousal, including McA …",
        "Virtual reality (VR) systems are increasingly using physiology to improve human training. However, these systems do not account for the complex intra-individual variability in physiology and human performance across multiple timescales and psychophysiological demands. To fill this gap, we propose a theory of multilevel variability where tractable neurobiological mechanisms generate complex variability in performance over time and in response to heterogeneous sources. Based on this theory, we also present a study that examines changes in cardiovascular activity and performance during a stressful shooting task in VR. We examined physiology and performance at three important levels of analysis: task-to-task, block-to-block, session-to-session. Findings indicated joint patterns of physiology and performance that notably varied by the level of analysis. At the task level, higher task difficulty worsened …",
        "The well-recognized importance of adequate restful sleep for health and the high prevalence of disturbed sleep has produced wide-spread recognition of the clinical need and commercial potential for a practical cost-eﬀective system to evaluate and support restful sleep at home. However, existing systems for sleep monitoring use wrist-worn devices that are shown to be inaccurate in measuring quality of sleep and ineﬀective as an aid for the diagnostic of sleep-related disorders such as RLS (Restless Leg Syndrome) and ADHD (Attention Deficit Hyper Activity Disorder). To address this gap in use of sensors in sleep medicine, in this paper, we present RestEaZe, a multi-sensor ankle band that can capture two leg movement phenotypes: Dorsiflexions that are correlated with sleep disorders such as RLS and ADHD, and Complex Leg Movements that are correlated with texture of sleep, namely sleep fragmentation …",
        " With the global spanning of integrated circuit (IC) and electronic device supply chains, the ability of an untrusted foundry to alter a design for intellectual property (IP)/IC piracy increases. To tackle this threat, this paper proposes a design-based fingerprinting methodology based on machine learning schemes. The proposed method considers the effect of process variations, measurement noise, and device aging. The proposed fingerprinting scheme can identify if the circuit is original or has been altered by an adversary to hide piracy. Changing a gate to an equivalent counterpart does not change the functionality of the circuit and we assess these as altered circuits. Altering the circuit can arise if an adversary gains access to the register-transfer level (RTL) or netlist of a design in an untrusted supply chain or uses the datasheet to implement a functionally equivalent design. Experimentally we determine that our …",
        "Safety-critical Cyber-Physical Systems (CPS) always need to maintain operational normalcy, which may include reconfiguring the control system in response to cyber threats. This paper studies three different approaches to determine when redundancies in control and actuation exist and identify alternative actuation paths that keep the system operating safely in the event of an attack to the primary actuation path. The first two approaches use classical control tools in system identification to determine potential inputs based on the desired force traces, while the third employs a supervised learning algorithm. The three methods are then experimentally compared on a small-scale naval ship testbed. The testbed, although compact, allows the easy and fast evaluation of different control routines for CPS. Laboratory experimental results, when the rudder has been attacked, demonstrate the accuracy of all three approaches …",
        "No description available",
        "No description available",
        "Modeling buildings' heat dynamics is a complex process which depends on various factors including weather, building thermal capacity, insulation preservation, and residents' behavior. Gray-box models offer an explanation of those dynamics, as expressed in a few parameters specific to built environments that can provide compelling insights into the characteristics of building artifacts. In this paper, we present a systematic study of Bayesian approaches to modeling buildings' parameters, and hence their thermal characteristics. We build a Bayesian state-space model that can adapt and incorporate buildings' thermal equations and postulate a generalized solution that can easily adapt prior knowledge regarding the parameters. We then show that a faster approximate approach using Variational Inference for parameter estimation can posit similar parameters' quantification as that of a more time-consuming Markov …",
        "Modeling buildings' heat dynamics is a complex process which depends on various factors including weather, building thermal capacity, insulation preservation, and residents' behavior. Gray-box models offer a causal inference of those dynamics expressed in few parameters specific to built environments. These parameters can provide compelling insights into the characteristics of building artifacts and have various applications such as forecasting HVAC usage, indoor temperature control monitoring of built environments, etc. In this paper, we present a systematic study of modeling buildings' thermal characteristics and thus derive the parameters of built conditions with a Bayesian approach. We build a Bayesian state-space model that can adapt and incorporate buildings' thermal equations and propose a generalized solution that can easily adapt prior knowledge regarding the parameters. We show that a faster approximate approach using variational inference for parameter estimation can provide similar parameters as that of a more time-consuming Markov Chain Monte Carlo (MCMC) approach. We perform extensive evaluations on two datasets to understand the generative process and show that the Bayesian approach is more interpretable. We further study the effects of prior selection for the model parameters and transfer learning, where we learn parameters from one season and use them to fit the model in the other. We perform extensive evaluations on controlled and real data traces to enumerate buildings' parameter within a 95% credible interval.",
        "The current era can be characterized by the massive reliance on computing platforms in almost all domains, such as manufacturing, defense, healthcare, government. However, with the increased productivity, flexibility, and effectiveness that computers provide, comes the vulnerability to cyber-attacks where software, or even firmware, gets subtly modified by a hacker. The integration of a Trusted Platform Module (TPM) opts to tackle this issue by aiding in the detection of unauthorized modifications so that devices get remediation as needed. Nonetheless, the use of a TPM is impractical for resource-constrained devices due to power, space and cost limitations. With the recent proliferation of miniaturized devices along with the push towards the Internet-of Things (IoT) there is a need for a lightweight and practical alternative to the TPM. This paper proposes a cost-effective solution that incorporates modest amounts of …",
        "Intellectual property (IP) and integrated circuit (IC) piracy are of increasing concern to IP/IC providers because of the globalization of IC design flow and supply chains. Such globalization is driven by the cost associated with the design, fabrication, and testing of integrated circuits and allows avenues for piracy. To protect the designs against IC piracy, we propose a fingerprinting scheme based on side-channel power analysis and machine learning methods. The proposed method distinguishes the ICs which realize a modified netlist, yet same functionality. Our method doesn't imply any hardware overhead. We specifically focus on the ability to detect minimal design variations, as quantified by the number of logic gates changed. Accuracy of the proposed scheme is greater than 96 percent, and typically 99 percent in detecting one or more gate-level netlist changes. Additionally, the effect of temperature has been …",
        "Networked control systems improve the efficiency of cyber-physical plants both functionally, by the availability of data generated even in far-flung locations, and operationally, by the adoption of standard protocols. A side-effect, however, is that now the safety and stability of a local process and, in turn, of the entire plant are more vulnerable to malicious agents. Leveraging the communication infrastructure, the authors here present the design of networked control systems with built-in resilience. Specifically, the paper addresses attacks known as false data injections that originate within compromised sensors. In the proposed framework for closed-loop control, the feedback signal is constructed by weighted consensus of estimates of the process state gathered from other interconnected processes. Observers are introduced to generate the state estimates from the local data. Side-channel monitors are attached to each …",
        "Real-time electroencephalogram (EEG)-based state detection and prediction has many applications in Human-Computer Interactions, for example, adaptive training. Network analysis of brain activity derived from EEG data has been correlated to various cognitive states in the neuroscience literature making these network features an attractive measure to use for state detection. However, deriving these network measures in real-time is non-trivial and relatively unexplored in the literature. In this paper, we examine hardware designs and algorithmic performance of an existing non-linear measure of network activity, structural synchrony, as compared to a correlation-based linear measure of network activity, towards real-time human state classification. Our results indicate that the non-linear structural synchrony metric achieves a higher classification accuracy with similar computation speed. We demonstrate that the …",
        "IntroductionThis paper explores the feasibility of using touchless textile sensors as an input to environmental control for individuals with upper-extremity mobility impairments. These sensors are capacitive textile sensors embedded into clothing and act as proximity sensors.MethodsWe present results from five individuals with spinal cord injury as they perform gestures that mimic an alphanumeric gesture set. The gestures are used for controlling appliances in a home setting. Our setup included a custom visualization that provides feedback to the individual on how the system is tracking the movement and the type of gesture being recognized. Our study included a two-stage session at a medical school with five subjects with upper extremity mobility impairment.ResultsThe experimenting sessions derived binary gesture classification accuracies greater than 90% on average. The sessions also revealed intricate details …",
        "No description available",
        "No description available",
        "Leaky windows and doors, open refrigerators, unattended appliances, left-on lights, and other sources subtly leak energy accounting for a large portion of waste. Formal energy audits are expensive and time consuming and do not capture many sources of leakage and waste. In this short paper, we present a hybrid IR/RGB imaging system for an end-user to deploy to perform longitudinal detection of energy waste. The system uses a low resolution, 16 x 4 IR camera and a low cost digital camera mounted on a steerable platform to automatically scan a room, periodically taking low resolution IR and RGB images. The system uses image stitching to create an IR/RGB hybrid panoramic image and segmentation to determine temperature extrema in the scanned room. Finally, this data is combined with thermostat set-point information to highlight hot-spots or cold-spots which likely indicate energy leakage or wastage. The …"
    ],
    "title": [
        "‪Instruction Sequence Identification and Disassembly Using Power Supply Side-Channel Analysis‬",
        "‪A resilient framework for sensor-based attacks on cyber–physical systems using trust-based consensus and self-triggered control‬",
        "‪Side-Channel Power Resistance for Encryption Algorithms Using Implementation Diversity‬",
        "‪Pilot study: can machine learning analyses of movement discriminate between leg movements in sleep (LMS) with vs. without cortical arousals?‬",
        "‪Multilevel Longitudinal Analysis of Shooting Performance as a Function of Stress and Cardiovascular Responses‬",
        "‪RestEaZe: Low-power accurate sleep monitoring using a wearable multi-sensor ankle band‬",
        "‪Implementation-Based Design Fingerprinting for Robust IC Fraud Detection‬",
        "‪Alternative Actuation Paths for Ship Applications in the Presence of Cyber-Attacks‬",
        "‪LONGITUDINAL EXAMINATION OF ASSOCIATIONS BETWEEN HEART RATE VARIABILITY AND TEAM PERFORMANCE: THE IMPORTANCE OF TEAM ROLE‬",
        "‪RE-EXAMINING ANTICIPATORY CARDIAC DECELERATION AS AN INDICATOR OF ATTENTION USING RESPONSE TIME MODELING AND A REAL-WORLD SHOOTING TASK‬",
        "‪A Bayesian Data Analytics Approach to Buildings' Thermal Parameter Estimation‬",
        "‪Estimating Buildings' Parameters over Time Including Prior Knowledge‬",
        "‪IoT boot integrity measuring and reporting‬",
        "‪Design-Based Fingerprinting Using Side-Channel Power Analysis for Protection Against IC Piracy‬",
        "‪Trust-based framework for resilience to sensor-targeted attacks in cyber-physical systems‬",
        "‪Implementation of Structural Synchrony and Linear Measures of Brain Network Connectivity for Real-Time State Estimation‬",
        "‪Evaluating touchless capacitive gesture recognition as an assistive device for upper extremity mobility impairment‬",
        "‪REAL-TIME PREDICTION OF INTER-BEAT INTERVAL‬",
        "‪MODELING AUTONOMIC NERVOUS SYSTEM ACTIVITY TO PREDICT RESPONSE TO FATIGUE‬",
        "‪Longitudinal energy waste detection with visualization‬"
    ]
}