{
    "scholar_id": "KgjUnawAAAAJ",
    "description": [
        "Independent vector analysis (IVA) can be viewed as an extension of independent component analysis (ICA) to multiple datasets. It exploits the statistical dependency between different datasets through mutual information. In the context of motor imagery classification based on electroencephalogram (EEG) signals for the brain–computer interface (BCI), several methods have been proposed to extract features efficiently, mainly based on common spatial patterns, filter banks, and deep learning. However, most methods use only one dataset at a time, which may not be sufficient for dealing with a multi-source retrieving problem in certain scenarios. From this perspective, this paper proposes an original approach for feature extraction through multiple datasets based on IVA to improve the classification of EEG-based motor imagery movements. The IVA components were used as features to classify imagined movements using consolidated classifiers (support vector machines and K-nearest neighbors) and deep classifiers (EEGNet and EEGInception). The results show an interesting performance concerning the clustering of MI-based BCI patients, and the proposed method reached an average accuracy of 86.7%.",
        "In the first issue of 2024, we introduced the new lead editorial team of  IEEE Signal Processing Magazine  ( SPM ), composed of our four area editors. Their terms started with mine this January, and they oversee the Society e-newsletter and the three main components of our magazine: feature articles, special issues, and columns and forum articles. As a team, we have undertaken a complete revision of the specifications for all article types and the information we provide our authors. We also revised the templates for all article types along with proposals and white papers, and all are included within the IEEE Author Center’s template selector   .",
        "BackgroundSchizophrenia research reveals sex differences in incidence, symptoms, genetic risk factors, and brain function. However, a knowledge gap remains regarding sex-specific schizophrenia alterations in brain function. Schizophrenia is considered a dysconnectivity syndrome, but the dynamic integration and segregation of brain networks are poorly understood. Recent advances in resting-state functional magnetic resonance imaging allow us to study spatial dynamics, the phenomenon of brain networks spatially evolving over time. Nevertheless, estimating time-resolved networks remains challenging due to low signal-to-noise ratio, limited short-time information, and uncertain network identification.MethodsWe adapted a reference-informed network estimation technique to capture time-resolved networks and their dynamic spatial integration and segregation for 193 individuals with schizophrenia and 315 …",
        "Identifying relationships among multiple datasets is an effective way to summarize information and has been growing in importance. In this paper, we propose a robust 3-step method for identifying the relationship structure among multiple datasets based on Independent Vector Analysis (IVA) and bootstrap-based hypothesis testing. Unlike previous approaches, our theory-backed method eliminates the need for user-defined thresholds and can effectively handle non-Gaussian data. It achieves this by incorporating higher-order statistics through IVA and employing an eigenvalue decomposition-based feature extraction approach without distributional assumptions. This way, our method estimates more interpretable components and effectively identifies the relationship structure using hierarchical clustering. Simulation results demonstrate the effectiveness of our method, as it achieves perfect Adjusted Mutual …",
        "Independent component analysis (ICA) is now a widely used solution for the analysis of multi-subject functional magnetic resonance imaging (fMRI) data. Independent vector analysis (IVA) generalizes ICA to multiple datasets (multi-subject data). Along with higher-order statistical information in ICA, it leverages the statistical dependence across the datasets as an additional type of statistical diversity. As such, IVA preserves variability in the estimation of single-subject maps but its performance might suffer when the number of datasets increases. Constrained IVA is an effective way to bypass computational issues and improve the quality of separation by incorporating available prior information. Existing constrained IVA approaches often rely on user-defined threshold values to define the constraints. However, an improperly selected threshold can have a negative impact on the final results. This paper proposes two …",
        "This paper addresses the problem of robust Gaussian mixture modeling in the presence of outliers. We commence by introducing a general expectation-maximization (EM)-like scheme, called   -BM, for iterative numerical computation of the minimum   -divergence estimator (M  DE). This estimator leverages Parzen's non-parametric   ernel density estimate to down-weight low density regions associated with outlying measurements. Akin to the conventional EM, the   -BM involves successive  M aximizations of lower  B ounds on the objective function of the M  DE. However, differently from EM, these bounds are not exclusively reliant on conditional expectations. The   -BM algorithm is applied to robust parameter estimation of a finite-order multivariate Gaussian mixture model (GMM). We proceed by introducing a new robust variant of the Bayesian information criterion (BIC) that penalizes the M  DE's objective function. The …",
        "Non-Gaussianity and non-stationarity are strong features on the basis of which blind source extraction (BSE) becomes a powerful signal processing tool. The recently proposed double nonstationarity model exploits both properties in the mixing and source models, which significantly broadens the class of identifiable signals. In this article, Craméer-Rao and performance analyses are presented, including the complex-valued case, non-circularity, joint extraction, and non-stationary mixing useful for moving source extraction. Besides identifiability conditions and achievable extraction accuracy, the results reveal the influence of a source model misspecification. Of particular interest is the case when the source of interest is Gaussian, which is not identifiable without taking into account source non-stationarity. The validity of the analyses is experimentally confirmed and compared with the empirical performance of the …",
        "Joint blind source separation (JBSS) is a powerful methodology for analyzing multiple related datasets, able to jointly extract sources that describe statistical dependencies across the datasets. However, JBSS can be computationally prohibitive with high-dimensional data, thus there exists a key need for more efficient JBSS algorithms. JBSS algorithms typically rely on numerical solutions, which may be expensive due to their iterative nature. In contrast, analytic solutions follow consistent procedures that are often less expensive. In this paper, we introduce an efficient analytic solution for JBSS. Denoting a set of sources dependent across the datasets as a “source component vector” (SCV), our solution minimizes correlation among separate SCVs by minimizing distance of the SCV cross-covariance’s eigenvector matrix from a block diagonal matrix. Under the orthogonality constraint, this leads to a system of linear …",
        "Thomas Siegert—Chief Financial Officer Jeff Strohschein—Chief Information Digital Officer Cheri N. Wideman—Chief Human Resources Officer SCOPE: IEEE Signal Processing Magazine publishes tutorial-style articles on signal processing research and applications as well as columns and forums on issues of interest. Its coverage ranges from fundamental principles to practical implementation, reflecting the multidimensional facets of interests and concerns of the community. Its mission is to bring up-to-date, emerging, and active technical developments, issues, and events to the research, educational, and professional communities. It is also the main Society communication platform addressing important issues concerning all members.",
        "Identifying biomarkers for computer-aided diagnosis (CAD) is crucial for early intervention of psychiatric disorders. Multi-site data have been utilized to increase the sample size and improve statistical power, while multi-modality classification offers significant advantages over traditional single-modality based approaches for diagnosing psychiatric disorders. However, inter-site heterogeneity and intra-modality heterogeneity present challenges to multi-site and multi-modality based classification. In this paper, brain functional and structural networks (BFNs/BSNs) from multiple sites were constructed to establish a joint multi-site multi-modality framework for psychiatric diagnosis. To do this we developed a hypergraph based multi-source domain adaptation (HMSDA) which allows us to transform source domain subjects into a target domain. A local ordinal structure based multi-task feature selection (LOSMFS) approach was developed by integrating the transformed functional and structural connections (FCs/SCs). The effectiveness of our method was validated by evaluating diagnosis of both schizophrenia (SZ) and autism spectrum disorder (ASD). The proposed method obtained accuracies of 92.2%±2.22% and 84.8%±2.68% for the diagnosis of SZ and ASD, respectively. We also compared with 6 domain adaptation (DA), 10 multi-modality feature selection, and 8 multi-site and multi-modality methods. Results showed the proposed HMSDA+ LOSMFS effectively integrates multi-site and multi-modality data to enhance psychiatric diagnosis and identify disorder-specific diagnostic brain connections.",
        "Subgroup identification is a fundamental step in precision medicine. Recent research applying data-driven methods such as independent component/vector analysis to multi-subject functional magnetic resonance imaging (fMRI) data has effectively revealed meaningful subgroups. These methods typically focus on single-dimensional information, such as individual functional networks or assuming uniform subgroup structures across networks. Given the complex nature of psychiatric disorders, considering the relationships among subjects across different functional networks can offer valuable insights into diagnostic heterogeneity. We introduce a novel subgroup identification method that leverages multiplex community detection to identify subgroups from multi-subject resting-state fMRI data. The proposed method models subject correlations across functional networks as a multiplex network and identifies common …",
        "Joint blind source separation (JBSS) is a powerful framework for extracting latent sources from multiple datasets while keeping their coherence across multiple linked datasets. Algorithms for JBSS, while offering the capability of improved estimation performance, often incur high computational complexity and hence are not scalable to studies with hundreds or thousands of datasets. In this paper, we propose a simple yet efficient method for source separation that exploits both the correlation among sources within each dataset and across the datasets. The proposed method, named reference-guided component analysis (RGCA), uses source templates as references to (i) guide the separation of sources on each dataset and (ii) establish source dependence and automatically align them across the datasets. In addition, we promote independence among latent sources within each dataset by adding orthogonal …",
        "To capture different aspects of a complex system, the modeling approach should be able to take these effectively into consideration. Two aspects of the human brain we are quite interested in are its interconnected nature and its dynamism. One modeling approach that can capture these two aspects is based on networks that change with time and go beyond pairwise interactions. Partly because of the size of these temporal high-order networks, analyzing and visualizing them is quite a challenge. In this work, we propose a pipeline based on canonical polyadic (CP) decomposition to analyze high-order networks that are resolved in both time and frequency estimated from resting-state functional magnetic resonance imaging (fMRI) data. We show that we can combine different subjects' information into a common frame of reference for comparison. We also show that different factors provide different patterns that are …",
        "Multimodal neuroimaging research plays a pivotal role in understanding the complexities of the human brain and its disorders. Independent component analysis (ICA) has emerged as a widely used and powerful tool for disentangling mixed independent sources, particularly in the analysis of functional magnetic resonance imaging (fMRI) data. This paper extends the use of ICA as a unifying framework for multimodal fusion, introducing a novel approach termed parallel multilink group joint ICA (pmg-jICA). The method allows for the fusion of gray matter maps from structural MRI (sMRI) data to multiple fMRI intrinsic networks, addressing the limitations of previous models. The effectiveness of pmg-jICA is demonstrated through its application to an Alzheimer’s dataset, yielding linked structure-function outputs for 53 brain networks. Our approach leverages the complementary information from various imaging modalities …",
        " Representing data using time-resolved networks is valuable for analyzing functional data of the human brain. One commonly used method for constructing time-resolved networks from data is sliding window Pearson correlation (SWPC). One major limitation of SWPC is that it applies a high-pass filter to the activity time series. Therefore, if we select a short window (desirable to estimate rapid changes in connectivity), we will remove important low-frequency information. Here, we propose an approach based on single sideband modulation (SSB) in communication theory. This allows us to select shorter windows to capture rapid changes in the time-resolved functional network connectivity (trFNC). We use simulation and real resting-state functional magnetic resonance imaging (fMRI) data to demonstrate the superior performance of SSB+SWPC compared to SWPC. We also compare the recurring trFNC patterns …",
        "SCOPE: IEEE Signal Processing Magazine publishes tutorial-style articles on signal processing research and applications as well as columns and forums on issues of interest. Its coverage ranges from fundamental principles to practical implementation, reflecting the multidimensional facets of interests and concerns of the community. Its mission is to bring up-to-date, emerging, and active technical developments, issues, and events to the research, educational, and professional communities. It is also the main Society communication platform addressing important issues concerning all members.",
        "For reasons beyond our control, the issues of  IEEE Signal Processing Magazine  arrive to you with delays this year. As you receive the current March issue, we are back from another edition of our flagship conference, the IEEE International Conference on Acoustic, Speech, and Signal Processing (ICASSP), which took place in Seoul, Korea, 14–19 April 2024. It was successful and vibrant, and, with 4,432 attendees and 2,826 accepted papers (out of 5,896 submitted), it was bigger than ever. At the risk of being labeled a grumpy Muppet, I will note that ICASSPs are now a tad too big for me, as I often found myself at a loss trying to choose among a seemingly endless number of attractive sessions and events at any given time. Of course, we still have our workshops, which are intimate and focused, and a number of them are even single track.",
        "Objective  Brain function is understood to be regulated by complex spatiotemporal dynamics, and can be characterized by a combination of observed brain response patterns in time and space. Magnetoencephalography (MEG), with its high temporal resolution, and functional magnetic resonance imaging (fMRI), with its high spatial resolution, are complementary imaging techniques with great potential to reveal information about spatiotemporal brain dynamics. Hence, the complementary nature of these imaging techniques holds much promise to study brain function in time and space, especially when the two data types are allowed to fully interact.  Methods  We employed coupled tensor/matrix factorization (CMTF) to extract joint latent components in the form of unique spatiotemporal brain patterns that can be used to study brain development and function on a millisecond scale.  Results  Using the CMTF model, we …",
        "Matrix decomposition techniques have been successfully applied in the analysis of multi-subject functional magnetic resonance imaging (fMRI) data. These data-driven approaches that assume the linear blind source separation (BSS) problem can yield an unsupervised and fully interpretable solution when there is a good model match. However, selecting a suitable model order that provides an accurate model match is an important challenge. Replicability and computational reproducibility are two key aspects that are also intimately related to interpretability. Despite clear evidence that solutions with poor reproducibility can lead to suboptimal results, the evaluation of reproducibility in matrix decomposition techniques remains limited in the existing literature. We propose the use of constrained independent vector analysis (cIVA), a state-of-the-art joint BSS technique, to assess the influence of model order selection for replicability and reproducibility. We demonstrate the attractiveness of cIVA for replicability by alleviating permutation ambiguity as well as enabling additional quantification opportunities. Our results show that highly reproducible model orders achieve a good model match with highly interpretable and replicable solutions when cIVA is applied to four different resting-state fMRI datasets.",
        "SCOPE: IEEE Signal Processing Magazine publishes tutorial-style articles on signal processing research and applications as well as columns and forums on issues of interest. Its coverage ranges from fundamental principles to practical implementation, reflecting the multidimensional facets of interests and concerns of the community. Its mission is to bring up-to-date, emerging, and active technical developments, issues, and events to the research, educational, and professional communities. It is also the main Society communication platform addressing important issues concerning all members."
    ],
    "title": [
        "‪Independent Vector Analysis for Feature Extraction in Motor Imagery Classification‬",
        "‪Volunteer Power Through Noisy Gradients and Self-Organization: What About Pruning?[From the Editor]‬",
        "‪Spatial Dynamic Subspaces Encode Sex-Specific Schizophrenia Disruptions in Transient Network Overlap and Their Links to Genetic Risk‬",
        "‪Identifying the Relationship Structure among Multiple Datasets Using Independent Vector Analysis: Application to Multi-task fMRI Data‬",
        "‪Constrained independent vector analysis with reference for multi-subject fMRI analysis‬",
        "‪Robust Gaussian Mixture Modeling: A K-Divergence Based Approach‬",
        "‪Double Nonstationarity: Blind Extraction of Independent Nonstationary Vector/Component from Nonstationary Mixtures—Performance Analysis‬",
        "‪An efficient analytic solution for joint blind source separation‬",
        "‪3 From the Editor Volunteer Power Through Noisy Gradients and‬",
        "‪Joint multi-site domain adaptation and multi-modality feature selection for the diagnosis of psychiatric disorders‬",
        "‪Subgroup Identification Through Multiplex Community Structure Within Functional Connectivity Networks‬",
        "‪A Robust and Scalable Method with an Analytic Solution for Multi-Subject FMRI Data Analysis‬",
        "‪Analysis of High-Order Brain Networks Resolved in Time and Frequency Using CP Decomposition‬",
        "‪Parallel Multilink Group Joint ICA: Fusion of 3D Structural and 4D Functional Data Across Multiple Resting fMRI Networks‬",
        "‪Frequency modulation increases the specificity of time-resolved connectivity: A resting-state fMRI study‬",
        "‪3 From the Editor Today’s Rapidly Evolving Education‬",
        "‪Today’s Rapidly Evolving Education Landscape: Challenges and Opportunities [From the Editor]‬",
        "‪Learning Spatiotemporal Brain Dynamics in Adolescents via Multimodal MEG and fMRI Data Fusion Using Joint Tensor/Matrix Decomposition‬",
        "‪Reproducibility and Replicability in Neuroimaging: Constrained IVA as an Effective Assessment Tool‬",
        "‪3 From the Editor An Exciting Juncture for Signal Processing‬"
    ]
}