{
    "scholar_id": "M-Z7bAIAAAAJ",
    "description": [
        "Internet-of-Things (IoT) is characterized by the incorporation of resource constrained devices that are inter-networked in an ad-hoc manner. Given the diversity of the devices and the operating conditions, it is important to assess the trustworthiness of IoT nodes and factor it in the network management. Contemporary trust evaluation and management schemes found in the literature mostly consider observable network-level behavior parameters and initially assume that all nodes are equally trustworthy owing to the absence of historical data or background. Such an equal trust initialization approach raises concerns in terms of accuracy, fairness, and adaptability. This paper aims to mitigate these shortcomings by proposing a novel trust evaluation and aggregation framework. Our framework leverages hardware primitives such as Physical Unclonable Functions (PUFs) to assign trust scores at the network bootstrapping …",
        "Field Programmable Gate Arrays (FPGAs) allow to optimize computations at the speed of hardware whilst enjoying the flexibility of software. Sharing FPGAs between multiple users in clouds (so-called multi-tenant FPGAs) has reduced the implementation cost for each user; obviously, logical isolation ensures that each user can preserve his privacy. Nonetheless, it has been recently proven that multi-tenant FPGAs allow for a malevolent user to leverage physical leakage of another user to recover his private data, such as cryptographic keys. Such attacks mainly benefit from Time-to-Digital Converters (TDC) in sensing the FPGA's power consumption (modulated by the victim user's secret/private keys) and performing a side-channel analysis attack. However, the state-of-the-art attacks in this area require manual Placement and Routing (PnR) of the implemented TDC to be able to extract the victim's sensitive data …",
        "A Cyber-Physical System (CPS) employs intercon-nected sensing and actuation modules and applies distributed control strategies. With the major advances in communication technology, the CPS design methodology is getting broadly adopted, including in safety and mission-critical applications. The incorporation of digital twins within a CPS facilitates localized decision-making by the individual control modules within the system in a timely manner without risking stability and performance. However, cyberattacks could be detrimental when false data is injected to degrade the accuracy of the underlying digital twins so that a CPS module takes non-optimal or even risky action that causes application failure. This paper proposes a novel approach for detecting such an attack scenario through a combination of a predictive data model and a topology fingerprinting scheme. Specifically, we employ a recurrent neural …",
        "The True Random Number Generator (TRNG) is an inescapable primitive for security and cryptographic functions. A common TRNG architecture in digital devices exploits the noise jitter accumulation with ring oscillators. The Set-Reset latch (SR-latch) TRNG is another type which exploits the state of latches around metastability. In this TRNG the dynamic noise is extracted by analysing the convergence state of the related latch. The advantage is its very high throughput as it runs at (or near) the clock frequency. However, it is not so popular as there is no assurance that the quality of the randomness will exist in real silicon. This notably comes from the fact that there is a lack of a proven stochastic model against the quality of the process, and about its unknown behavior evolution over time (when aged). This makes the evaluation methods, like BSI AIS-31 or NIST SP 800-90B, difficult to succeed. To fill the gap, in this …",
        "Ishai-Sahai-Wagner (ISW) masking scheme has been proposed in literature to protect cryptographic circuitries against side-channel analysis attacks. Although provably secure from a theoretical standpoint, its hardware implementation may not be secure as such security proof holds true if the gates are only evaluated after all of their inputs are available, yet such requirement is not met in hardware as the gates are evaluated as soon as any single input of them is changed. This paper provides a repair for ISW to address its security concern and prevent the key recovery. Our method is based on inserting artificial delays and/or “refreshing” on some sensitive paths to ensure that the underlying combinational gates are evaluated in the order expected by the ISW rationale. We verify the security of our proposed structure by leakage detection. Our solution is called E-ISW standing for Enhanced-ISW.",
        "Profiling side-channel analysis (SCA) attacks have received a lot of attention in the recent years. To perpetrate these attacks, the adversary creates a profile of a sensitive device at her disposal, and uses it to model a target device with a similar implementation to extract its key. Template attacks are recognized to be the most powerful profiling attacks when the measurement noise is Gaussian. To tackle SCA attacks, different countermeasures have been proposed in the literature, among which masking schemes have received the utmost attention. By adding randomness to the circuit, masking schemes prevent the adversary from relating the power consumption to the evaluated data, thus making the attack more difficult. In this article, we study the protection provided by several masking schemes against template attacks. More precisely, we investigate how the success of the template attack is changed when there is a …",
        "The 28th IEEE European Test Symposium (ETS) was held in Venice, Italy, 22–26 May 2023, in a hybrid format. This was the second hybrid venue for ETS since the COVID-19 pandemic. ETS is Europe’s premier forum in the area of electronic-based circuits and system testing, reliability, security, and validation. ETS’23 was arranged in five days and the program consisted of keynotes, scientific paper presentations, panels, workshops, highlights/demos from the industry, a PhD forum, and a McCluskey contest. It also included the Test Spring School (TSS). A total of 238 attendees (including both in-person and virtual) registered for the conference from 36 countries among which 102 were from industry and 135 were affiliated with academia (including 53 students).",
        "The notion of Cyber-Physical Systems (CPS) reflects real-time control applications that are realized through distributed coordination among multiple modules. Such coordination is founded on frequent exchange of status and sensor data among the various modules so that actuation decisions are made autonomously. The formation of digital twins has emerged as an effective methodology where data-driven models are employed to enable effective decision making. Hence, the accuracy of these models become very critical for system stability; no wonder data forgery is a major threat for CPS where an attacker strives to inject faulty data to degrade the digital twin of one or multiple modules. Such an attack could be taking the form of impersonating a component, or manipulating/replaying status update packets. This paper proposes an effective scheme for mitigating such a threat by employing hardware-based …",
        "Emerging applications in the context of smart cities pursue a decentralized design that often involves numerous networked components. To validate such a design, the scientific community has resorted to software based simulators to find a way around the complexity of building large scale physical network test-beds. Network Simulator-3 (ns-3) is one of the most popular platforms for this purpose where communication-related performance metrics, e.g., latency and throughput, can be evaluated. Yet, concerns exist about the viability of such a simulated approach when assessing dependability metrics, e.g., trust and resilience to cyberattacks, since the misbehavior is mainly defined by the evaluator. Incorporating physical nodes within the simulated network would be advantageous in that regard. Advances have been made to connect network simulators, e.g., ns-3, to virtual machines to emulate communication with …",
        "Laser Fault Injection Attacks (LFIA) are a major concern in physical security of electronic circuits as they allow an attacker to inject a fault with a very high spatial accuracy. They are also often considered by information technology security evaluation facilities (ITSEFs) to deliver security certification, as Common Criteria, of embedded systems. Time or spatial redundancy can be foreseen as protection methods but they are costly and do not ensure immunity against multiple laser injections. The detection would be efficient if the detecting sensors meet enough density and sensitivity to cover the functional blocks being protected. Most sensors rely on analog and specific technology. In this article, we propose a method to detect LFIAs via a fully digital sensor based on a time to digital converter (TDC) and show its efficacy in detecting such faults in various conditions related to the current induced by the laser, the …",
        "True Random Number Generators (TRNGs) are sensitive Intellectual Property (IP) blocks involved in the creation of cryptographic keys, initialization vectors, nonces, etc. They must behave properly within a large environmental spectrum, including multiple corners, in case of aging-induced change of device characteristics over time, and also under intentional attacks aiming at lowering the TRNGs entropy. In this paper, we review normative and technical landscapes in this respect, and propose a pre-silicon verification methodology to assess the resilience of TRNGs. In particular, we qualify the unitary free running oscillator (FRO) entropy source analytically, and then extend the study to a full FRO-based IP module. Our results encompass analytical characterizations in terms of jitter measurements and certification-based characterizations in terms of tests.",
        "The True Random Number Generator (TRNG) is an inescapable primitive for security and cryptographic functions. A common TRNG architecture in digital devices exploits the noise jitter accumulation with ring oscillators. The Set-Reset latch (SR-latch) TRNG is another type which exploits the state of latches around metastability. In this TRNG the dynamic noise is extracted by analysing the convergence state of the related latch. The advantage is its very high throughput as it runs at (or near) the clock frequency. However, it is not so popular as there is no assurance that the quality of the randomness will exist in real silicon. This notably comes from the fact that there is a lack of a proven stochastic model against the quality of the process, and about its unknown behavior evolution over time (when aged). This makes the evaluation methods, like BSI AIS-31 or NIST SP 800-90B, difficult to succeed. To fill the gap, in this paper, we propose a closed form of the average entropy of the SR-latch based TRNG taking into account the process mismatch and allowing the designer to know precisely the number of SR-latches required for an optimal entropy. This is highly crucial to avoid low entropy if not enough latches are integrated, yet meanwhile preventing high overhead by not including more latches than needed. Moreover, the impact of device aging is deeply studied by simulation over 7 years. Interestingly, the results show that the aging has no significant impact on the entropy. This makes the SR-latch based TRNG a good candidate, for main TRNG or as a second entropy source. Keywords: SR-latch based TRNG, stochastic model, regulatory standards …",
        "The 41st IEEE VLSI Test Symposium (VTS) was held in San Diego, CA, USA, on 24–26 April 2023. This venue was the first in-person one since the COVID-19 pandemic. VTS is one of the premier conferences focusing on test, reliability, and security challenges in VLSI circuits. Following the same trend as prior years, VTS was arranged in three days and captured a set of research and innovative practice (IP) sessions, keynotes, panels, embedded tutorials, and doctoral thesis competitions for a total of 31 sessions.",
        "The test of security primitives is particularly strategic as any bias coming from the implementation or environment can wreak havoc on the security it is intended to provide. This paper presents how some security properties are tested on hardware security primitives including True Random Number Generation (TRNG), Physically Unclonable Function (PUF), and cryptographic modules. Moreover, we discuss how the sensors embedded to protect cryptographic modules against fault injection attacks should be calibrated over time to fulfill the requirement it was designed for. The testing we discuss in this paper is different from the conventional testing where we consider a fault model and generate test patterns via an ATPG to detect such faults. The test of TRNG and PUF to ensure a high level of security is mainly about the entropy assessment, which requires specific statistical tests. The security against side-channel …",
        "On behalf of the organizing committee, we joyfully welcome you to IEEE COINS 2023. Held from July 23-25, 2023, in the vibrant city of Berlin, Germany, this international conference serves as a powerful beacon of innovation, technology, and intellectual exchange.",
        "Aggressive scaling continues to push technology into smaller feature sizes and results in more complex systems in a single chip. With such scaling, various robustness concerns have come into account among which the change of circuits' properties during their lifetime, so-called device aging, has received a lot of attention. Due to aging, the electrical behavior of transistors deviates from its original intended one resulting in degrading the chip's performance, and ultimately the chip fails to provide correct outputs. Thereby, prognosis of circuit performance degradation during the runtime, before the chip actually fails is highly crucial in increasing the reliability of chips. Accordingly in this paper, we develop a machine-learning based framework that, leveraging the outcome of embedded time-to-digital-convertors (so-called \"digital sensors''), predicts aging-induced degradation. This information can be used to prevent chip …",
        "Masking schemes have been introduced to thwart side-channel attacks. In software applications, attackers can measure leakage at several points in time and combine them to defeat the masking. In hardware gate-level masking, all shares of a masked variable are manipulated at the same time in a nanoscale circuit. In this article, we focus on setups where the attacker uses one mesoscopic probe, which measures an aggregated leakage of all shares. We consider masking schemes where each bit is randomly split (by XOR) into so-called shares (two or more). We analyze two interesting case studies about the interrelationship of attack order vs. the number of shares. First of all, we show that when the unique probe is measuring the sum of each share’s individual leakage (so-called Hamming weight model), one measurement can reveal the sensitive unshared value, provided the attacker is able to determine the …",
        "Secure chips implement cryptographic algorithms and protocols to ensure self-protection (e.g., firmware authenticity) as well as user data protection (e.g., encrypted data storage). In turn, cryptography needs to defer to incorruptible sources of entropy to implement their functions according to their mandatory usage guidance. Typically, keys, nonces, initialization vectors, tweaks, etc. shall not be guessed by attackers. In practice, True Random Number Generators (TRNGs) are in charge of producing such sensitive elements.Fully aware of the central role of TRNGs in the proper implementation of security in chips, stakeholders have been formalizing the requirements recently. The methods to strengthen such requirements are manifold. In this paper, we discuss and apply three of them by targeting the Set-Reset Latch TRNG which is an alternative to Ring-Oscillator (RO) TRNGs as it provides faster throughputs. The first …",
        "With the proliferation of digital transactions, trust is becoming increasingly important, as exemplified by the World Economic Forum’s Data Free Flow with Trust. Digital signatures are utilized to establish trust to prevent spoofing and unauthorized modification of transmitted digital data. However, the extent of trust is limited by jurisdictions, trusted lists and bridge certificate authorities, and does not have international coverage. For this reason, mutual recognition is needed, ie trust relationships established across countries. Establishing mutual recognition is complex and time-demanding due to the legislations, systems, and technologies involved. In parallel, electronic signatures consist of complex systems and structures and, thus, focusing on the technical requirements and solutions can enhance mutual recognition processes. The purpose of our approach is to develop a testbed that can verify technical aspects of mutual recognition. This paper describes the concept of the testbed “Hakoniwa” which includes analyzing the requirements, simulating and testing mutual recognition trust services across US, UK, EU and JP.",
        "The scale, unattended-operation and ad-hoc nature of an Internet-of-Things (IoT) make the network vulnerable to device impersonation, message replay, and Sybil attacks by either external actors or compromised nodes. This paper opts to tackle such vulnerability and presents a novel and effective solution for mutual authentication of IoT nodes. The proposed solution calls for embedding a Physically Unclonable Function (PUF) on each device, and employs a lightweight protocol for validating the identity of the individual devices based on querying the PUF. To authenticate a “prover” node, a verifier node will send a challenge bit-stream to the prover, where the latter provides the response of its PUF to such a challenge to be matched by what the verifier expects. To prevent the PUF of a prover from being modeled by an eavesdropper or a collusive set of compromised verifiers, the proposed protocol makes the …"
    ],
    "title": [
        "‪PETIT: PUF-enabled trust evaluation framework for IoT networks‬",
        "‪Attacking Multi-Tenant FPGAs Without Manual Placement and Routing‬",
        "‪Digital Twin Based Topology Fingerprinting for Detecting False Data Injection Attacks in Cyber-Physical Systems‬",
        "‪Impact of Process Mismatch and Device Aging on SR-Latch Based True Random Number Generators‬",
        "‪Securing ISW Masking Scheme Against Glitches‬",
        "‪On the Resiliency of Protected Masked S-Boxes Against Template Attack in the Presence of Temperature and Aging Misalignments‬",
        "‪The 28th IEEE European Test Symposium‬",
        "‪Digital Twin Integrity Protection in Distributed Control Systems‬",
        "‪A Networked System Dependability Validation Framework Using Physical and Virtual Nodes‬",
        "‪DELFINES: Detecting laser fault injection attacks via digital sensors‬",
        "‪Challenges in generating true random numbers considering the variety of corners, aging, and intentional attacks‬",
        "‪Jean-Luc Danger‬",
        "‪The 41st IEEE VLSI Test Symposium‬",
        "‪Testing and reliability enhancement of security primitives: Methodology and experimental validation‬",
        "‪Welcome Message from the Chairs‬",
        "‪Aging-induced failure prognosis via digital sensors‬",
        "‪Security Order of Gate-Level Masking Schemes‬",
        "‪Special session: security verification & testing for SR-latch TRNGs‬",
        "‪International Mutual Recognition: A Description of Trust Services in US, UK, EU and JP and the Testbed\" Hakoniwa\".‬",
        "‪Collusion-resistant PUF-based Distributed Device Authentication Protocol for Internet of Things‬"
    ]
}