{
    "scholar_id": "o30tR0QgLxUC",
    "description": [
        "In recent years, the photonics community has shown increasing interest in the inverse design of photonic components and devices using the adjoint method (AM) due to its efficient gradient computation and suitability for large parameter and continuous design spaces. This work focuses on substrate optimization to maximize light transmission or field enhancement at specific locations using layered medium Green’s functions (LMGFs). We first provide a numerical formulation for calculating two-dimensional (2D) LMGFs, leveraging their efficiency for fixed sources and observation points parallel to layer interfaces. We then present a step-by-step implementation of the AM for substrate optimization using LMGFs. Through numerical studies, we verify the field enhancement achieved with AM-designed substrates using a frequency-domain solver. We compare the results of AM with particle swarm optimization (PSO) for …",
        "By placing a periodic array of metal nanoparticle-silicon nanowire composite structures underneath a monolayer of MoS 2, we achieve the design of a phototransistor with improved thermal management, higher quantum efficiency, and lower phase noise.",
        "This study introduces a method to approximate temperature distribution in steady-state photodetectors under optical excitation. Findings underscore the influence of temperature on key attributes, revealing overestimation with constant temperature assumptions. Insights aid in optimizing photodetector performance.",
        "Research on two-dimensional material-based phototransistors has recently become a topic of great interest. However, the high number of design features, which impact the performance of these devices, and the multi-physical nature of the device operation make the accurate analysis of these devices a challenge. Here, we present a simple yet effective numerical framework to overcome this challenge. The one-dimensional framework is constructed on the drift-diffusion equations, Poisson’s equation, and wave propagation in multi-layered medium formalism. We apply this framework to study phototransistors made from monolayer molybdenum disulfide () placed on top of a back-gated silicon-oxide-coated silicon substrate. Numerical results, which show good agreement with the experimental results found in the literature, emphasize the necessity of including the inhomogeneous background for accurately …",
        "We developed a finite-difference frequency-domain (FDFD) and a finite-difference time-domain (FDTD) drift-diffusion equations solver that takes the multilayered background into account for realistic characterization. Comparisons between the numerical results and experiments validate the accuracy of the proposed approach in calculating the output current, quantum efficiency, and phase noise of the photodetector as a function of incident wavelength.",
        "We created a scatterer database based on the modified MNIST data set. Using simple neural networks, we achieve a 90% accuracy in classifying objects. We investigated the accuracy as a function of antenna number and data set size. For large data sets, neural networks exhibit a higher accuracy compared to other traditional machine learning methods.",
        "This research introduces an approximation method for computing the temperature distribution in photodetectors operating in a steady state under optical excitation. The derived temperature profile is utilized to assess the impact of temperature variations on crucial performance metrics of photodetectors, encompassing quantum efficiency, bandwidth, and phase noise. Our methodology, grounded in simplified heat transport equations, yields significant insights into the intricate relationship between temperature and photodetector performance. Our findings reveal that assuming constant room temperature operation leads to an overestimate of the output current and quantum efficiency and an underestimate of bandwidth, by contrast, a model in which the temperature varies produces estimates that closely align with experimentally-measured values for quantum efficiency and bandwidth. The low thermal conductivity of …",
        "With the rapid advance of machine learning techniques and the increased availability of high-speed computing resources, it has become possible to exploit machine-learning technologies to aid in the design of photonic devices. In this work we use evolutionary optimization algorithms, machine learning techniques, and the drift-diffusion equations to optimize a modified uni-traveling-carrier (MUTC) photodetector for low phase noise at a relatively low bias of 5 V. We compare the particle swarm optimization (PSO), genetic, and surrogate optimization algorithms. We find that PSO yields the solution with the lowest phase noise, with an improvement over a current design of 4.4 dBc/Hz. We then analyze the machine-optimized design to understand the physics behind the phase noise reduction and show that the optimized design removes electrical bottlenecks in the current design.",
        "We present an optimized structure of a modified uni-traveling carrier photodetector that has a faster impulse response and a lower phase noise at comb-line frequencies below 40 GHz. The highest improvement of phase noise is 9.5 dBc/Hz at 36 GHz comb-line frequency.",
        "We initially developed an efficient solver to study photodetectors composed of multiple semiconductor layers with varying thicknesses and doping concentrations. Subsequently, we employed it as the forward solver for three different numerical optimization methods aimed at designing Si-Ge photodetectors with larger bandwidth, higher quantum efficiency, and lower phase noise. Our work offers new insights into the design of high-performance photodetectors—a challenging task due to computation time, design constraints, and the complexity of estimating sensitivity to design parameters.",
        "In this purely numerical work, we discuss the use of machine learning (ML) techniques to improve the resolution of local near-field probing (LNFP) measurements when the probe used in LNFP is larger than the device being studied. The study demonstrates that through the implementation of ML algorithms, it is possible to achieve a     spatial resolution even with probes that are a few wavelengths wide, while maintaining a maximum relative error of less than 3%. The investigation further reveals that fully connected neural networks (FCNNs) exhibit superior accuracy compared to linear regression when dealing with limited training datasets. Conversely, for larger training datasets, it is unnecessary to construct and train neural networks, as linear regressions prove to be both sufficient and efficient. These findings establish the potential of employing similar ML approaches to enhance the resolution of measurements …",
        "We calculate phase noise as a function of comb-line frequencies for two modified uni-traveling carrier photodetectors and then optimize the two devices for lower phase noise and higher quantum efficiency using the particle swarm optimization algorithm.",
        "This article compares the accuracy and efficiency of two neural network architectures for estimating the performance metrics of a modified uni-traveling wave carrier (MUTC) photodetector: a fully connected neural network (FCNN) and a recurrent neural network (RNN)-like architecture designed specifically for the unique properties and operation principles of the device. The RNN-like architecture mimics the current flow and wave propagation inside the MUTC PD, with distinct neural network layers used to pair parameters of each PD layer, inform the network about interfaces between layers, mimic current transport between neighboring layers, and teach the network about the order and bi-directional interaction among the paired inputs. Results show that while the RNN-like architecture exhibits slightly higher learning accuracy than the FCNN, the RNN-like architecture consumes less energy and requires less time for …",
        "Drift-diffusion equations are solved with the finite difference method that involves nonuniform discretization of the spatial and temporal domains. By using a broadband window function as the modulation method, we achieve to calculate the quantum efficiency, phase noise, bandwidth, and response time of various types of photodetectors in a single run on a desktop computer.",
        "Photodetectors are widely used in various applications with different requirements. Choosing the right group of semiconductor materials and adjusting the parameters of the layers that form the photodetectors are crucial for optimizing their performance. This paper investigates the suitability of four numerical optimization methods - genetic algorithm, particle swarm optimization, surrogate algorithm, and the Nelder-Mead simplex algorithm - for the design of photodetectors by comparing the performance of the methods. The findings of this study can aid in selecting the right numerical optimization technique for designing photodetector-like opto-electronic devices with optimal performance for specific applications.",
        "With its compatibility for monolithic integration with silicon and its higher electron and hole mobilities compared to silicon, germanium is an essential semiconductor to be used in photonic devices—including photodetectors. To determine the stability, efficiency, and speed of a photodetector, one must measure or calculate the phase noise, quantum efficiency, and response time of the photodetector. We recently developed an efficient drift-diffusion equations solver that uses a non-uniform time-stepping [1] and both single-frequency and broadband excitations to calculate the phase noise [2], quantum efficiency [2], and bandwidth [3] of photodetectors that have several layers of semiconducting materials with varying thicknesses and doping concentrations.",
        "Ring resonators are widely used in optics and photonics as critical elements of optical modulators, filters, switches, sensors, and lasers [1]. Light is typically coupled in and out of ring resonators via an adjacent waveguide through evanescent coupling. The coupling quality factor (Q c) is wavelength-dependent, as both the spatial mode overlap and the phase mismatch vary with wavelength.",
        "Broadband microresonator frequency combs are being intensely pursued for deployable technologies like optical atomic clocks. Spectral features, such as the dispersion in their coupling to an access waveguide, are critical for engineering these devices for application, but optimization can be computationally intensive given the number of different parameters involved and the broad (octave-spanning) spectral bandwidths. Machine learning algorithms can help address this challenge by providing estimates for the coupling response at wavelengths that are not used in the training data. In this work, we examine the accuracy of three neural network architectures: fully connected neural networks, recurrent neural networks, and attention-based neural networks. Our results show that when trained with data sets that are prepared by including upper and lower limits of each design feature, attention mechanisms can predict …",
        "Time window functions are used as broadband excitations to obtain the output power spectrum of photodetectors. Numerical results show a good agreement with experimental results. The proposed method yields a two-orders-of-magnitude reduction in computing time and memory compared to traditional monochromatic calculations. This large reduction makes it possible to design high-performance photodetectors with numerical optimization on desktop computers. We use this approach to design a device whose 3-dB bandwidth is four times larger than the initial design.",
        "Blackman-Harris time window is used as a broadband excitation to calculate the RF output power of a photodetector. A non-uniform time-stepping is implemented to capture rapidly changing fields and currents inside the photodetector. The comparisons of numerical results with experiments confirm the high accuracy of the proposed approach that yields a two-orders-of-magnitude reduction in computation time."
    ],
    "title": [
        "‪Substrate optimization with the adjoint method and layered medium Green’s functions‬",
        "‪Heat Management and Quantum Efficiency Enhancement of Phototransistors Made from Two-Dimensional Materials‬",
        "‪Thermal Analysis of Photodetectors in Steady-State‬",
        "‪Study of an MoS 2 phototransistor using a compact numerical method enabling detailed analysis of 2D material phototransistors‬",
        "‪Modeling Two-Dimensional Material-Based Photodetectors with Finite-Difference Methods‬",
        "‪Object Classification using Electromagnetic Data and Neural Networks‬",
        "‪A Simple Numerical Model to Estimate the Temperature Distributions Over Photodetectors in Steady-State‬",
        "‪Use of evolutionary optimization algorithms for the design and analysis of low bias, low phase noise photodetectors‬",
        "‪Optimized MUTC Photodetector for Lower Phase Noise at Comb-Line Frequencies Below 40 GHz‬",
        "‪Designing silicon-germanium photodetectors with numerical optimization: the tradeoffs and limits‬",
        "‪Enhancing the Resolution of Local Near-Field Probing Measurements With Machine Learning‬",
        "‪Dual-Objective Numerical Optimization of MUTC Photodetectors for Frequency Comb Applications‬",
        "‪Designing Energy Efficient Neural Networks According to Device Operation Principles‬",
        "‪Solving drift diffusion equations on non-uniform spatial and temporal domains‬",
        "‪Designing Nonlinear Optoelectronic Devices with Numerical Optimization: Lessons Learned‬",
        "‪Designing Silicon-Germanium Photodetectors with Numerical Optimization: The Tradeoff Between Quantum Efficiency & Phase Noise‬",
        "‪Attention mechanisms for broadband feature prediction for electromagnetic and photonic applications‬",
        "‪Predicting broadband resonator-waveguide coupling for microresonator frequency combs through fully connected and recurrent neural networks and attention mechanism‬",
        "‪Fast evaluation of RF power spectrum of photodetectors with windowing functions‬",
        "‪Non-Uniform Time-Stepping and Windowing for Fast Simulation of Photodetectors‬"
    ]
}