{
    "scholar_id": "Ok92zD4AAAAJ",
    "description": [
        "Internet-of-Things (IoT) based solutions are gaining momentum in delivering efficient solutions in health care domain, reducing financial and physical burden on patients and improving ease of treatment for physicians. One such smart health care solution are Serious games. Serious games aid rehabilitation in various fields. For physical rehabilitation, personalization is important for improving training results. A scientific approach for difficulty level design can facilitate players to get effective rehabilitation. The automation of personalized difficulty level design helps the self-guided game-based rehabilitation approach, become simplified and efficient. AI is advancing the design of personalized serious game for rehabilitation through data-driven and individual-oriented methods. In this work, we present Generative AI based design of gamified training plan, especially difficulty level plan which could go beyond rule based …",
        "Hand gestures are a natural and intuitive form of communication, and integrating this communication method into robotic systems presents significant potential to improve human-robot collaboration. Recent advances in motor neuroscience have focused on replicating human hand movements from synergies also known as movement primitives. Synergies, fundamental building blocks of movement, serve as a potential strategy adapted by the central nervous system to generate and control movements. Identifying how synergies contribute to movement can help in dexterous control of robotics, exoskeletons, prosthetics and extend its applications to rehabilitation. In this paper, 33 static hand gestures were recorded through a single RGB camera and identified in real-time through the MediaPipe framework as participants made various postures with their dominant hand. Assuming an open palm as initial posture, uniform joint angular velocities were obtained from all these gestures. By applying a dimensionality reduction method, kinematic synergies were obtained from these joint angular velocities. Kinematic synergies that explain 98% of variance of movements were utilized to reconstruct new hand gestures using convex optimization. Reconstructed hand gestures and selected kinematic synergies were translated onto a humanoid robot, Mitra, in real-time, as the participants demonstrated various hand gestures. The results showed that by using only few kinematic synergies it is possible to generate various hand gestures, with 95.7% accuracy. Furthermore, utilizing low-dimensional synergies in control of high dimensional end effectors holds …",
        "Stroke is one of the major causes of long-term disability in United States. With more than 800,00 people experiencing stroke every year, it is important that efficient means for recovery are presented to support stroke subjects. Exoskeleton and serious game based rehabilitation are some of the state-of-art approaches used in the recovery of stroke subjects. Accurate matching of body poses performed by individuals with stroke is essential in understanding the current state of recovery of the subject and plan further rehabilitation. Established machine learning based approaches fall short in accurately matching the poses of stroke subjects with ground truths. In this work, we present algorithms supported by Siamese architectures to effectively identify the poses performed by the subjects. Our proposed framework involves data pre-processing, extraction, building classification models and validating them using a body …",
        "Effective interactions between humans and robots are vital to achieving shared tasks in collaborative processes. Robots can utilize diverse communication channels to interact with humans, such as hearing, speech, sight, touch, and learning. Our focus, amidst the various means of interactions between humans and robots, is on three emerging frontiers that significantly impact the future directions of human–robot interaction (HRI): (i) human–robot collaboration inspired by human–human collaboration, (ii) brain-computer interfaces, and (iii) emotional intelligent perception. First, we explore advanced techniques for human–robot collaboration, covering a range of methods from compliance and performance-based approaches to synergistic and learning-based strategies, including learning from demonstration, active learning, and learning from complex tasks. Then, we examine innovative uses of brain-computer …",
        "Major challenge in building models for stroke rehabilitation stems from the non stationarity of the EMG signals. In this work we present a methodology for improved classification of hand gestures using Empirical Fourier Decomposition (EFD). First we apply the EFD technique on a set of publicly available dataset and later we reduce the dimensionality to collect most significant components. Finally we extract features from these components and perform hand gesture classifications using different machine learning (ML) models.Clinical Relevance: Compared to the state-of-art Empirical Wavelet Transform (EWT), the EFD technique reduced the total significant components considerably. To capture 90% of information from original data, the EFD approach needed 5.96% and 23.21% less number of components compared to EWT approach for original and dimensionally reduced data sets respectively. The classification …",
        "Hand gestures are a natural way of communication and integrating them into robots could allow for more efficient human-robot collaboration. In recent years, researchers and roboticists have attempted to replicate human hand motor control using the concept of synergies. In this paper, we present a new approach to obtaining kinematic synergies from hand gestures using a single RGB camera. We capture real-time hand gestures using the MediaPipe framework and convert them to joint angular velocities. We then use dimensionality reduction to obtain kinematic synergies from the joint angular velocities. These synergies can be used to reconstruct new hand gestures. We translate these reconstructed hand movement patterns into a humanoid robot, Mitra. Our results show that it is possible to control most of the joints of the robot for performing hand gestures using only a few synergies. This is more efficient than …",
        "Facial expression recognition (FER) is crucial in various healthcare applications, including pain assessment, mental disorder diagnosis, and assistive robots that require close interaction with humans. While heavyweight deep learning models can achieve high accuracy for FER, their computational cost and memory consumption often need optimization for portable and mobile devices. Therefore, efficient deep learning models with high accuracy are essential to enable FER on resource-constrained platforms. This paper presents a new efficient deep-learning model for facial expression recognition. The model utilizes Mix Transformer (MiT) blocks, adopted from the SegFormer architecture, along with a supplemented fusion block. The efficient self-attention mechanism in the transformer focuses on relevant information for classifying different facial expressions while significantly improving efficiency. Furthermore, our …",
        " Research on electromyogram (EMG) controlled prosthetic hands has advanced significantly, enriching the social and professional lives of people with hand amputation. Even so, the non-functionality of motor neurons in the remnant muscles impedes the generation of EMG as a control signal. However, such people have the same ability as healthy individuals to generate motor cortical activity. The work presented in this paper investigates electroencephalogram (EEG)-based control of a prosthetic hand. EEG of 10 healthy subjects performing the grasping operations were acquired for classification of hand movements. 15 EEG channels were selected to classify hand open and close operations. Hand movement-class-specific time-domain features were extracted from the filtered EEG. A support vector machine (SVM) was employed with 24-fold cross-validation for classification using extracted features. SVM hyper …",
        " Much development has been seen in commercial and laboratory prototypes of prosthetic hands during last two decades. However, prosthetic hands emulating human hand characteristics are very limited. In order to emulate human hand, performance characteristics evaluation of prosthetic hands is of paramount importance. This paper explains the performance characteristics of an EMG CoNtrolled PRosthetIC Hand called ENRICH involving end users’ feedback from clinical testing. ENRICH is a real time EMG controlled prosthetic hand that can perform grasping operations in 250 ± 1.1 milliseconds satisfying the neuromuscular constraint of human hand. The performance characteristics of ENRICH vis-à-vis commercial and laboratory prototypes are evaluated in terms of weight, size, degrees of freedom, finger joint range of motion, control strategy, operation time and clinical testing. This evaluation establishes …",
        "Recent advances in robotic technology are bringing about robots better suited to perform tasks and applications in which robots are interacting directly with people in their everyday environments, both at home and in the workplace. Human-robot interaction (HRI) is beneficial because robots have been shown to deliver an emotional response to humans and humans find robots engaging. Additionally, robots can integrate into everyday settings without difficulty and can be perceived by humans as active social agents, meaning they can complete the programmed tasks with total control, independence, and intentionality. With HRI, a user’s experience of interaction varies from person to person and is influenced by many factors such as physical context of the environment, cultural context, thoughts and feelings toward the robot, and social nature [1].HRI is also an important development because it allows robots to be directed by humans to complete certain challenging and hazardous tasks, notably in an industrial setting. With modern computational algorithms programmed into the environment, HRI can increase productivity and reduce downtime and task interruptions [2]. Additionally, HRI is a beneficial solution to compensate for a lack of human labor force in a certain setting, due to various factors such as extreme conditions or low pay. The lack of human labor hurts the local or large-scale economy as it means a lower production supply, and this issue can be resolved potentially by incorporating robots into the scene. However, fully replacing humans with robots would mean a larger initial investment and would eliminate availability of jobs. Instead …",
        "The book Human-Robot Interaction-Perspectives and Applications highlights the latest developments and obstacles in the field of human-machine interaction, including collaborative and humanoid robots, symbiosis between humans and robots, human-human collaboration, and robotics. Human-robot interaction has immense potential in areas like healthcare, education, manufacturing, military, and space exploration. This volume consists of several chapters that explore various topics such as the use of robotic wheelchairs, deep neural networks for robot grasp recognition, materials and sensors required for human-robot interaction, the use of drone technology in agriculture, healthcare robots in smart hospitals, and more.",
        "Substance use disorder (SUD) is a dangerous epidemic that develops out of recurrent use of alcohol and/or drugs and has the capability to severely damage one’s brain and behaviour. Stress is an established risk factor in SUD’s development of addiction and in reinstating drug seeking. Despite this expanding epidemic and the potential for its grave consequences, there are limited options available for management and treatment, as well as pharmacotherapies and psychosocial treatments. To this end, there is a need for new and improved devices dedicated to the detection, management, and treatment of SUD. In this paper, the negative effects of SUD-related stress were discussed, and based on that, a few significant biomarkers were selected from a set of eight features collected by a chest-worn device, RespiBAN Professional, on fifteen individuals. We used three machine learning classifiers on these optimal biomarkers to detect stress. Based on the accuracies, the best biomarkers to detect stress and those considered as features for classification were determined to be electrodermal activity (EDA), body temperature, and a chest-worn accelerometer. Additionally, the differences between mental stress and physical stress, as well as different administrations of meditation during the study, were identified and analysed. Challenges, implications, and applications were also discussed. In the near future, we aim to replicate the proposed methods in individuals with SUD.",
        "The study of sleep is crucial for understanding how our bodies function., and electroencephalogram (EEG) offers a convenient way to examine sleep. Sleep can be categorized into wakefulness., rapid eye movement (REM) sleep., and stages 1-4, with 4 being the deepest stage of sleep. We strive to study how well EEG data help classify brain waves into these stages. The goal of this paper is to construct low dimensional features that are computationally efficient, robust., and effective for sleep detection and analysis. We experiment with EEG band power analysis., principal component analysis (PCA)., and autoencoder to reduce the dimensionality of the EEG data and evaluate their performances in classification. We find that, even when highly compressed., two dimensional features are still sufficient to obtain satisfactory classification accuracies: 89.3%, 88.8%, and 90% from band power analysis (using delta and …",
        "The hypothesis that the central nervous system (CNS) makes use of synergies or movement primitives in achieving simple to complex movements has inspired the investigation of different types of synergies. Kinematic and muscle synergies have been extensively studied in the literature, but only a few studies have compared and combined both types of synergies during the control and coordination of the human hand. In this paper, synergies were extracted first independently (called kinematic and muscle synergies) and then combined through data fusion (called musculoskeletal synergies) from 26 activities of daily living in 22 individuals using principal component analysis (PCA) and independent component analysis (ICA). By a weighted linear combination of musculoskeletal synergies, the recorded kinematics and the recorded muscle activities were reconstructed. The performances of musculoskeletal synergies in reconstructing the movements were compared to the synergies reported previously in the literature by us and others. The results indicate that the musculoskeletal synergies performed better than the synergies extracted without fusion. We attribute this improvement in performance to the musculoskeletal synergies that were generated on the basis of the cross-information between muscle and kinematic activities. Moreover, the synergies extracted using ICA performed better than the synergies extracted using PCA. These musculoskeletal synergies can possibly improve the capabilities of the current methodologies used to control high dimensional prosthetics and exoskeletons.",
        "Brain-machine interfaces (BMIs) have become increasingly popular in restoring the lost motor function in individuals with disabilities. Several research studies suggest that the CNS may employ synergies or movement primitives to reduce the complexity of control rather than controlling each DoF independently, and the synergies can be used as an optimal control mechanism by the CNS in simplifying and achieving complex movements. Our group has previously demonstrated neural decoding of synergy-based hand movements and used synergies effectively in driving hand exoskeletons. In this study, ten healthy right-handed participants were asked to perform six types of hand grasps representative of the activities of daily living while their neural activities were recorded using electroencephalography (EEG). From half of the participants, hand kinematic synergies were derived, and a neural decoder was developed, based on the correlation between hand synergies and corresponding cortical activity, using multivariate linear regression. Using the synergies and the neural decoder derived from the first half of the participants and only cortical activities from the remaining half of the participants, their hand kinematics were reconstructed with an average accuracy above 70%. Potential applications of synergy-based BMIs for controlling assistive devices in individuals with upper limb motor deficits, implications of the results in individuals with stroke and the limitations of the study were discussed.",
        "Investigations on how the central nervous system (CNS) effortlessly conducts complex hand movements have led to an extensive study of synergies or movement primitives. Of the different types of hand synergies, kinematic and muscle synergies have been widely studied in literature, but only a few studies have fused both. In this paper kinematic and muscle activities recorded from the activities of daily living were first fused and then dimensionally reduced through principal component analysis (PCA). By using these principal components or musculoskeletal synergies in a weighted linear combination, the recorded kinematics and muscle activities were reconstructed. The performance of these musculoskeletal synergies in reconstructing the movements was compared to the kinematic and muscle synergies reported previously in the literature by us and others. The results from these findings indicate that …",
        "Stress is an established risk factor in the development of addiction and in reinstating drug seeking. Substance use disorder (SUD) is a dangerous epidemic that affects the brain and behavior. Despite this growing epidemic and its subsequent consequences, there are limited management and treatment options, pharmacotherapies and psychosocial treatments available. To this end, there is a need for new and improved personalized devices and treatments for the detection and management of SUD. Based on documented negative effects of stress in SUD, in this paper, our objective was to select a few significant physiological features from a set of 8 features collected by a chest-worn RespiBAN Professional in 15 individuals. We used three machine learning classifiers on these optimal physiological features to detect stress. Our results indicate that best accuracies were achieved when electrodermal activity (EDA …",
        "Hand prehension requires highly coordinated control of contact forces. The high-dimensional sensorimotor system of the human hand operates at ease, but poses several challenges when replicated in artificial hands. This paper investigates how the dynamical synergies, coordinated spatiotemporal patterns of contact forces, contribute to the hand grasp, and whether they could potentially capture the force primitives in a low-dimensional space. Ten right-handed subjects were recruited to grasp and hold mass-varied objects. The contact forces during this multidigit prehension were recorded using an instrumented grip glove. The dynamical synergies were derived using principal component analysis (PCA). The contact force patterns during the grasps were reconstructed using the first few synergies. The significance of the dynamical synergies, the influence of load forces and task configurations on the synergies were explained. This study also discussed the contribution of biomechanical constraints on the first few synergies and the current challenges and possible applications of the dynamical synergies in the design and control of exoskeletons. The integration of the dynamical synergies into exoskeletons will be realized in the near future.",
        "No description available",
        "Human hands are versatile biomechanical architectures that can perform simple movements such as grasping to complicated movements such as playing a musical instrument. Such extremely dependable and useful parts of the human body can be debilitated due to movement disorders such as Parkinson’s disease, stroke, spinal cord injury, multiple sclerosis and cerebral palsy. In such cases, precisely measuring the residual or abnormal hand function becomes a critical assessment to help clinicians and physical therapists in diagnosis, treatment and in prescribing appropriate prosthetics or rehabilitation therapies. The current methodologies used to measure abnormal or residual hand function are either paperbased scales that are prone to human error or expensive motion tracking systems. The cost and complexity restrict the usability of these methods in clinical environments. In this paper we present a low-cost …"
    ],
    "title": [
        "‪Generative AI Based Difficulty Level Design of Serious Games for Stroke Rehabilitation‬",
        "‪Biomimetic learning of hand gestures in a humanoid robot‬",
        "‪Accurate Body Pose Matching for Individuals with Stroke using Siamese Networks‬",
        "‪Emerging Frontiers in Human–Robot Interaction‬",
        "‪Novel Hand Gesture Classification based on Empirical Fourier Decomposition of sEMG Signals‬",
        "‪Learning Hand Gestures using Synergies in a Humanoid Robot‬",
        "‪Towards efficient deep learning models for facial expression recognition using transformers‬",
        "‪Electroencephalogram based Control of Prosthetic Hand using Optimizable Support Vector Machine‬",
        "‪Performance Characteristics of EMG Controlled Prosthetic Hand‬",
        "‪Introductory Chapter: Human-Robot Interaction–Advances and Applications‬",
        "‪Human-Robot Interaction: Perspectives and Applications‬",
        "‪Identifying biomarkers for accurate detection of stress‬",
        "‪Finding Robust Low Dimensional Features for Sleep Detection Using EEG Data‬",
        "‪Data Fusion-based musculoskeletal synergies in the grasping hand‬",
        "‪Reconstructing synergy-based hand grasp kinematics from electroencephalographic signals‬",
        "‪Musculoskeletal synergies in the grasping hand‬",
        "‪Selection of optimal physiological features for accurate detection of stress‬",
        "‪Dynamical Synergies of Multidigit Hand Prehension‬",
        "‪Development of a Mobile App for Objective Assessment of Prosthesis Rejection Rates in End-Users‬",
        "‪Design and implementation of an instrumented data glove that measures kinematics and dynamics of human hand‬"
    ]
}