{
    "scholar_id": "rnkQi4gAAAAJ",
    "description": [
        "In response to escalating environmental challenges, the notion of a green economy has emerged as a pivotal approach to address pressing climate-related issues. The green economy framework seeks to harmonise economic growth with environmental preservation and social well-being. In past few decades the environmental, social and governance (ESG) criteria has emerged as a pivotal assessment for private sector institution to address pressing climate-related issues and mitigate environment risks. The significance of ESG in the context of green finance is highlighted by the exponential growth of sustainable investments and ESG oriented funds, reaching €32 trillion globally in 2020. Despite serving as an important assessment measure to guide sustainable investments, the ESG data published by institutions often remains unaudited. The lack of extensive auditing of ESG disclosures poses significant …",
        "No description available",
        "A vast amount of knowledge exists within biomedical literature, publications, clinical notes and online content. Identifying hidden, interesting or previously unknown biomedical knowledge from free text resources using an automated approach remains an important challenge. Towards this problem, we investigate the use of deep learning methods that have shown significant promise in identifying hidden patterns from large corpus of text in an unsupervised manner. For example, it can deduce that „husband‟-„man‟+'woman'='wife'. We use the text corpus from MRDEF file in the Unified Medical Language System (UMLS) dataset as training set to discover potential relationships. To evaluate our approach, we cross-verify new relationships against the UMLS MRREL dataset and conduct a manual evaluation from a sample of the non-overlapping set. The algorithm found 32% of new relationships not originally represented in the UMLS. The deep learning methods provide a promising approach in discovering potential new biomedical knowledge from free text.",
        "No description available",
        "The Personal Health Record (PHR) is an emerging framework of health information exchange, which is often stored at cloud servers. But there are still various privacy problems as personal health information could be discovered to unauthorized people. To guarantee the patients control over to their own PHRs, it is a method to encrypt the PHRs before storing on cloud. But still issues such as risks of privacy, efficiency in key administration, flexible access and efficient user administration, have still remained the important challenges toward achieving better, cryptographically imposed data access control. Here in this research paper, we develop a model and mechanism for control of data access to PHRs stored in cloud servers. To achieve efficient and modular data access control for PHRs, we provide ABE encryption approach to encrypt each PHR file. In this system we try to focus on the multiple data owner scheme, and divide the users into security domains that highly reduce the key management complication for owners and users. In this system patient privacy is guaranteed by exploiting multi-authority ABE. Our system’s scheme also enables modification of access policies or file attributes, and break-glass access under emergency situations. Extensive analysis and experimental results are presented which shows the security and efficiency of our proposed scheme.",
        "Fractional Flow Reserve (FFR) is the ratio of maximal blood flow in a stenotic artery to normal maximal flow. It is the “gold standard” technique used in diagnostic angiography to determine whether percutaneous intervention is needed in a moderate coronary stenosis (estimated 50-70% lesion). An FFR less than 0.8 may be falsely reassuring in a patient with unstable plaque who may be actively forming and dissolving clot. This is a case of a 36 year old gentleman, with no significant past medical history, who presented to another local hospital with complaints of episodic chest pain that was located in the sub-sternal region and radiated to his left upper extremity. He was found to be mildly hypertensive, with elevated cardiac markers and with no EKG findings. On cardiac catheterization the patient was found to have a 50% lesion of left anterior descending artery and an FFR measurement of 0.93-0.91, therefore the …",
        "Clinical trials form a critical link in the translation of basic biological research into routine clinical practice. However, finding eligible participants for clinical trials is a critical hurdle and a frequent cause for delays in the completion of trials. The lack of comprehensive, efficient, and consumer-friendly online tools has limited consumers’ ability to pro-actively find the right clinical trials and participate in them. The rising use of Internet as a medium for seeking health information and the advent of online Personal Health Records (PHRs) platforms such as Microsoft HealthVault (MHV) and Google Health (GH) have created the opportunity to change the status quo. These platforms are connected to databases of several healthcare organizations and enable patients to import their medical record and utilize it for self-management by using third-party applications built on these platforms. In this paper we discuss TrialX, a …",
        "Biological ontologies are now being widely used for annotation, sharing and retrieval of the biological data. Many of these ontologies are hosted under the umbrella of the Open Biological Ontologies Foundry. In order to support interterminology mapping, composite terms in these ontologies need to be translated into atomic or primitive terms in other, orthogonal ontologies, for example, gluconeogenesis (biological process term) to glucose (chemical ontology term). Identifying such decompositional ontology translations is a challenging problem. In this paper, we propose a network-theoretic approach based on the structure of the integrated OBO relationship graph. We use a network-theoretic measure, called the clustering coefficient, to find relevant atomic terms in the neighborhood of a composite term. By eliminating the existing GO to ChEBI Ontology mappings from OBO, we evaluate whether the proposed …",
        "The UK Actuarial Profession is undertaking a thought leadership cross-practice research project on discount rates. The timing for this research is particularly appropriate as there is a convergence of interest in discount rates from within and outside of the Profession. Discount rates are the heart of most actuarial calculations and therefore are also of significant public interest. In order to be able to continue to speak clearly and with authority in future debates about discount rates, the Profession needs to have a clear and common understanding of the issues surrounding the different discount rates used today across practice areas and to help in the development of frameworks for the future that will support actuaries in communicating impartially and effectively.",
        "The Internet has become a common source for consumers to seek health information across a wide range of topics including searching for clinical trials. However, not much is known about what consumers search for in relation to clinical trials and how they formulate their search queries. In this study, we use log file data from TrialX. com, a consumer-centric website that provides clinical trial information to ascertain patterns in consumer queries. We analyzed semantic patterns in the queries by mapping query keywords to the UMLS Semantic Types and performed a manual evaluation of user paths. We found that the queries can be grouped into combinations of information needs related to condition, location and treatment. The results also suggested that the consumers using longer search queries with multiple Semantic Types are more likely to take action to participate in clinical trials. The study provides early …",
        "As applications based on semantic web technologies enter the mainstream, there is a need to provide highly efficient ontology reasoning over large Aboxes. A common approach to achieving scalability is to build reasoners for DL subsets (eg, the EL family of languages, DL-Lite, DLP, or OWL-Prime). However, the proliferation of DL subsets runs counter to standardization efforts. In this paper, we present a hybrid approach which combines a fast, incomplete reasoning algorithm with a slower complete reasoning algorithm to handle the more expressive features of DL. Our approach works for SHIN. We demonstrate the effectiveness of this approach on large datasets (30-60 million assertions), where we show that performance on this hybrid approach provides significant performance gains (an average of 15 mins per query compared to 100 mins) without sacrificing completeness or expressivity.",
        "In this paper, we present BioEve a fully automated event extraction system for bio-medical text. It first semantically classifies each sentence to the class type of the event mentioned in the sentence, and then using high coverage hand-crafted rules, it extracts the participants of that event. We participated in Task 1 of BioNLP 2009 Shared task, and the final evaluation results are described here. Our experimentation with different approaches to classify a sentence to bio-interaction classes are also shared.",
        "  Objective: To use the semantic and structural properties in the Unified Medical Language System (UMLS) Metathesaurus to characterize and discover potential relationships.  Design: The UMLS integrates knowledge from several biomedical terminologies. This knowledge can be used to discover implicit semantic relationships between concepts. In this paper, the authors propose a problem-independent approach for discovering potential terminological relationships that employs semantic abstraction of indirect relationship paths to perform classification and analysis of network theoretical measures such as topological overlap, preferential attachment, graph partitioning, and number of indirect paths. Using different versions of the UMLS, the authors evaluate the proposed approach's ability to predict newly added relationships.  Measurements: Classification accuracy, precision-recall …",
        "No description available",
        "No description available",
        "No description available",
        "No description available",
        "No description available",
        "Terminologies play important roles in the annotation, organization, sharing and retrieval of the biomedical data. Several biomedical informatics applications such as information retrieval, decision support and knowledge discovery depend on identification of mappings, translations, or links (collectively referred to as connections) between different terminologies. Consider, for example, the connection between Hb (SNOMED CT) and Hemoglobin (LOINC) for terminology mapping application, or between Hb (SNOMED CT) and Anemia (MeSH) for an information retrieval application. Identification of such cross-terminology connections for a given application or task is a challenging problem. Existing research methods to identify connections are based on either manual selection, or problem-specific algorithms that are labor intensive, difficult to maintain, or unscalable beyond their original domains.",
        "We propose a formal representation language to represent, share and reuse eligibility criteria in clinical research protocols towards the goal of automated eligibility identification. The language is an extension over the UMLS Semantic Network and can be transformed into other computable representations."
    ],
    "title": [
        "‪Utilising Natural Language Processing (NLP) to identify cherry-picking in environment related ESG disclosures‬",
        "‪Resource Efficient Urban Regeneration of Residential Areas: Comparing Formal and Informal Development: Hamburg and Tirana Narratives‬",
        "‪Using deep learning towards biomedical knowledge discovery‬",
        "‪And Now for Something Completely Different: Successful Career Transformations in Biomedical and Health Informatics.‬",
        "‪Secure sharing of personal health records in cloud using attribute-based encryption‬",
        "‪Fractional Flow Reserve (FFR): FAR FROM REALITY‬",
        "‪TrialX: Using semantic technologies to match patients to relevant clinical trials based on their Personal Health Records‬",
        "‪A network-theoretic approach for decompositional translation across Open Biological Ontologies‬",
        "‪Actuaries and discount rates‬",
        "‪What do patients search for when seeking clinical trial information online?‬",
        "‪Efficient reasoning on large SHIN Aboxes in relational databases‬",
        "‪BioEve: bio-molecular event extraction from text using semantic classification and dependency parsing‬",
        "‪Using semantic and structural properties of the unified medical language system to discover potential terminological relationships‬",
        "‪Cross-validation‬",
        "‪Reference Knowledge.‬",
        "‪Clinical Data Quality and Validation.‬",
        "‪Quality and Trust of Information Content and Credentialing.‬",
        "‪Clinical Data and Information Models.‬",
        "‪Using automated methods to identify connections across biomedical terminologies‬",
        "‪ECRL: an eligibility criteria representation language based on the UMLS Semantic Network.‬"
    ]
}