{
    "scholar_id": "sJ7wlksAAAAJ",
    "description": [
        "The recent upsurge in electric vehicle (EV) adoption has led to greener mobility but has also broadened the attack surface due to the increased interconnection between the entities like EV, EV charger, grid etc. We show in this paper that among these entities, the EV charger provides a possible attack surface through the available communication network. Adversaries at a minimum can disrupt the vehicular charging process known as denial of charging (DoC) attack. This attack is demonstrated on the real hardware setup of an EV charging, where we have considered the Bharat EV DC charging standard (BEVC-DC001) adopted by India which uses the controller area network (CAN) bus to communicate between EV charger and EV. The DoC attack can have significant consequences both on the electrical grid as well as individuals. The EV chargers (with connected EV) collectively serve as a large load demand …",
        "The integration of cyber infrastructure in renewable energy source based AC microgrids (MGs) raises concerns about potential cyber attacks on such systems. An adversary can fabricate the information being exchanged between system components, which may cause false tripping of the installed protection devices. This creates the need for an anomaly diagnosis scheme that can distinguish between faults and cyber attacks to attain a reliable and secure system under large signal disturbances. This work presents a machine learning-based anomaly diagnosis scheme which characterizes these anomalies. The scheme uses the well-known XGBoost approach, and requires local measurements (such as, active power, reactive power, and frequency) of inverter-interfaced distributed energy resources (IIDERs). Since such measurements may be difficult for participants in a system to share across organizational …",
        "In the realm of IoT/CPS systems connected over mobile networks, traditional intrusion detection methods analyze network traffic across multiple devices using anomaly detection techniques to flag potential security threats. However, these methods face significant privacy challenges, particularly with deep packet inspection and network communication analysis. This type of monitoring is highly intrusive, as it involves examining the content of data packets, which can include personal and sensitive information. Such data scrutiny is often governed by stringent laws and regulations, especially in environments like smart homes where data privacy is paramount. Synthetic data offers a promising solution by mimicking real network behavior without revealing sensitive details. Generative models such as Generative Adversarial Networks (GANs) can produce synthetic data, but they often struggle to generate realistic data in specialized domains like network activity. This limitation stems from insufficient training data, which impedes the model's ability to grasp the domain's rules and constraints adequately. Moreover, the scarcity of training data exacerbates the problem of class imbalance in intrusion detection methods. To address these challenges, we propose a Privacy-Driven framework that utilizes a knowledge-infused Generative Adversarial Network for generating synthetic network activity data (KiNETGAN). This approach enhances the resilience of distributed intrusion detection while addressing privacy concerns. Our Knowledge Guided GAN produces realistic representations of network activity, validated through rigorous experimentation. We …",
        "Data protection and privacy is becoming increasingly crucial in the digital era. Numerous companies depend on third-party vendors and service providers to carry out critical functions within their operations, encompassing tasks such as data handling and storage. However, this reliance introduces potential vulnerabilities, as these vendors' security measures and practices may not always align with the standards expected by regulatory bodies. Businesses are required, often under the penalty of law, to ensure compliance with the evolving regulatory rules. Interpreting and implementing these regulations pose challenges due to their complexity. Regulatory documents are extensive, demanding significant effort for interpretation, while vendor-drafted privacy policies often lack the detail required for full legal compliance, leading to ambiguity. To ensure a concise interpretation of the regulatory requirements and compliance of organizational privacy policy with said regulations, we propose a Large Language Model (LLM) and Semantic Web based approach for privacy compliance. In this paper, we develop the novel Privacy Policy Compliance Verification Knowledge Graph, PrivComp-KG. It is designed to efficiently store and retrieve comprehensive information concerning privacy policies, regulatory frameworks, and domain-specific knowledge pertaining to the legal landscape of privacy. Using Retrieval Augmented Generation, we identify the relevant sections in a privacy policy with corresponding regulatory rules. This information about individual privacy policies is populated into the PrivComp-KG. Combining this with the domain context and rules, the …",
        "The purpose of this study was to characterize opioid and antimicrobial prescribing among uninsured patients seeking emergency medical care and to build predictive machine learning models. Uninsured patients were less likely to receive an opioid medication, more likely to receive non-opioid alternatives, and less likely to receive an antimicrobial prescription. The most impactful contributing factors were housing status, comorbidities, and recidivism.",
        "Big Data empowers the farming community with the information needed to optimize resource usage, increase productivity, and enhance the sustainability of agricultural practices. The use of Big Data in farming requires the collection and analysis of data from various sources such as sensors, satellites, and farmer surveys. While Big Data can provide the farming community with valuable insights and improve efficiency, there is significant concern regarding the security of this data as well as the privacy of the participants. Privacy regulations, such as the European Union’s General Data Protection Regulation (GDPR), the EU Code of Conduct on agricultural data sharing by contractual agreement, and the proposed EU AI law, have been created to address the issue of data privacy and provide specific guidelines on when and how data can be shared between organizations. To make confidential agricultural data widely …",
        "Narrative construction is the process of representing disparate event information into a logical plot structure that models an end to end story. Intelligence analysis is an example of a domain that can benefit tremendously from narrative construction techniques, particularly in aiding analysts during the largely manual and costly process of synthesizing event information into comprehensive intelligence reports. Manual intelligence report generation is often prone to challenges such as integrating dynamic event information, writing fine-grained queries, and closing information gaps. This motivates the development of a system that retrieves and represents critical aspects of events in a form that aids in automatic generation of intelligence reports. We introduce a Retrieval Augmented Generation (RAG) approach to augment prompting of an autoregressive decoder by retrieving structured information asserted in a …",
        "A key challenge faced by small and medium-sized business entities is securely managing software updates and changes. Specifically, with rapidly evolving cybersecurity threats, changes/updates/patches to software systems are necessary to stay ahead of emerging threats and are often mandated by regulators or statutory authorities to counter these. However, security patches/updates require stress testing before they can be released in the production system. Stress testing in production environments is risky and poses security threats. Large businesses usually have a non-production environment where such changes can be made and tested before being released into production. Smaller businesses do not have such facilities. In this work, we show how “digital twins”, especially for a mix of IT and IoT environments, can be created on the cloud. These digital twins act as a non-production environment where …",
        "Neurosymbolic artificial intelligence (AI) is an emerging and quickly advancing field that combines the subsymbolic strengths of (deep) neural networks and the explicit, symbolic knowledge contained in knowledge graphs (KGs) to enhance explainability and safety in AI systems. This approach addresses a key criticism of current generation systems, namely, their inability to generate human-understandable explanations for their outcomes and ensure safe behaviors, especially in scenarios with unknown unknowns (e.g., cybersecurity, privacy). The integration of neural networks, which excel at exploring complex data spaces, and symbolic KGs, which represent domain knowledge, allows AI systems to reason, learn, and generalize in a manner understandable to experts. This article describes how applications in cybersecurity and privacy, two of the most demanding domains in terms of the need for AI to be …",
        "Synthesizing information from collections of tables embedded within scientific and technical documents is increasingly critical to emerging knowledge-driven applications. Given their structural heterogeneity, highly domain-specific content, and diffuse context, inferring a precise semantic understanding of such tables is traditionally better accomplished through linking tabular content to concepts and entities in reference knowledge graphs. However, existing tabular data discovery systems are not designed to adequately exploit these explicit, human-interpretable semantic linkages. Moreover, given the prevalence of misinformation, the level of confidence in the reliability of tabular information has become an important, often overlooked, factor in the discovery over open datasets. We describe a preliminary implementation of a discovery engine that enables table-based semantic search and retrieval of tabular information from a linked knowledge graph of scientific tables. We discuss the viability of semantics-guided tabular data analysis operations, including on-the-fly table generation under reliability constraints, within discovery scenarios motivated by intelligence production from documents.    See paper, slides, poster, and presentation video.",
        "Generative artificial intelligence (AI) tools such as GPT-4, and the chatbot interface ChatGPT, show promise for a variety of applications in radiology and health care. However, like other AI tools, ChatGPT has limitations and potential pitfalls that must be considered before adopting it for teaching, clinical practice, and beyond. We summarize five major emerging use cases for ChatGPT and generative AI in radiology across the levels of increasing data complexity, along with pitfalls associated with each. As the use of AI in health care continues to grow, it is crucial for radiologists (and all physicians) to stay informed and ensure the safe translation of these new technologies.",
        "Security monitoring is crucial for maintaining a strong IT infrastructure by protecting against emerging threats, identifying vulnerabilities, and detecting potential points of failure. It involves deploying advanced tools to continuously monitor networks, systems, and configurations. However, organizations face challenges in adapting modern techniques like Machine Learning (ML) due to privacy and security risks associated with sharing internal data.  Compliance with regulations like GDPR further complicates data sharing. To promote external knowledge sharing, a secure and privacy-preserving method for organizations to share data is necessary. Privacy-preserving data generation involves creating new data that maintains privacy while preserving key characteristics and properties of the original data so that it is still useful in creating downstream models of attacks. Generative models, such as Generative Adversarial Networks (GAN), have been proposed as a solution for privacy preserving synthetic data generation. However, standard GANs are limited in their capabilities to generate realistic system data. System data have inherent constraints, e.g., the list of legitimate I.P. addresses and port numbers are limited, and protocols dictate a valid sequence of network events. Standard generative models do not account for such constraints and do not utilize domain knowledge in their generation process. Additionally, they are limited by the attribute values present in the training data. This poses a major privacy risk, as sensitive discrete attribute values are repeated by GANs. To address these limitations, we propose a novel model for Knowledge Infused …",
        "Neuro-Symbolic Artificial Intelligence (AI) is an emerging and quickly advancing field that combines the subsymbolic strengths of (deep) neural networks and explicit, symbolic knowledge contained in knowledge graphs to enhance explainability and safety in AI systems. This approach addresses a key criticism of current generation systems, namely their inability to generate human-understandable explanations for their outcomes and ensure safe behaviors, especially in scenarios with \\textit{unknown unknowns} (e.g. cybersecurity, privacy). The integration of neural networks, which excel at exploring complex data spaces, and symbolic knowledge graphs, which represent domain knowledge, allows AI systems to reason, learn, and generalize in a manner understandable to experts. This article describes how applications in cybersecurity and privacy, two most demanding domains in terms of the need for AI to be explainable while being highly accurate in complex environments, can benefit from Neuro-Symbolic AI.",
        "Entity linking is an important step towards constructing knowledge graphs that facilitate advanced question answering over scientific documents, including the retrieval of relevant information included in tables within these documents. This paper introduces a general-purpose system for linking entities to items in the Wikidata knowledge base. It describes how we adapt this system for linking domain-specific entities, especially for those entities embedded within tables drawn from COVID-19-related scientific literature. We describe the setup of an efficient offline instance of the system that enables our entity-linking approach to be more feasible in practice. As part of a broader approach to infer the semantic meaning of scientific tables, we leverage the structural and semantic characteristics of the tables to improve overall entity linking performance.",
        "Structured data artifacts such as tables are widely used in scientific literature to organize and concisely communicate important statistical information. Discovering relevant information in these tables remains a significant challenge owing to their structural heterogeneity, dense and often implicit semantics, and diffuse context. This paper describes how we leverage semantic technologies to enable technical experts to search and explore tabular data embedded within scientific documents. We present a system for the on-demand construction of knowledge graphs representing scientific tables (drawn from online scholarly articles hosted by PubMed Central) and for synthesizing tabular responses to semantic search requests against such graphs. We discuss key differentiators in our overall approach, including a two-stage semantic table interpretation that relies on an extensive structural and syntactic characterization of scientific tables and a prototype knowledge discovery engine that uses automatically inferred semantics of scientific tables to serve search requests by potentially fusing information from multiple tables on the fly. We evaluate our system on a real-world dataset of approximately 120,000 tables extracted from over 62,000 COVID-19-related scientific articles.    Best paper award",
        "The Internet of Battlefield Things (IoBT) connects autonomous, uncrewed air and ground vehicles with wireless networks. It is a promising technology that has the potential to significantly enhance the operational effectiveness of military units by providing them with real-time information about the battlefield and enhancing their situational awareness. Autonomous assets such as drones and sensors can gather data from various sources and transmit it back to the command center, where it can be used to make informed decisions. However, the trustworthiness of the data provided by these autonomous assets depends on the systems' security and resilience to adversary attacks. Adversaries can potentially exploit vulnerabilities in the system to disrupt or manipulate the data. For example, adversaries can potentially hijack drones or disrupt the network bandwidth, causing Denial of Service (DoS) attacks or injecting fake …",
        "AI models for cybersecurity have to detect and defend against constantly evolving cyber threats. Much effort is spent building defenses for zero days and unseen variants of known cyber-attacks. Current AI models for cybersecurity struggle with these yet unseen threats due to the constantly evolving nature of threat vectors, vulnerabilities, and exploits. This paper shows that cybersecurity AI models will be improved and more general if we include semi-structured representations of background knowledge. This could include information about the software and systems, as well as information obtained from observing the behavior of malware samples captured and detonated in honeypots. We describe how we can transfer this knowledge into forms that the RL models can directly use for decision-making purposes.",
        "Cyber defense exercises are an important avenue to understand the technical capacity of organizations when faced with cyber-threats. Information derived from these exercises often leads to finding unseen methods to exploit vulnerabilities in an organization. These often lead to better defense mechanisms that can counter previously unknown exploits. With recent developments in cyber battle simulation platforms, we can generate a defense exercise environment and train reinforcement learning (RL) based autonomous agents to attack the system described by the simulated environment. In this paper, we describe a two-player game-based RL environment that simultaneously improves the performance of both the attacker and defender agents. We further accelerate the convergence of the RL agents by guiding them with expert knowledge from Cybersecurity Knowledge Graphs on attack and mitigation steps. We …",
        " Social isolation is an important predictor of mortality and morbidity in older persons. The increase in social isolation is often a result of major life events such as retirement, leading to the loss of social connections. The effects of the pandemic have exacerbated the loss of social connectedness. Measures to ensure social distancing have made technologies like voice and video calling, text messaging, and other phone mediated communication important resources for connecting people. Measuring social isolation often requires periodic administration of a paper survey instrument, like the Lubben Social Network Scale (LSNS). The approach was taken by Lubben for predicting a person’s social isolation level typically involves looking at their general frequency of interactions with family and friends along with the specific frequencies of private, tentative discussions happening during those interactions. This paper …",
        "The electrical grid is rapidly changing. Microgrids, distributed energy resources, and increased automation in decision-making enabled by smart sensors have bridged the gap between utilities and end users by increasing transparency and allowing consumers to monitor and control their electricity usage efficiently via advanced metering infrastructure. The intelligent sensors have enabled system operators to continually monitor the power system in real time and take appropriate measures to prevent system breakdowns. The power grid’s cyber-physical security has gained more attention in the research community in the recent past. Smart devices and communication infrastructure are vulnerable to cyber threats, and if their security is compromised, then the consequence can be devastating. This chapter presents the basics of data manipulation attacks on the smart grid targeting power system state estimation (PSSE), a core function of the energy management system (EMS) on which power system operations and security analysis heavily depend; and artificial intelligence (AI)-aided methods to detect the data manipulation in real time."
    ],
    "title": [
        "‪Demonstration of denial of charging attack on electric vehicle charging infrastructure and its consequences‬",
        "‪A privacy-preserving anomaly diagnosis scheme for AC microgrids‬",
        "‪KiNETGAN: Enabling Distributed Network Intrusion Detection through Knowledge-Infused Synthetic Data Generation‬",
        "‪PrivComp-KG: Leveraging Knowledge Graph and Large Language Models for Privacy Policy Compliance Verification‬",
        "‪Opioid and Antimicrobial Prescription Patterns During Emergency Medicine Encounters Among Uninsured Patients‬",
        "‪Privacy-Preserving Data Sharing in Agriculture: Enforcing Policy Rules for Secure and Confidential Data Synthesis‬",
        "‪FABULA: Intelligence Report Generation Using Retrieval-Augmented Narrative Construction‬",
        "‪Change Management using Generative Modeling on Digital Twins‬",
        "‪Knowledge-Enhanced Neurosymbolic Artificial Intelligence for Cybersecurity and Privacy‬",
        "‪Knowledge Graph-driven Tabular Data Discovery from Scientific Documents‬",
        "‪Exploring the clinical translation of generative models like ChatGPT: promise and pitfalls in radiology, from patients to population health‬",
        "‪Knowledge Infusion in Privacy Preserving Data Generation‬",
        "‪Knowledge-enhanced Neuro-Symbolic AI for Cybersecurity and Privacy‬",
        "‪A Practical Entity Linking System for Tables in Scientific Literature‬",
        "‪Towards Semantic Exploration of Tables in Scientific Documents‬",
        "‪Bewitching the Battlefield: Repurposing the MouseJack Attack for Crazyflie Drones‬",
        "‪Offline RL+ CKG: A hybrid AI model for cybersecurity tasks‬",
        "‪Knowledge guided Two-player Reinforcement Learning for Cyber Attacks and Defenses‬",
        "‪DEVELOPING A MOBILE PHONE APPLICATION TO DETECT SOCIAL ISOLATION OVER MULTIPLE TIME POINTS‬",
        "‪Artificial intelligence-aided detection of data manipulation attacks in smart grid‬"
    ]
}