{
    "scholar_id": "x8h02QMAAAAJ",
    "description": [
        "This paper presents a documentation and testing artifact for Co-zyBench [1], a benchmarking platform to evaluate and optimize thermal comfort provision systems in smart buildings. Co-zyBench is based on a co-simulation middleware that mediates between a Digital Twin (DT) of the smart building and HVAC system and a DT of the occupants of the building that simulates their dynamic thermal preference in different spaces. The DTs that support Co-zyBench are generated based on information about the space in which the thermal comfort system has to be evaluated. Co-zyBench includes a set of metrics that consider energy consumption, thermal comfort, and equality towards the occupants. Also, the benchmark includes a set of DTs based on standard buildings and HVAC systems and occupants (with different thermal preference distributions to represent diversity). Co-zyBench is based on the following …",
        "Heating, Ventilation, and Air Conditioning (HVAC) systems account for 40% to 50% of energy usage in commercial buildings. Thus, innovative ways to control and manage HVAC systems while preserving occupants' comfort are required. State-of-the-art solutions employ pervasive systems with sensors or smart devices to gauge individual thermal sensations, yet assessing these methods is challenging. Real-world experiments are expensive, limited in access, and often overlook occupant and regional diversity. To address this, we introduce Co-zyBench, a benchmark tool using a Digital Twin (DT) approach for evaluating personalized thermal comfort systems. It employs a co-simulation middleware interfacing between a DT of the smart building and its HVAC system and another DT representing occupants' dynamic thermal preferences in various spaces. The DTs that support Co-zyBench are generated based on …",
        "Heating, Ventilation, and Air Conditioning (HVAC) systems account for a significant portion of energy consumption within buildings. In order to balance the effect of thermal comfort vis-a-vis energy savings, HVAC control strategies have been proposed. However, the strategies are static and do not take into account dynamic changes of consumers, hence creating sub-optimal outcomes. This paper proposes DEMSA, a Digital Twin (DT)-enabled middleware for the self-adaptation of smart buildings. The DEMSA middleware interconnects and coordinates intelligent data exchange between the building edge server, digital twin and Artificial Intelligence (AI) planning nodes in order to invoke appropriate strategies. Moreover, DEMSA is paired with a self-adaptive mechanism that can detect the anomaly of generated planning and adaptively modify it. This process ensures balancing building energy consumption and …",
        "Privacy policies inform users about the data management practices of organizations. Yet, their complexity often renders them largely incomprehensible to the average user, necessitating the development of privacy assistants. With the advent of generative AI (genAI) technologies, there is an untapped potential to enhance privacy assistants in answering user queries effectively. However, the reliability of genAI remains a concern due to its propensity for generating incorrect or misleading information. This study introduces GenAIPABench, a novel benchmarking framework designed to evaluate the performance of Generative AI-based Privacy Assistants (GenAIPAs). GenAIPABench comprises: 1) A comprehensive set of questions about an organization's privacy policy and a data protection regulation, along with annotated answers for several organizations and regulations; 2) A robust set of evaluation metrics for assessing the accuracy, relevance, and consistency of the generated responses; and 3) An evaluation tool that generates appropriate prompts to introduce the system to the privacy document and different variations of the privacy questions to evaluate its robustness. We use GenAIPABench to assess the potential of three leading genAI systems in becoming GenAIPAs: ChatGPT, Bard, and Bing AI. Our results demonstrate significant promise in genAI capabilities in the privacy domain while also highlighting challenges in managing complex queries, ensuring consistency, and verifying source accuracy.",
        "As the adoption of smart devices continues to permeate all aspects of our lives, concerns surrounding user privacy have become more pertinent than ever before. While privacy policies define the data management practices of their manufacturers, previous work has shown that they are rarely read and understood by users. Hence, automatic analysis of privacy policies has been shown to help provide users with appropriate insights. Previous research has extensively analyzed privacy policies of websites, e-commerce, and mobile applications, but privacy policies of smart devices, present some differences and specific challenges such as the difficulty to find and collect them. We present PrivacyLens, a novel framework for discovering and collecting past, present, and future smart device privacy policies and harnessing NLP and ML algorithms to analyze them. PrivacyLens is currently deployed, collecting, analyzing, and publishing insights about privacy policies to assist different stakeholders of smart devices, such as users, policy authors, and regulators. We show several examples of analytical tasks enabled by PrivacyLens, including comparisons of devices per type and manufacturing country, categorization of privacy policies, and impact of data regulations on data practices. At the time of submitting this paper, PrivacyLens had collected and analyzed more than 1,200 privacy policies for 7,300 smart device",
        "This paper presents SmartSPEC, an approach to generate customizable synthetic smart space datasets using sensorized spaces in which people and events are embedded. Smart space datasets are critical to design, deploy and evaluate systems and applications under issues of heterogeneity, scalability and robustness, leading to cost-effective operation which improves the safety, comfort and convenience experienced by space occupants. However, many challenges exist in obtaining realistic smart space datasets for testing and validation, from a lack of fine-grained sensing to privacy/security concerns. SmartSPEC is a smart space simulator and data generator that leverages a semantic model augmented with user-defined constraints to represent important attributes, relationships, and external domain knowledge for a smart space. We employ machine learning (ML) approaches to extract relevant patterns from a …",
        "With the proliferation of digital transactions, trust is becoming increasingly important, as exemplified by the World Economic Forum’s Data Free Flow with Trust. Digital signatures are utilized to establish trust to prevent spoofing and unauthorized modification of transmitted digital data. However, the extent of trust is limited by jurisdictions, trusted lists and bridge certificate authorities, and does not have international coverage. For this reason, mutual recognition is needed, ie trust relationships established across countries. Establishing mutual recognition is complex and time-demanding due to the legislations, systems, and technologies involved. In parallel, electronic signatures consist of complex systems and structures and, thus, focusing on the technical requirements and solutions can enhance mutual recognition processes. The purpose of our approach is to develop a testbed that can verify technical aspects of mutual recognition. This paper describes the concept of the testbed “Hakoniwa” which includes analyzing the requirements, simulating and testing mutual recognition trust services across US, UK, EU and JP.",
        "This paper presents Sentaur, a middleware designed, built, and deployed to support sensor-based smart space analytical applications. Sentaur supports a powerful data model that decouples semantic data (about the application domain) from sensor data (using which the semantic data is derived). By supporting mechanisms to map/translate data, concepts, and queries between the two levels, Sentaur relieves application developers from having to know or reason about either capabilities of sensors or write sensor specific code. This paper describes Sentaur's data model, its translation strategy, and highlights its benefits through real-world case studies.",
        "Smart space administration and application development is challenging in part due to the semantic gap that exists between the high-level requirements of users and the low-level capabilities of IoT devices. The stakeholders in a smart space are required to deal with communicating with specific IoT devices, capturing data, processing it, and abstracting it out to generate useful inferences. Additionally, this makes reusability of smart space applications difficult, since they are developed for specific sensor deployments. In this article, we present a holistic approach to IoT smart spaces, the SemIoTic ecosystem, to facilitate application development, space management, and service provision to its inhabitants. The ecosystem is based on a centralized repository, where developers can advertise their space-agnostic applications, and a SemIoTic system deployed in each smart space that interacts with those applications to …",
        "Non-negative matrix factorization (NMF) with missing-value completion is a well-known effective Collaborative Filtering (CF) method used to provide personalized user recommendations. However, traditional CF relies on the privacy-invasive collection of users' explicit and implicit feedback to build a central recommender model. One-shot federated learning has recently emerged as a method to mitigate the privacy problem while addressing the traditional communication bottleneck of federated learning. In this paper, we present the first unsupervised one-shot federated CF implementation, named FedSPLIT, based on NMF joint factorization. In our solution, the clients first apply local CF in-parallel to build distinct client-specific recommenders. Then, the privacy-preserving local item patterns and biases from each client are shared with the processor to perform joint factorization in order to extract the global item patterns. Extracted patterns are then aggregated to each client to build the local models via knowledge distillation. In our experiments, we demonstrate the feasibility of our approach with standard recommendation datasets. FedSPLIT can obtain similar results than the state of the art (and even outperform it in certain situations) with a substantial decrease in the number of communications.",
        "This artifact abstract is a guideline for SmartSPEC [1], a simulator for generating customizable smart space datasets using semantic models of spaces, people, events and sensors. SmartSPEC is based on two main components: (i) Scenario Learning which produces metamodels of events and people using input seed data; and (ii) Scenario Generation which uses SmartSPEC data to generate a realistic smart space dataset. The realistic synthetic smart space dataset generated by SmartSPEC can be used for different tasks including, but not limited to, testing and validating approaches for sensor placement, location-based technologies, and sensor data management.",
        "This paper presents SmartSPEC, an approach to generate customizable smart space datasets using sensorized spaces in which people and events are embedded. Smart space datasets are critical to design, deploy and evaluate robust systems and applications to ensure cost-effective operation and safety/-comfort/convenience of the space occupants. Often, real-world data is difficult to obtain due to the lack of fine-grained sensing; privacy/security concerns prevent the release and sharing of individual and spatial data. SmartSPEC is a smart space simulator and data generator that can create a digital representation (twin) of a smart space and its activities. SmartSPEC uses a semantic model and ML-based approaches to characterize and learn attributes in a sensorized space, and applies an event-driven simulation strategy to generate realistic simulated data about the space (events, trajectories, sensor datasets …",
        "Non-negative matrix factorization (NMF) with missing-value completion is a well-known effective Collaborative Filtering (CF) method used to provide personalized user recommendations. However, traditional CF relies on a privacy-invasive collection of user data to build a central recommender model. One-shot federated learning has recently emerged as a method to mitigate the privacy problem while addressing the traditional communication bottleneck of federated learning. In this paper, we present the first one-shot federated CF implementation, named One-FedCF, for groups of users or collaborating organizations. In our solution, the clients first apply local CF in-parallel to build distinct, client-specific recommenders. Then, the privacy-preserving local item patterns and biases from each client are shared with the processor to perform joint factorization in order to extract the global item patterns. Extracted patterns are …",
        "Emerging domains, such as sensor-driven smart spaces and social media analytics, require incoming data to be enriched prior to its use. Enrichment often consists of machine learning (ML) functions that are too expensive/infeasible to execute at ingestion. We develop a strategy entitled Just-in-time ENrichmeNt in quERy Processing (JENNER) to support interactive analytics over data as soon as it arrives for such application context. JENNER exploits the inherent tradeoffs of cost and quality often displayed by the ML functions to progressively improve query answers during query execution. We describe how JENNER works for a large class of SPJ and aggregation queries that form the bulk of data analytics workload. Our experimental results on real datasets (IoT and Tweet) show that JENNER achieves progressive answers performing significantly better than the naive strategies of achieving progressive computation.",
        "This paper describes the collaborative effort between privacy and security researchers at nine different institutions along with researchers at the Naval Information Warfare Center to deploy, test, and demonstrate privacy-preserving technologies in creating sensor-based awareness using the Internet of Things (IoT) aboard naval vessels in the context of the US Navy’s Trident Warrior 2019 exercise. Funded by DARPA through the Brandeis program, the team built an integrated IoT data management middleware, entitled TIPPERS, that supports privacy by design and integrates a variety of Privacy Enhancing Technologies (PETs), including differential privacy, computation on encrypted data, and fine-grained policies. We describe the architecture of TIPPERS and its use in creating a smart ship that offers IoT-enabled services such as occupancy analysis, fall detection, detection of unauthorized access to spaces, and …",
        "This paper proposes SmartBench, a benchmark focusing on queries resulting from (near) real-time applications and longer-term analysis of IoT data. SmartBench, derived from a deployed smart building monitoring system, is comprised of: 1) An extensible schema that captures the fundamentals of an IoT smart space; 2) A set of representative queries focusing on analytical tasks; and 3) A data generation tool that generates large amounts of synthetic sensor and semantic data based on seed data collected from a real system. We present an evaluation of seven representative database systems and highlight some interesting findings that can be considered when deciding what database technologies to use under different types of IoT query workloads.",
        "Location-Based Services (LBS) are attracting a great interest with the fast expansion of mobile computing nowadays. These services use the user location to customize the offered information. However, most of those services are designed for specific scenarios and goals with implicit knowledge about the application context. As a consequence, hundreds of them are available (even with the same purpose). So, it is difficult for users to choose the most suitable service as they are in charge of knowing/finding the services which will be interesting for them, and handle the information that such services need. In this paper, we present an approach to handle LBS for mobile users which relieves them from knowing and managing the knowledge related to such services. This approach consists of a proposal for the modeling of such information as ontologies, which are handled by an agent-based architecture. Also, we …",
        "Current approaches of enforcing FGAC in Database Management Systems (DBMS) do not scale in scenarios when the number of policies are in the order of thousands. This paper identifies such a use case in the context of emerging smart spaces wherein systems may be required by legislation, such as Europe's GDPR and California's CCPA, to empower users to specify who may have access to their data and for what purposes. We present Sieve, a layered approach of implementing FGAC in existing database systems, that exploits a variety of it's features such as UDFs, index usage hints, query explain; to scale to large number of policies. Given a query, Sieve exploits it's context to filter the policies that need to be checked. Sieve also generates guarded expressions that saves on evaluation cost by grouping the policies and cuts the read cost by exploiting database indices. Our experimental results, on two DBMS and two different datasets, show that Sieve scales to large data sets and to large policy corpus thus supporting real-time access in applications including emerging smart environments.",
        "This paper explores the data cleaning challenges that arise in using WiFi connectivity data to locate users to semantic indoor locations such as buildings, regions, rooms. WiFi connectivity data consists of sporadic connections between devices and nearby WiFi access points (APs), each of which may cover a relatively large area within a building. Our system, entitled semantic LOCATion cleanER (LOCATER), postulates semantic localization as a series of data cleaning tasks - first, it treats the problem of determining the AP to which a device is connected between any two of its connection events as a missing value detection and repair problem. It then associates the device with the semantic subregion (e.g., a conference room in the region) by postulating it as a location disambiguation problem. LOCATER uses a bootstrapping semi-supervised learning method for coarse localization and a probabilistic method to achieve finer localization. The paper shows that LOCATER can achieve significantly high accuracy at both the coarse and fine levels.",
        "We present our experiences in adapting and deploying TIPPERS1, a novel privacy-enabled IoT data collection and management system for smart spaces, to facilitate the monitoring of adherence to COVID-19 regulations in a university campus and a military facility."
    ],
    "title": [
        "‪Artifact: Co-zyBench: A Thermal Comfort Provision Benchmark for Smart Buildings‬",
        "‪Co-zybench: Using co-simulation and digital twins to benchmark thermal comfort provision in smart buildings‬",
        "‪DEMSA: a DT-enabled Middleware for Self-adaptive Smart Spaces‬",
        "‪GenAIPABench: A Benchmark for Generative AI-based Privacy Assistants‬",
        "‪PrivacyLens: A Framework to Collect and Analyze the Landscape of Past, Present, and Future Smart Device Privacy Policies‬",
        "‪SmartSPEC: A framework to generate customizable, semantics-based smart space datasets‬",
        "‪International Mutual Recognition: A Description of Trust Services in US, UK, EU and JP and the Testbed “Hakoniwa”‬",
        "‪Sentaur: Sensor Observable Data Model for Smart Spaces‬",
        "‪The semiotic ecosystem: A semantic bridge between IoT devices and smart spaces‬",
        "‪FedSPLIT: One-Shot Federated Recommendation System Based on Non-negative Joint Matrix Factorization and Knowledge Distillation‬",
        "‪Artifact: SmartSPEC: customizable smart space datasets via event-driven simulations‬",
        "‪SmartSPEC: customizable smart space datasets via event-driven simulations‬",
        "‪One-Shot Federated Group Collaborative Filtering‬",
        "‪JENNER: Just-in-time Enrichment in Query Processing‬",
        "‪Transitioning from testbeds to ships: an experience study in deploying the TIPPERS Internet of Things platform to the US Navy‬",
        "‪Smartbench: A benchmark for data management in smart spaces‬",
        "‪A Knowledge-Based Approach to Enhance Provision of Location-Based Services in Wireless Environments‬",
        "‪Sieve: A Middleware Approach to Scalable Access Control for Database Management Systems‬",
        "‪LOCATER: Cleaning WiFi Connectivity Datasets for Semantic Localization‬",
        "‪A Privacy-Enabled Platform for COVID-19 Applications‬"
    ]
}